{
  "filename": "cluster.md",
  "__html": "<h1>Cluster Deployment</h1>\n<p>Cluster deployment is to deploy the DolphinScheduler on multiple machines for running a large number of tasks in production.</p>\n<p>If you are a green hand and want to experience DolphinScheduler, we recommended you install follow <a href=\"standalone.md\">Standalone</a>. If you want to experience more complete functions or schedule large tasks number, we recommended you install follow <a href=\"pseudo-cluster.md\">pseudo-cluster deployment</a>. If you want to using DolphinScheduler in production, we recommended you follow <a href=\"cluster.md\">cluster deployment</a> or <a href=\"kubernetes.md\">kubernetes</a></p>\n<h2>Deployment Step</h2>\n<p>Cluster deployment uses the same scripts and configuration files as we deploy in <a href=\"pseudo-cluster.md\">pseudo-cluster deployment</a>, so the prepare and required are the same as pseudo-cluster deployment. The difference is that <a href=\"pseudo-cluster.md\">pseudo-cluster deployment</a> is for one machine, while cluster deployment (Cluster) for multiple. and the steps of &quot;Modify configuration&quot; are quite different between pseudo-cluster deployment and cluster deployment.</p>\n<h3>Prepare &amp;&amp; DolphinScheduler startup environment</h3>\n<p>Because of cluster deployment for multiple machine, so you have to run you &quot;Prepare&quot; and &quot;startup&quot; in every machine in <a href=\"pseudo-cluster.md\">pseudo-cluster.md</a>, except section &quot;Configure machine SSH password-free login&quot;, &quot;Start zookeeper&quot;, &quot;Initialize the database&quot;, which is only for deployment or just need an single server</p>\n<h3>Modify configuration</h3>\n<p>This is a step that is quite different from <a href=\"pseudo-cluster.md\">pseudo-cluster.md</a>, because the deployment script will transfer the resources required for installation machine to each deployment machine using <code>scp</code>. And we have to declare all machine we want to install DolphinScheduler and then run script <code>install.sh</code>. The configuration file is under the path <code>conf/config/install_config.conf</code>, here we only need to modify section <strong>INSTALL MACHINE</strong>, <strong>DolphinScheduler ENV, Database, Registry Server</strong> and keep other same as [pseudo-cluster deployment](pseudo-cluster .md), the following describes the parameters that must be modified</p>\n<pre><code class=\"language-shell\"><span class=\"hljs-meta\">#</span><span class=\"bash\"> ---------------------------------------------------------</span>\n<span class=\"hljs-meta\">#</span><span class=\"bash\"> INSTALL MACHINE</span>\n<span class=\"hljs-meta\">#</span><span class=\"bash\"> ---------------------------------------------------------</span>\n<span class=\"hljs-meta\">#</span><span class=\"bash\"> Using IP or machine hostname <span class=\"hljs-keyword\">for</span> server going to deploy master, worker, API server, the IP of the server</span>\n<span class=\"hljs-meta\">#</span><span class=\"bash\"> If you using hostname, make sure machine could connect each others by hostname</span>\n<span class=\"hljs-meta\">#</span><span class=\"bash\"> As below, the hostname of the machine deploying DolphinScheduler is ds1, ds2, ds3, ds4, ds5, <span class=\"hljs-built_in\">where</span> ds1, ds2 install master server, ds3, ds4, and ds5 installs worker server, the alert server is installed <span class=\"hljs-keyword\">in</span> ds4, and the api server is installed <span class=\"hljs-keyword\">in</span> ds5</span>\nips=&quot;ds1,ds2,ds3,ds4,ds5&quot;\nmasters=&quot;ds1,ds2&quot;\nworkers=&quot;ds3:default,ds4:default,ds5:default&quot;\nalertServer=&quot;ds4&quot;\napiServers=&quot;ds5&quot;\npythonGatewayServers=&quot;ds5&quot;\n</code></pre>\n<h2>Start DolphinScheduler &amp;&amp; Login DolphinScheduler &amp;&amp; Server Start And Stop</h2>\n<p>Same as <a href=\"http://pseudo-cluster.md\">pseudo-cluster.md</a>](<a href=\"http://pseudo-cluster.md\">pseudo-cluster.md</a>)</p>\n",
  "link": "/dist/en-us/docs/2.0.2/user_doc/guide/installation/cluster.html",
  "meta": {}
}