{
  "filename": "e2e-guide.md",
  "__html": "<h1>DolphinScheduler E2E Test Contribution Guide</h1>\n<p>The main purpose of E2E test is to verify the integration and data integrity of the system, and its components, by simulating real user scenarios. This makes it possible to extend the scope of testing and ensure the health and stability of the system. To a certain extent, the test workload and costs are reduced. In simple terms, E2E testing is about treating a program as a black box and simulating the access behaviour of a real system from the user's point of view to see if the input to the test (user behaviour/simulated data) gives the expected results. Therefore, the community decided to add E2E automated testing to DolphinScheduler.</p>\n<p>The current community E2E test has not yet reached full coverage, so this document has been written with the aim of guiding more partners to get involved.</p>\n<h3>How to find the corresponding ISSUE?</h3>\n<p>The E2E test pages are currently divided into four pages: Project Management, Resource Center, DataSource, and Security Center.</p>\n<p>Contributors can find the task by going to GitHub, searching for <a href=\"https://github.com/apache/dolphinscheduler\">apace/dolphinscheduler</a>, and then searching for <code>e2e test cases</code> in the <a href=\"https://github.com/apache/dolphinscheduler/issues?q=is%3Aissue+is%3Aopen+e2e+test+cases\">issue list</a>. As shown below.</p>\n<p><img src=\"/img/community/join/e2e/e2e-issue.png\" alt=\"e2e-issue\"></p>\n<p>In each issue, we list the content to be tested and the expected results, which can be seen in the Description. Once you are on the current page, you can select the issue you are interested in, for example, to participate in the Security Center test, just leave a comment under the corresponding issue about the case you want to test.</p>\n<ul>\n<li>Task status: If the test has been completed, it is considered finished and as a contributor you need to find the outstanding tests.</li>\n<li>number: Test case serial number.</li>\n<li>function module: Functional modules to be tested, a functional module containing multiple test cases.</li>\n<li>test point: Specific examples of what needs to be tested. For example button click actions on pages, page jump functions.</li>\n<li>priority: The priority of the test case, <strong>which is recommended to find a high priority</strong>.</li>\n<li>service: The service that needs to be started during the test process.</li>\n<li>test steps: The test steps to be performed for each test case.</li>\n<li>expected results: The expected test results.</li>\n<li>actual results: The actual results.</li>\n<li>remarks: The precautions needed during the test process.</li>\n</ul>\n<p><img src=\"/img/community/join/e2e/e2e-security.png\" alt=\"e2e-security\"></p>\n<h3>How to write test code?</h3>\n<p>After taking up the corresponding task, the next step is to get to the crux of writing the code. Many partners may not be familiar with E2E test codes, so you can refer to this page: <a href=\"https://dolphinscheduler.apache.org/en-us/development/e2e-test.html\">e2e-test</a>.</p>\n<h3>How to submit a Pull Request?</h3>\n<p>Participation in the open source community can take many forms, including issue, pull request and translation. To participate in the E2E testing process, contributors are first required to understand the simple process of submitting a pull request, see: <a href=\"../development/pull-request.md\">Pull Request</a>.</p>\n",
  "link": "/dist/en-us/community/join/e2e-guide.html",
  "meta": {}
}