{

  "DolphinScheduler_python_api_ci_cd": {
    "title": "DolphinScheduler Python API CI/CD",
    "author": "Leonard Nie",
    "dateStr": "2022-12-16",
    "desc": "DolphinScheduler Python API CI/CD... "
  },
  "DolphinScheduler_launches_aws_ami": {
    "title": "DolphinScheduler launches on the AWS AMI Application Marketplace",
    "author": "Leonard Nie",
    "dateStr": "2022-12-10",
    "desc": "Apache DolphinScheduler has officially launched on the AWS EC2 AMI application marketplace... "
  },
  "Quick-Start-with Apache-DolphinScheduler Machine-Learning Workflow": {
    "title": "Quick Start with Apache DolphinScheduler Machine Learning Workflow",
    "author": "Leonard Nie",
    "dateStr": "2022-12-5",
    "desc": "With the release of Apache DolphinScheduler 3.1.0, many AI components... "
  },
  "How_can_more_people_benefit_from_big_data": {
    "title": "How can more people benefit from big data?",
    "author": "Leonard Nie",
    "dateStr": "2022-10-29",
    "desc": "During the ApacheCon Asia 2022, Chen Wei, who has more than 10 years... "
  },
  "Python_API_and_AWS_Support": {
    "title": "apache DolphinScheduler Extends Capabilities Through Python API and AWS Support",
    "author": "Leonard Nie",
    "dateStr": "2022-8-26",
    "desc": "In the ever-changing world of technology, data is abundant. ... "
  },
  "DolphinScheduler_Kubernetes_Technology_in_action": {
    "title": "Technical Practice of Apache DolphinScheduler in Kubernetes System",
    "author": "Leonard Nie",
    "dateStr": "2022-2-24",
    "desc": "Kubernetes is a cluster system based on container technology, "
  },
  "Json_Split": {
    "title": "Why did we split the big json of DAG in workflow definition?",
    "author": "JinyLeeChina",
    "translator": "QuakeWang",
    "dateStr": "2021-06-03",
    "desc": "The task and relationship in the workflow of Dolphinscheduler is saved as the process_definition_json field that saves the process_definiton table in the database in a large JSON. If a workflow is large, this JSON field has become a result. Very big, you need to analyze JSON when using it, it costs very much, and the task cannot be reused, so the community plan launches the JSON split project."
  },
  "DAG": {
    "title": " Big Data Workflow Task Scheduling - Directed Acyclic Graph (DAG) for Topological Sorting",
    "author": "LidongDai",
    "translator": "QuakeWang",
    "dateStr": "2021-05-06",
    "desc": "DAG: Full name Directed Acyclic Graph，referred to as DAG。Tasks in the workflow are assembled in the form of directed acyclic graphs, which are topologically traversed from nodes with zero indegrees of ingress until there are no successor nodes."
  }
}
