{
  "filename": "code-conduct.md",
  "__html": "<h1>Code of Conduct</h1>\n<p>The following Code of Conduct is based on full compliance with the <a href=\"https://www.apache.org/foundation/policies/conduct.html\">Apache Software Foundation Code of Conduct</a>.</p>\n<h2>Development philosophy</h2>\n<ul>\n<li><strong>Consistent</strong> code style, naming, and usage are consistent.</li>\n<li><strong>Easy to read</strong> code is obvious, easy to read and understand, when debugging one knows the intent of the code.</li>\n<li><strong>Neat</strong> agree with the concepts of《Refactoring》and《Code Cleanliness》and pursue clean and elegant code.</li>\n<li><strong>Abstract</strong> hierarchy is clear and the concepts are refined and reasonable. Keep methods, classes, packages, and modules at the same level of abstraction.</li>\n<li><strong>Heart</strong> Maintain a sense of responsibility and continue to be carved in the spirit of artisans.</li>\n</ul>\n<h2>Development specifications</h2>\n<ul>\n<li>Executing <code>mvn -U clean package -Prelease</code> can compile and test through all test cases.</li>\n<li>The test coverage tool checks for no less than dev branch coverage.</li>\n<li>In the root directory, use Checkstyle to check your code for special reasons for violating validation rules. The template location is located at ds_check_style.xml.</li>\n<li>Follow the coding specifications.</li>\n</ul>\n<h2>Coding specifications</h2>\n<ul>\n<li>Use linux line breaks.</li>\n<li>Indentation (including empty lines) is consistent with the last line.</li>\n<li>An empty line is required between the class declaration and the following variable or method.</li>\n<li>There should be no meaningless empty lines.</li>\n<li>Classes, methods, and variables should be named as the name implies and abbreviations should be avoided.</li>\n<li>Return value variables are named after <code>result</code>; <code>each</code> is used in loops to name loop variables; and <code>entry</code> is used in map instead of <code>each</code>.</li>\n<li>The cached exception is called <code>e</code>; Catch the exception and do nothing, and the exception is named <code>ignored</code>.</li>\n<li>Configuration Files are named in camelCase, and file names are lowercase with uppercase initial/starting letter.</li>\n<li>Code that requires comment interpretation should be as small as possible and interpreted by method name.</li>\n<li><code>equals</code> and <code>==</code> In a conditional expression, the constant is left, the variable is on the right, and in the expression greater than less than condition, the variable is left and the constant is right.</li>\n<li>In addition to the abstract classes used for inheritance, try to design the class as <code>final</code>.</li>\n<li>Nested loops are as much a method as possible.</li>\n<li>The order in which member variables are defined and the order in which parameters are passed is consistent across classes and methods.</li>\n<li>Priority is given to the use of guard statements.</li>\n<li>Classes and methods have minimal access control.</li>\n<li>The private method used by the method should follow the method, and if there are multiple private methods, the writing private method should appear in the same order as the private method in the original method.</li>\n<li>Method entry and return values are not allowed to be <code>null</code>.</li>\n<li>The return and assignment statements of if else are preferred with the tri-objective operator.</li>\n<li>Priority is given to <code>LinkedList</code> and only use <code>ArrayList</code> if you need to get element values in the collection through the index.</li>\n<li>Collection types such as <code>ArrayList</code>，<code>HashMap</code> that may produce expansion must specify the initial size of the collection to avoid expansion.</li>\n<li>Logs and notes are always in English.</li>\n<li>Comments can only contain <code>javadoc</code>, <code>todo</code> and <code>fixme</code>.</li>\n<li>Exposed classes and methods must have javadoc, other classes and methods and methods that override the parent class do not require javadoc.</li>\n</ul>\n<h2>Unit test specifications</h2>\n<ul>\n<li>\n<p>Test code and production code are subject to the same code specifications.</p>\n</li>\n<li>\n<p>Unit tests are subject to AIR (Automatic, Independent, Repeatable) Design concept.</p>\n<ul>\n<li>Automatic: Unit tests should be fully automated, not interactive. Manual checking of output results is prohibited, <code>System.out</code>, <code>log</code>, etc. are not allowed, and must be verified with assertions.</li>\n<li>Independent: It is prohibited to call each other between unit test cases and to rely on the order of execution. Each unit test can be run independently.</li>\n<li>Repeatable: Unit tests cannot be affected by the external environment and can be repeated.</li>\n</ul>\n</li>\n<li>\n<p>Unit tests are subject to BCDE（Border, Correct, Design, Error) Design principles.</p>\n<ul>\n<li>Border (Boundary value test): The expected results are obtained by entering the boundaries of loop boundaries, special values, data order, etc.</li>\n<li>Correct (Correctness test): The expected results are obtained with the correct input.</li>\n<li>Design (Rationality Design): Design high-quality unit tests in combination with production code design.</li>\n<li>Error (Fault tolerance test): The expected results are obtained through incorrect input such as illegal data, abnormal flow, etc.</li>\n</ul>\n</li>\n<li>\n<p>If there is no special reason, the test needs to be fully covered.</p>\n</li>\n<li>\n<p>Each test case needs to be accurately asserted.</p>\n</li>\n<li>\n<p>Prepare the environment for code separation from the test code.</p>\n</li>\n<li>\n<p>Only jUnit <code>Assert</code>，hamcrest <code>CoreMatchers</code>，Mockito Correlation can use static import.</p>\n</li>\n<li>\n<p>Single-data assertions should use <code>assertTrue</code>，<code>assertFalse</code>，<code>assertNull</code> and <code>assertNotNull</code>.</p>\n</li>\n<li>\n<p>Multi-data assertions should use <code>assertThat</code>.</p>\n</li>\n<li>\n<p>Accurate assertion, try not to use <code>not</code>，<code>containsString</code> assertion.</p>\n</li>\n<li>\n<p>The true value of the test case should be named actualXXX, and the expected value should be named expectedXXX.</p>\n</li>\n<li>\n<p>Classes and Methods with <code>@Test</code> labels do not require javadoc.</p>\n</li>\n<li>\n<p>Public specifications.</p>\n<ul>\n<li>Each line is no longer than <code>200</code> in length, ensuring that each line is semantically complete for easy understanding.</li>\n</ul>\n</li>\n</ul>\n",
  "link": "/dist/en-us/community/development/code-conduct.html",
  "meta": {}
}