{
  "filename": "commit-message.md",
  "__html": "<h1>Commit Message Notice</h1>\n<h3>Preface</h3>\n<p>A good commit message can help other developers (or future developers) quickly understand the context of related changes, and can also help project managers determine whether the commit is suitable for inclusion in the release. But when we checked the commit logs of many open source projects, we found an interesting problem. Some developers have very good code quality, but the commit message record is rather confusing. When other contributors or learners are viewing the code, it can’t be intuitively understood through commit log.\nThe purpose of the changes before and after the submission, as Peter Hutterer said：Re-establishing the context of a piece of code is wasteful. We can’t avoid it completely, so our efforts should go to reducing it as much as possible. Commit messages can do exactly that and as a result, a commit message shows whether a developer is a good collaborator. Therefore, DolphinScheduler developed the protocol in conjunction with other communities and official Apache documents.</p>\n<h3>Commit Message RIP</h3>\n<h4>1：Clearly modify the content</h4>\n<p>A commit message should clearly state what issues (bug fixes, function enhancements, etc.) the submission solves, so that other developers can better track the issues and clarify the optimization during the version iteration process.</p>\n<h4>2：Associate the corresponding Pull Request or Issue</h4>\n<p>When our changes are large, the commit message should best be associated with the relevant Issue or Pull Request on GitHub, so that our developers can quickly understand the context of the code submission through the associated information when reviewing the code. If the current commit is for an issue, then the issue can be closed in the Footer section.</p>\n<h4>3：Unified format</h4>\n<p>The formatted CommitMessage can help provide more historical information for quick browsing, and it can also generate a Change Log directly from commit.</p>\n<p>Commit message should include three parts: Header, Body and Footer. Among them, Header is required, Body and Footer can be omitted.</p>\n<h5>Header</h5>\n<p>The header part has only one line, including three fields: type (required), scope (optional), and subject (required).</p>\n<p>[DS-ISSUE number][type] subject</p>\n<p>(1) Type is used to indicate the category of commit, and only the following 7 types are allowed.</p>\n<ul>\n<li>feat：New features</li>\n<li>fix：Bug fixes</li>\n<li>docs：Documentation</li>\n<li>style： Format (does not affect changes in code operation)</li>\n<li>refactor：Refactoring (It is not a new feature or a code change to fix a bug)</li>\n<li>test：Add test</li>\n<li>chore：Changes in the build process or auxiliary tools</li>\n</ul>\n<p>If the type is feat and fix, the commit will definitely appear in the change log. Other types (docs, chore, style, refactor, test) are not recommended.</p>\n<p>(2) Scope</p>\n<p>Scope is used to indicate the scope of commit impact, such as server, remote, etc. If there is no suitable scope, you can use *.</p>\n<p>(3) subject</p>\n<p>Subject is a short description of the purpose of the commit, no more than 50 characters.</p>\n<h5>Body</h5>\n<p>The body part is a detailed description of this commit, which can be divided into multiple lines, and the line break will wrap with 72 characters to avoid automatic line wrapping affecting the appearance.</p>\n<p>Note the following points in the Body section:</p>\n<ul>\n<li>\n<p>Use the verb-object structure, note the use of present tense. For example, use change instead of changed or changes</p>\n</li>\n<li>\n<p>Don't capitalize the first letter</p>\n</li>\n<li>\n<p>The end of the sentence does not need a ‘.’ (period)</p>\n</li>\n</ul>\n<h5>Footer</h5>\n<p>Footer only works in two situations</p>\n<p>(1) Incompatible changes</p>\n<p>If the current code is not compatible with the previous version, the Footer part starts with BREAKING CHANGE, followed by a description of the change, the reason for the change, and the migration method.</p>\n<p>(2) Close Issue</p>\n<p>If the current commit is for a certain issue, you can close the issue in the Footer section, or close multiple issues at once.</p>\n<h5>For Example</h5>\n<pre><code>[DS-001][docs-en] add commit message\n\n- commit message RIP\n- build some conventions\n- help the commit messages become clean and tidy\n- help developers and release managers better track issues\n  and clarify the optimization in the version iteration\n\nThis closes #001\n</code></pre>\n<h3>Reference documents</h3>\n<p><a href=\"https://cwiki.apache.org/confluence/display/GEODE/Commit+Message+Format\">Commit message format</a></p>\n<p><a href=\"http://who-t.blogspot.com/2009/12/on-commit-messages.html\">On commit messages-Peter Hutterer</a></p>\n<p><a href=\"https://mp.weixin.qq.com/s/LKM4IXAY-7dKhTzGu5-oug\">RocketMQ Community Operation Conventions</a></p>\n",
  "link": "/dist/en-us/community/development/commit-message.html",
  "meta": {}
}