{
  "filename": "contribute.md",
  "__html": "<h1>Participate in Contributing</h1>\n<p>First of all, thank you very much for choosing and using DolphinScheduler, and welcome to join the DolphinScheduler family!</p>\n<p>We encourage any form of participation in the community that will eventually become Committer or PPMC Such as:</p>\n<ul>\n<li>Problems will be encountered via github on the <a href=\"https://github.com/apache/dolphinscheduler/issues\">issue</a> form feedback out.</li>\n<li>Answer the issue questions that others are asking.</li>\n<li>Help improve the documentation.</li>\n<li>Help your project add test cases.</li>\n<li>Add comments to the code.</li>\n<li>Submit a PR that fixes the bug or Feature.</li>\n<li>Publish application case practice, scheduling process analysis, or technical articles related to scheduling.</li>\n<li>Help promote DolphinScheduler, participate in technical conferences or meetup, sharing and more.</li>\n</ul>\n<p>Welcome to the contributing team and join open source starting with submitting your first PR.</p>\n<ul>\n<li>For example, add code comments or find &quot;easy to fix&quot; tags or some very simple issue (misspellings, etc.) and so on, first familiarize yourself with the submission process through the first simple PR.</li>\n</ul>\n<p>Note: Contributions are not limited to PR Only, but contribute to the development of the project.</p>\n<p>I'm sure you'll benefit from open source by participating in DolphinScheduler!</p>\n<h3>1. Participate in documentation contributions.</h3>\n<p>Refer to the <a href=\"document.md\">Submit Guide-Document Notice</a></p>\n<h3>2. Participate in code contributions.</h3>\n<p>Refer to the <a href=\"issue.md\">Submit Guide-Issue Notice</a>, <a href=\"pull-request.md\">Submit Guide-Pull Request Notice</a>, <a href=\"commit-message.md\">Submit Guide-Commit Message Notice</a></p>\n<h3>3. How to pick up an Issue and submit a Pull Request.</h3>\n<p>If you want to implement a Feature or fix a Bug. Please refer to the following:</p>\n<ul>\n<li>All Bugs and the new Features are recommended and managed using the Issues Page.</li>\n<li>If you want to develop a Feature, first reply to the Issue associated with that feature, indicating that you are currently working on it. And set yourself a &quot;deadline&quot; when to Submit the Feature, and add it in the reply comment.</li>\n<li>It's a good idea to find a mentor (or an instructor) in the core contributors who gives immediate feedback on design and functional implementation.</li>\n<li>You should create a new branch to start your work, to get the name of the branch refer to the <a href=\"pull-request.md\">Submit Guide-Pull Request Notice</a>. For example, if you want to complete the feature and submit Issue 111, your branch name should be feature-111. The feature name can be determined after discussion with the instructor.</li>\n<li>When you're done, send a Pull Request to dolphinscheduler, please refer to the《<a href=\"submit-code.md\">Submit Guide-Submit Pull Request Process</a>》</li>\n</ul>\n<p>If you want to submit a Pull Request to complete a Feature or fix a Bug, it is recommended that you start with the <code>good first issue</code>, <code>easy-to-fix</code> issues, complete a small function to submit, do not change too many files at a time, changing too many files will also put a lot of pressure on Reviewers, it is recommended to submit them through multiple Pull Requests, not all at once.</p>\n",
  "link": "/dist/en-us/community/development/contribute.html",
  "meta": {}
}