{
  "filename": "pull-request.md",
  "__html": "<h1>Pull Request Notice</h1>\n<h2>Preface</h2>\n<p>Pull Request is a way of software cooperation, which is a process of bringing code involving different functions into the trunk. During this process, the code can be discussed, reviewed, and modified.</p>\n<p>In Pull Request, we try not to discuss the implementation of the code. The general implementation of the code and its logic should be determined in Issue. In the Pull Request, we only focus on the code format and code specification, so as to avoid wasting time caused by different opinions on implementation.</p>\n<h2>Specification</h2>\n<h3>Pull Request Title</h3>\n<p>Title Format: [<code>Pull Request Type</code>-<code>Issue No</code>][<code>Module Name</code>] <code>Pull Request Description</code></p>\n<p>The corresponding relationship between <code>Pull Request Type</code> and <code>Issue Type</code> is as follows:</p>\n<table>\n    <thead>\n        <tr>\n            <th style=\"width: 10%; text-align: center;\">Issue Type</th>\n            <th style=\"width: 20%; text-align: center;\">Pull Request Type</th>\n            <th style=\"width: 20%; text-align: center;\">Example(Suppose Issue No is 3333)</th>\n        </tr>\n    </thead>\n    <tbody>\n        <tr>\n            <td style=\"text-align: center;\">Feature</td>\n            <td style=\"text-align: center;\">Feature</td>\n            <td style=\"text-align: center;\">[Feature-3333][server] Implement xxx</td>\n        </tr>\n        <tr>\n            <td style=\"text-align: center;\">Bug</td>\n            <td style=\"text-align: center;\">Fix</td>\n            <td style=\"text-align: center;\">[Fix-3333][server] Fix xxx</td>\n        </tr>\n        <tr>\n            <td style=\"text-align: center;\">Improvement</td>\n            <td style=\"text-align: center;\">Improvement</td>\n            <td style=\"text-align: center;\">[Improvement-3333][alert] Improve the performance of xxx</td>\n        </tr>\n        <tr>\n            <td style=\"text-align: center;\">Test</td>\n            <td style=\"text-align: center;\">Test</td>\n            <td style=\"text-align: center;\">[Test-3333][api] Add the e2e test of xxx</td>\n        </tr>\n        <tr>\n            <td style=\"text-align: center;\">Sub-Task</td>\n            <td style=\"text-align: center;\">(Parent type corresponding to Sub-Task)</td>\n            <td style=\"text-align: center;\">[Feature-3333][server] Implement xxx</td>\n        </tr>\n    </tbody>\n</table>\n<p><code>Issue No</code> refers to the Issue number corresponding to the current Pull Request to be resolved, <code>Module Name</code> is the same as the <code>Module Name</code> of Issue.</p>\n<h3>Pull Request Branch</h3>\n<p>Branch name format: <code>Pull Request type</code>-<code>Issue number</code>. e.g. Feature-3333</p>\n<h3>Pull Request Content</h3>\n<p>Please refer to the commit message section.</p>\n<h3>Pull Request Code Style</h3>\n<p>Code style is the thing you have to consider when you submit pull request for DolphinScheduler. We using <a href=\"https://checkstyle.sourceforge.io\">Checkstyle</a>, a development tool to help programmers write Java code that adheres to a coding standard, in CI to keep DolphinScheduler codebase in the same style. Your pull request could not be merged if your code style checker failed. You could format your code by <em>Checkstyle</em> in your local environment before you submit your pull request to check code style. The activation step as below:</p>\n<ol>\n<li>\n<p>Prepare Checkstyle configuration file: You could download it manually by <a href=\"https://github.com/apache/dolphinscheduler/blob/dev/style/checkstyle.xml\">click here</a>, but find it in DolphinScheduler repository would be a better way. You could find configuration file in the path <code>style/checkstyle.xml</code> after you clone repository from Github.</p>\n</li>\n<li>\n<p>Download Checkstyle plugins in Intellij IDEA: Search plugin by keyword <strong>CheckStyle-IDEA</strong> or install in <a href=\"https://plugins.jetbrains.com/plugin/1065-checkstyle-idea\">this page</a>. You could see <a href=\"https://www.jetbrains.com/help/idea/managing-plugins.html#install_plugin_from_repo\">install plugin</a> if you do not know how to install plugin in Intellij IDEA</p>\n</li>\n<li>\n<p>Configure and activate Checkstyle and Intellij IDEA code-style: After completing the above steps, you could configure and activate it in your environment. You could find Checkstyle plugins in the path <code>Preferences -&gt; Tool -&gt; Checkstyle</code>. After that you could activate Checkstyles as screenshot show</p>\n</li>\n</ol>\n<p align=\"center\">\n    <img src=\"/img/checkstyle-idea.png\" alt=\"checkstyle idea configuration\" />\n</p>\n<p>For now your Checkstyle plugins are setup, it would show codes and files which out of style. We highly recommend you configure Intellij IDEA code-style for auto-formatting your code in Intellij IDEA, you could find this setting in <code>Preferences -&gt; Editor -&gt; Code Style -&gt; Java</code> and then activate it as screenshot show</p>\n<p align=\"center\">\n    <img src=\"/img/code-style-idea.png\" alt=\"code style idea configuration\" />\n</p>\n<ol>\n<li>Format your codebase in Intellij IDEA before submit your pull request: After you done above steps, you could using Intellij IDEA shortcut <code>Command + L</code>(for Mac) or <code>Ctrl+L</code>(for Windows) to format your code. The best time to format your code is before you commit your change to your local git repository.</li>\n</ol>\n<h3>Question</h3>\n<ul>\n<li>\n<p>How to deal with one Pull Request to many Issues scenario.</p>\n<p>First of all, there are fewer scenarios for one Pull Request to many Issues.\nThe root cause is that multiple issues need to do the same thing.\nUsually, there are two solutions to this scenario: the first is to merge multiple issues with into the same issue, and then close the other issues;\nthe second is multiple issues have subtle differences.\nIn this scenario, the responsibilities of each issue can be clearly divided. The type of each issue is marked as Sub-Task, and then these sub task type issues are associated with one issue.\nAnd each Pull Request is submitted should be associated with only one issue of a sub task.</p>\n</li>\n</ul>\n",
  "link": "/dist/en-us/community/development/pull-request.html",
  "meta": {}
}