{
  "filename": "map-reduce.md",
  "__html": "<h1>MapReduce</h1>\n<h2>Overview</h2>\n<ul>\n<li>MapReduce(MR) task type for executing MapReduce programs. For MapReduce nodes, the worker submits the task by using the Hadoop command <code>hadoop jar</code>. See <a href=\"https://hadoop.apache.org/docs/current/hadoop-project-dist/hadoop-common/CommandsManual.html#jar\">Hadoop Command Manual</a> for more details.</li>\n</ul>\n<h2>Create Task</h2>\n<ul>\n<li>Click Project Management-Project Name-Workflow Definition, and click the &quot;Create Workflow&quot; button to enter the DAG editing page.</li>\n<li>Drag the <img src=\"/img/tasks/icons/mr.png\" width=\"15\"/> from the toolbar to the drawing board.</li>\n</ul>\n<h2>Task Parameter</h2>\n<ul>\n<li><strong>Node name</strong>: The node name in a workflow definition is unique.</li>\n<li><strong>Run flag</strong>: Identifies whether this node can be scheduled normally, if it does not need to be executed, you can turn on the prohibition switch.</li>\n<li><strong>Descriptive information</strong>: describe the function of the node.</li>\n<li><strong>Task priority</strong>: When the number of worker threads is insufficient, they are executed in order from high to low, and when the priority is the same, they are executed according to the first-in first-out principle.</li>\n<li><strong>Worker grouping</strong>: Tasks are assigned to the machines of the worker group to execute. If Default is selected, a worker machine will be randomly selected for execution.</li>\n<li><strong>Environment Name</strong>: Configure the environment name in which to run the script.</li>\n<li><strong>Number of failed retry attempts</strong>: The number of times the task failed to be resubmitted.</li>\n<li><strong>Failed retry interval</strong>: The time, in cents, interval for resubmitting the task after a failed task.</li>\n<li><strong>Delayed execution time</strong>: the time, in cents, that a task is delayed in execution.</li>\n<li><strong>Timeout alarm</strong>: Check the timeout alarm and timeout failure. When the task exceeds the &quot;timeout period&quot;, an alarm email will be sent and the task execution will fail.</li>\n<li><strong>Resource</strong>: Refers to the list of resource files that need to be called in the script, and the files uploaded or created by the resource center-file management.</li>\n<li><strong>Custom parameters</strong>: It is a user-defined parameter that is part of MapReduce, which will replace the content with ${variable} in the script.</li>\n<li><strong>Predecessor task</strong>: Selecting a predecessor task for the current task will set the selected predecessor task as upstream of the current task.</li>\n</ul>\n<h3>JAVA /SCALA Program</h3>\n<ul>\n<li><strong>Program type</strong>: select JAVA/SCALA program.</li>\n<li><strong>The class of the main function</strong>: is the full path of the Main Class, the entry point of the MapReduce program.</li>\n<li><strong>Main jar package</strong>: is the MapReduce jar package.</li>\n<li><strong>Task name</strong> (optional): MapReduce task name.</li>\n<li><strong>Command line parameters</strong>: set the input parameters of the MapReduce program and support the substitution of custom parameter variables.</li>\n<li><strong>Other parameters</strong>: support -D, -files, -libjars, -archives format.</li>\n<li><strong>Resource</strong>: If the resource file is referenced in other parameters, you need to select and specify in the resource</li>\n<li><strong>User-defined parameter</strong>: It is a user-defined parameter of the MapReduce part, which will replace the content with ${variable} in the script</li>\n</ul>\n<h2>Python program</h2>\n<ul>\n<li><strong>Program type</strong>: select Python language</li>\n<li><strong>Main jar package</strong>: is the Python jar package for running MR</li>\n<li><strong>Other parameters</strong>: support -D, -mapper, -reducer, -input -output format, here you can set the input of user-defined parameters, such as:</li>\n<li>-mapper &quot;<a href=\"http://mapper.py\">mapper.py</a> 1&quot; -file <a href=\"http://mapper.py\">mapper.py</a> -reducer <a href=\"http://reducer.py\">reducer.py</a> -file <a href=\"http://reducer.py\">reducer.py</a> –input /journey/words.txt -output /journey/out/mr/${currentTimeMillis}</li>\n<li>The <a href=\"http://mapper.py\">mapper.py</a> 1 after -mapper is two parameters, the first parameter is <a href=\"http://mapper.py\">mapper.py</a>, and the second parameter is 1</li>\n<li><strong>Resource</strong>: If the resource file is referenced in other parameters, you need to select and specify in the resource</li>\n<li><strong>User-defined parameter</strong>: It is a user-defined parameter of the MapReduce part, which will replace the content with ${variable} in the script</li>\n</ul>\n<h2>Task Example</h2>\n<h3>Execute the WordCount program</h3>\n<p>This example is a common introductory type of MapReduce application, which is designed to count the number of identical words in the input text.</p>\n<h4>Uploading the main package</h4>\n<p>When using the MapReduce task node, you will need to use the Resource Centre to upload the jar package for the executable. Refer to the <a href=\"../resource.md\">resource centre</a>.</p>\n<p>After configuring the Resource Centre, you can upload the required target files directly using drag and drop.</p>\n<p><img src=\"/img/tasks/demo/resource_upload.png\" alt=\"resource_upload\"></p>\n<h4>Configuring MapReduce nodes</h4>\n<p>Simply configure the required content according to the parameter descriptions above.</p>\n<p><img src=\"/img/tasks/demo/mr.png\" alt=\"demo-mr-simple\"></p>\n",
  "link": "/dist/en-us/docs/2.0.5/user_doc/guide/task/map-reduce.html",
  "meta": {}
}