{
  "filename": "shell.md",
  "__html": "<h1>Shell</h1>\n<h2>Overview</h2>\n<p>Shell task, used to create a shell-type task and execute a series of shell scripts. When the worker executed,\na temporary shell script is generated, and the Linux user with the same name as the tenant executes the script.</p>\n<h2>Create Task</h2>\n<ul>\n<li>Click Project Management-Project Name-Workflow Definition, and click the &quot;Create Workflow&quot; button to enter the DAG editing page.</li>\n<li>Drag <img src=\"/img/tasks/icons/shell.png\" width=\"15\"/> from the toolbar to the drawing board.</li>\n</ul>\n<h2>Task Parameter</h2>\n<ul>\n<li>Node name: The node name in a workflow definition is unique.</li>\n<li>Run flag: Identifies whether this node can be scheduled normally, if it does not need to be executed, you can turn on the prohibition switch.</li>\n<li>Descriptive information: describe the function of the node.</li>\n<li>Task priority: When the number of worker threads is insufficient, they are executed in order from high to low, and when the priority is the same, they are executed according to the first-in first-out principle.</li>\n<li>Worker grouping: Tasks are assigned to the machines of the worker group to execute. If Default is selected, a worker machine will be randomly selected for execution.</li>\n<li>Environment Name: Configure the environment name in which to run the script.</li>\n<li>Number of failed retry attempts: The number of times the task failed to be resubmitted. It supports drop-down and hand-filling.</li>\n<li>Failed retry interval: The time interval for resubmitting the task after a failed task. It supports drop-down and hand-filling.</li>\n<li>Timeout alarm: Check the timeout alarm and timeout failure. When the task exceeds the &quot;timeout period&quot;, an alarm email will be sent and the task execution will fail.</li>\n<li>Script: SHELL program developed by users.</li>\n<li>Resource: Refers to the list of resource files that need to be called in the script, and the files uploaded or created by the resource center-file management.</li>\n<li>Custom parameters: It is a user-defined parameter that is part of SHELL, which will replace the content with ${variable} in the script.</li>\n</ul>\n<h2>Task Example</h2>\n<h3>Simply Print</h3>\n<p>This example is a sample echo task which only print one line in the log file, including the content\n&quot;This is a demo of shell task&quot;. If your task only run one or two shell command, you could add task base on this example.</p>\n<p><img src=\"/img/tasks/demo/shell.jpg\" alt=\"demo-shell-simple\"></p>\n<h3>Custom Parameters</h3>\n<p>This example is a sample custom parameter task which could reuse existing as template, or for dynamic task. First of all,\nwe should declare a custom parameter named &quot;param_key&quot;, with the value as &quot;param_val&quot;. Then we using keyword &quot;${param_key}&quot;\nto using the parameter we just declared. After this example is being run, we would see &quot;param_val&quot; print in the log</p>\n<p><img src=\"/img/tasks/demo/shell_custom_param.jpg\" alt=\"demo-shell-custom-param\"></p>\n<h2>Notice</h2>\n<p>None</p>\n",
  "link": "/dist/en-us/docs/2.0.5/user_doc/guide/task/shell.html",
  "meta": {}
}