{
  "filename": "spark.md",
  "__html": "<h1>Spark</h1>\n<h2>Overview</h2>\n<p>Spark task type for executing Spark programs. For Spark nodes, the worker submits the task by using the spark command <code>spark submit</code>. See <a href=\"https://spark.apache.org/docs/3.2.1/submitting-applications.html#launching-applications-with-spark-submit\">spark-submit</a> for more details.</p>\n<h2>Create task</h2>\n<ul>\n<li>Click Project Management -&gt; Project Name -&gt; Workflow Definition, and click the &quot;Create Workflow&quot; button to enter the DAG editing page.</li>\n<li>Drag the <img src=\"/img/tasks/icons/spark.png\" width=\"15\"/> from the toolbar to the drawing board.</li>\n</ul>\n<h2>Task Parameter</h2>\n<ul>\n<li><strong>Node name</strong>: The node name in a workflow definition is unique.</li>\n<li><strong>Run flag</strong>: Identifies whether this node can be scheduled normally, if it does not need to be executed, you can turn on the prohibition switch.</li>\n<li><strong>Descriptive information</strong>: describe the function of the node.</li>\n<li><strong>Task priority</strong>: When the number of worker threads is insufficient, they are executed in order from high to low, and when the priority is the same, they are executed according to the first-in first-out principle.</li>\n<li><strong>Worker grouping</strong>: Tasks are assigned to the machines of the worker group to execute. If Default is selected, a worker machine will be randomly selected for execution.</li>\n<li><strong>Environment Name</strong>: Configure the environment name in which to run the script.</li>\n<li><strong>Number of failed retry attempts</strong>: The number of times the task failed to be resubmitted.</li>\n<li><strong>Failed retry interval</strong>: The time, in cents, interval for resubmitting the task after a failed task.</li>\n<li><strong>Delayed execution time</strong>: the time, in cents, that a task is delayed in execution.</li>\n<li><strong>Timeout alarm</strong>: Check the timeout alarm and timeout failure. When the task exceeds the &quot;timeout period&quot;, an alarm email will be sent and the task execution will fail.</li>\n<li><strong>Program type</strong>: supports Java, Scala and Python.</li>\n<li><strong>Spark version</strong>: support Spark1 and Spark2.</li>\n<li><strong>The class of main function</strong>: is the full path of Main Class, the entry point of the Spark program.</li>\n<li><strong>Main jar package</strong>: is the Spark jar package.</li>\n<li><strong>Deployment mode</strong>: support three modes of yarn-cluster, yarn-client and local.</li>\n<li><strong>Task name</strong> (option): Spark task name.</li>\n<li><strong>Driver core number</strong>: This is used to set the number of Driver core, which can be set according to the actual production environment.</li>\n<li><strong>Driver memory number</strong>: This is used to set the number of Driver memories, which can be set according to the actual production environment.</li>\n<li><strong>Number of Executor</strong>: This is used to set the number of Executor, which can be set according to the actual production environment.</li>\n<li><strong>Executor memory number</strong>: This is used to set the number of Executor memories, which can be set according to the actual production environment.</li>\n<li><strong>Main program parameters</strong>: set the input parameters of the Spark program and support the substitution of custom parameter variables.</li>\n<li><strong>Other parameters</strong>: support <code>--jars</code>, <code>--files</code>,<code>--archives</code>, <code>--conf</code> format.</li>\n<li><strong>Resource</strong>: Refers to the list of resource files that need to be called in the script, and the files uploaded or created by the resource center-file management.</li>\n<li><strong>Custom parameter</strong>: It is a local user-defined parameter of Spark, which will replace the content with ${variable} in the script.</li>\n<li><strong>Predecessor task</strong>: Selecting a predecessor task for the current task will set the selected predecessor task as upstream of the current task.</li>\n</ul>\n<h2>Task Example</h2>\n<h3>Execute the WordCount program</h3>\n<p>This is a common introductory case in the Big Data ecosystem, which often applied to computational frameworks such as MapReduce, Flink and Spark. The main purpose is to count the number of identical words in the input text.</p>\n<h4>Uploading the main package</h4>\n<p>When using the Spark task node, you will need to use the Resource Center to upload the jar package for the executable. Refer to the <a href=\"../resource.md\">resource center</a>.</p>\n<p>After configuring the Resource Center, you can upload the required target files directly using drag and drop.</p>\n<p><img src=\"/img/tasks/demo/upload_spark.png\" alt=\"resource_upload\"></p>\n<h4>Configuring Spark nodes</h4>\n<p>Simply configure the required content according to the parameter descriptions above.</p>\n<p><img src=\"/img/tasks/demo/spark_task.png\" alt=\"demo-spark-simple\"></p>\n<h2>Notice</h2>\n<p>JAVA and Scala are only used for identification, there is no difference, if it is Spark developed by Python, there is no class of the main function, the others are the same.</p>\n",
  "link": "/dist/en-us/docs/2.0.5/user_doc/guide/task/spark.html",
  "meta": {}
}