{
  "__html": "<h1>Apache DolphinScheduler 2.0.7 released, fixes complement and fault tolerance</h1>\n<p><img src=\"https://miro.medium.com/max/640/0*O7tYZm2aDL35U1Pb\" alt=\"\"></p>\n<p>Recently, Apache DolphinScheduler version 2.0.7 was officially released. The new version fixes some complement and fault tolerance bugs and solves problems such as inconsistent batch data.</p>\n<h1>Major bug fixes</h1>\n<h2>№1 The problem of continued detection of dependent while the dependent node contains tasks that are prohibited from running</h2>\n<ul>\n<li>In version 2.0.6, when a dependent node has a task that is forbidden to run, the dependent node will continue to detect the task instance for unable to find the task instance, since the forbidden task does not generate a task instance, resulting in the post-task of the dependent node not being submitted. This issue has been fixed in version 2.0.7.</li>\n<li>PR: https://github.com/apache/dolphinscheduler/pull/10952</li>\n</ul>\n<h2>№2 The problem of +1 day to the complement time by default</h2>\n<ul>\n<li>In the previous version, when October 1, 2022 was selected as the complement time, for the time parameter $[yyyy-MM-dd], the output date was 2022–10–02, which is not the expected date. To solve this problem, the new version subtracts one day from the complement date to correct the output date.</li>\n<li>Corresponding PR: https://github.com/apache/dolphinscheduler/pull/12376</li>\n</ul>\n<h2>№3 The problem that the task cannot be resubmitted when it is fault-tolerant</h2>\n<ul>\n<li>In the previous version, if there are 2 Worker nodes, each Worker is running 10 tasks and 10 internally -queued tasks. When Worker 1 hangs up, the state will turn to a fault-tolerant state because the status of all the running tasks and the tasks waiting to be run needs to be fault-tolerant. However, due to a bug, the fault-tolerant task will not be resubmitted, which will cause the running task background to show that the running is completed, while the task waiting to be run does not run, resulting in inconsistent batch data.</li>\n<li>Corresponding to PR https://github.com/apache/dolphinscheduler/pull/12423</li>\n</ul>\n<h1>Bug fix</h1>\n<ul>\n<li>Fix the problem that the disk monitoring in the monitoring interface is not displayed</li>\n<li>Fixed the problem of transferring parameters for tasks that failed to restore</li>\n<li>Fix the problem that the dependency node contains forbidden tasks and the dependency continues to detect</li>\n<li>Fix HTTP alert including content field in Post</li>\n<li>Fix the problem that the complement time is +1 day by default</li>\n<li>Fixed an issue where the retry time of failed tasks in the workflow did not work in some cases</li>\n<li>Fix the problem that the interface of workflow task relationship creation has no dependency detection</li>\n<li>Fix the problem that the task cannot be resubmitted when it is fault-tolerant</li>\n<li>Fix the problem that the prompt information is not clear when the tenant’s name is too long</li>\n</ul>\n<h1>Modify records</h1>\n<p>https://github.com/apache/dolphinscheduler/releases/tag/2.0.7</p>\n<h1>Download</h1>\n<p>https://dolphinscheduler.apache.org/en-us/download</p>\n<h1>Acknowledgement</h1>\n<p>This version, like version 2.0.6, is also tempered on the scheduling practice of 8000+ daily cumulative scheduling jobs in the production environment of Zhengcai Cloud and fixes the problems feed backed by the community. Special thanks to the Zhengcai Cloud Data Platform Department for their support of this release, and to all those who contributed to the release of Apache DolphinScheduler 2.0.7. It is your unremitting efforts to make the community progress!</p>\n<table>\n<thead>\n<tr>\n<th>danielfree</th>\n<th>edward-yang</th>\n<th>hstdream</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>lordk911</td>\n<td>retime123</td>\n<td>zwZjut</td>\n</tr>\n<tr>\n<td>Jekong-hao</td>\n<td>JinyLeeChina</td>\n<td>liqingwang</td>\n</tr>\n</tbody>\n</table>\n<p>How to contribute:</p>\n<ul>\n<li>\n<p>GitHub Code Repository: https://github.com/apache/dolphinscheduler</p>\n</li>\n<li>\n<p>Official Website:https://dolphinscheduler.apache.org/</p>\n</li>\n<li>\n<p>Mail List:dev@dolphinscheduler@apache.org</p>\n</li>\n<li>\n<p>Twitter:@DolphinSchedule</p>\n</li>\n</ul>\n",
  "time": "2022-10-28",
  "author": "Leonard Nie",
  "title": "Apache DolphinScheduler 2.0.7 released, fixes complement and fault tolerance",
  "type": "release",
  "label": "Release Note"
}