{
  "__html": "<h1>How can more people benefit from big data?</h1>\n<p><img src=\"https://miro.medium.com/max/640/1*2sUnAfzJd8nRlTKYDfIsvw.jpeg\" alt=\"\">\n<u>During the ApacheCon Asia 2022, Chen Wei, who has more than 10 years of experience in Big Data development and is head of an offline data factory development tool from a bank, delivered a keynote speech on how to enable more people to benefit from Big Data.</p>\n<p>Many thanks to volunteer Guan Bo for your text editing work, your contribution to Apache DolphinScheduler is what keeps the community moving forward!</u></p>\n<p>This presentation focused on the following four key elements.</p>\n<h1>Background Information</h1>\n<p>Business managers would like access to reliable data to help them make better business decisions.</p>\n<p>End-users want to get their data quickly within a few minutes or hours. They don’t want to go through the traditional process where they need to submit requirements to colleagues to the data department and wait weeks to get the data about requirement changes, development, and online implementation.</p>\n<p>Data development teams are getting bigger and more sophisticated to manage than ever before. Everyone who works with data wants immediate access to business data to help them make decisions.</p>\n<p>Data sources are becoming more complex, such as databases, web pages, logs, files, ERP, external data, etc.</p>\n<h2>User Needs</h2>\n<p>Advanced users are looking for limited self-service, with easy, analytical access to data through self-service.</p>\n<p>Application developers only care about the business logic, not the specific underlying technology, they also don’t want to go deeper into the configuration associated with platform operations and maintenance.</p>\n<p>Hiding as much technical detail as possible, allows business developers as well as business users to focus more on the business logic and achieving business goals.</p>\n<p>More user-friendly for system administrators, allowing them to quickly and easily manage the data platform effectively.</p>\n<p>Based on the above user requirements, we believe that DataOps is the way to go, and DataOps built on top of DevOps is the best way to achieve data agility.</p>\n<h2>What is DataOps?</h2>\n<p>DataOps is a collaborative data management practice focused on improving the communication, integration, and automation of data flows between data administrators, data consumers, and data developers within an organization.</p>\n<p>The goal of DataOps is to deliver value quicker by establishing predictable delivery as well as managing change to data, data models, and related artifacts.</p>\n<p>DataOps uses technology to automate the design, deployment, and management of data delivery through suitable levels of governance and uses metadata to improve the availability and value of data in a dynamic environment.</p>\n<p>DataOps helps us achieve rapid data innovation, deliver insights to the business customer at a faster rate, and provide data quality to support data personnel.</p>\n<p>In 2018, DataOps was included in the Technology Maturity Curve for Data Management, marking the official adoption and rollout of DataOps by the wider industry. Although DataOps can lower the barriers to data analytics, it does not make data analytics a simple task.</p>\n<h2>Focus of DataOps</h2>\n<ul>\n<li>Rapid innovation and experimentation to deliver better value to customers at an ever-increasing rate</li>\n<li>Delivering extremely high-quality data with very low error rates.</li>\n<li>Delivers interactive value through collaboration between complex arrays of people as well as technologies and environments.</li>\n<li>Clarity of measurement and monitoring and transparency of results.</li>\n</ul>\n<h2>DataOps Core Component</h2>\n<h3>Job Scheduler</h3>\n<p>Provides scheduling of workflows, and offline data development and enables data developers to focus on the implementation of business logic and improve development efficiency.</p>\n<h3>DevTools</h3>\n<p>Mainly provides development tools such as traditional scripting languages SQL, Python, etc. for quick and easy integration with the scheduling platform.</p>\n<h3>Migration and Deployment tools</h3>\n<p>Data migration and deployment management tools. Aimed towards industries where the development and testing environment is network isolated, it requires effective import and export functions for proper deployment to the production environment.</p>\n<h3>Management and monitoring tools</h3>\n<p>Administrator-friendly management, monitoring, and alert tools for offline tasks related to operations and maintenance.</p>\n<h1>Job Scheduler</h1>\n<p>Next, we will compare different job schedulers together with you.</p>\n<h2>Advantages and disadvantages of mainstream job scheduler</h2>\n<ul>\n<li>\n<p><strong>Oozie</strong>\nOozie is an open-source workflow engine-based framework that provides job scheduling and coordination for Hadoop MapReduce, and Pig Jobs. Oozie needs to be deployed to the Java Servlet container to function. It is mainly used for scheduling tasks at regular intervals and multiple tasks can be scheduled in sequential logical order of execution.</p>\n</li>\n<li>\n<p><strong>Airflow</strong>\nAirflow is an open-source project for Airbnb’s Workflow, Python-based task management, job scheduling, and monitoring workflow platform. Airflow is a DAG (directed acyclic graph) based job scheduling system, which can be interpreted as an advanced version of crontab, but it solves the task dependency problem that Crontab cannot handle. Compared to Crontab, Airflow makes it easy to monitor the status of tasks (if they were executed successfully or not, time of execution, execution dependencies, etc.), track the history of tasks, receive email notifications when tasks fail, and view error logs.</p>\n</li>\n<li>\n<p><strong>Apache Dolphinscheduler</strong>\nDolphinScheduler is a decentralized, scalable and easily visualized DAG workflow job scheduling platform. Dedicated to solving the complex dependencies in the data processing process and enabling scheduling systems to be used right out of the box in the data processing process.</p>\n</li>\n<li>\n<p><strong>Control-M</strong>\nControl-M is a commercial version of a cross-platform job scheduling management software with powerful features but a lesser degree of programmability.</p>\n</li>\n<li>\n<p><strong>Azkaban</strong>\nAzkaban is a bulk workflow job scheduler released by Linkedin to execute a set of jobs and processes within a workflow in a specific order. Azkaban uses job profiles to establish dependencies between jobs and provides an easy-to-use web user interface to maintain and track your workflows. Azkaban requires all nodes to be deployed on a peer-to-peer basis, but under certain circumstances does not require full node peering as long as it supports high availability.</p>\n</li>\n</ul>\n<h2>Scheduler Services</h2>\n<ul>\n<li><strong>Timer Service</strong></li>\n</ul>\n<p>Provides a scheduled service of Crontab expressions to execute workflows on a scheduled cycle.</p>\n<ul>\n<li>\n<p><strong>DAG Computation</strong>\nDAG computing often refers to the internal division of a computational job into several smaller jobs, which are logically related or sequentially constructed into a DAG (directed acyclic graph) structure.</p>\n</li>\n<li>\n<p><strong>Task Execution</strong>\nTask Execution is run by the scheduling system’s execution engine according to the type of task, parameters, environment, referenced data source, etc.</p>\n</li>\n<li>\n<p><strong>Environment Manage</strong>\nTargeting distributed scheduling engines, need to provide node management capabilities to facilitate task execution at different nodes. This enables tasks to run at a scale well beyond the limits of a single machine.</p>\n</li>\n<li>\n<p><strong>Alert Service</strong>\nNotify users and system administrators when tasks fail, time out, or are not completed within a specified time.</p>\n</li>\n<li>\n<p><strong>What’s more?</strong></p>\n</li>\n</ul>\n<p>In addition to the above, we hope that the scheduler can provide environment and data source management functions. After the workflow has been configured with an environment parameter, all tasks can then directly refer to it. Data sources can be made available for other tasks in an injection method, depending on the type of task.</p>\n<h2>Job Meta</h2>\n<p><img src=\"https://miro.medium.com/max/640/1*gjwDaN8MfRQiLZkrvW_RRw.png\" alt=\"\"></p>\n<ul>\n<li><strong>Task Execution Cycle</strong></li>\n</ul>\n<p>(minutes, hourly, daily, weekly &amp; monthly)</p>\n<ul>\n<li><strong>Dependency Meta</strong></li>\n</ul>\n<p>Upstream metadata information (files, tables, etc.) depending on the task.</p>\n<ul>\n<li><strong>Output Meta</strong></li>\n</ul>\n<p>Downstream metadata information (files, tables, etc.) depends on the task.</p>\n<ul>\n<li><strong>Dependency Meta Classification</strong></li>\n</ul>\n<p>Classify and differentiate the sources of dependent metadata.</p>\n<ul>\n<li><strong>Dependency Meta Source</strong></li>\n</ul>\n<p>Reverse processing of task-dependent metadata to obtain upstream and downstream tasks, providing a logical basis for automatic workflow scheduling and initiation.</p>\n<ul>\n<li><strong>Job Parallel Execution Info(parallel, serial)</strong></li>\n</ul>\n<p>Controls the parallel execution status of jobs (parallel, serial).</p>\n<ul>\n<li><strong>Job Type</strong></li>\n</ul>\n<p>Type of job (SQL, SHELL, PYTHON, PROCEDURE, etc.)</p>\n<h2>Job Development</h2>\n<p>Integration IDE(script language,shell,SQL,python etc)</p>\n<p>Integrated IDE development environment (Script language, Shell, SQL, Python tasks, etc.)</p>\n<p>configurable resource file(jar，spark, etc)</p>\n<p>Configurable resource files（jar, spark, tasks that cannot be edited using text, etc.）</p>\n<p>custom components</p>\n<p>Customizable components, such as off-line data platforms where data synchronization is a specific component, require only a simple configuration of data synchronization to implement the synchronization process.</p>\n<h1>Third-Party Job</h1>\n<p>Third-party job, where a specific application generates a custom script to accomplish the job goal.</p>\n<p>Third-Party Job Integration</p>\n<p>There are two methods of integration with third-party jobs, with the second method being the primary method used.</p>\n<p><strong>First method: pull</strong></p>\n<ul>\n<li>The job scheduler provides an interface that can be accessed by the third-party system.</li>\n<li>Development within the system and configuring the scheduler in the scheduler system. Configure the job in the third-party system, configure the scheduler in the scheduling system and execute the job.</li>\n<li>Single-point of failure and bottleneck for job execution.\n<strong>Disadvantages</strong>: Requires multiple developments in third-party systems and configuration of the scheduler in the scheduling system.</li>\n</ul>\n<p><strong>Second method: push</strong></p>\n<ul>\n<li>The scheduling system provides a programmable API.</li>\n<li>Third-party systems create jobs and push them to the scheduling system, where they are automatically configured and scheduled.</li>\n</ul>\n<h2>Job Execution And Notification</h2>\n<p><img src=\"https://miro.medium.com/max/1400/1*gjwDaN8MfRQiLZkrvW_RRw.png\" alt=\"\">\n<strong>Job execution</strong>: automatically triggered, based on conditions, upstream task dependencies</p>\n<p><strong>Job notifications</strong>: progress and status of job execution sent to third-party systems as a push message</p>\n<h2>Sample Configuration For Data Integration</h2>\n<p><img src=\"https://miro.medium.com/max/1400/1*hGJaLA6xnDdwwIe63Qst_Q.png\" alt=\"\">\n<strong>Sample configurations for third-party system integration are listed above.</strong></p>\n<p>The job scheduling system provides a programmable interface to enable the injection of environmental information. You only need to specify the different types of data sources in the third-party system, you do not need to configure the details of each data source e.g. (IP, port, username, password, etc.), this part is configured in the scheduling system and the data source and environment information are injected to the job. The job then parses the data source and environment from the parameters and accesses the corresponding data source and environment. This simplifies the management of data sources for ETL jobs.</p>\n<h2>Job Assignments</h2>\n<p>Traditional job scheduling was implemented by users dragging and connecting links, but we have improved the process by:</p>\n<ul>\n<li>Integrating job scheduling into the workflow.</li>\n<li>The configuration of upstream and downstream jobs is achieved through job-dependent metadata information.</li>\n<li>Some of the tables (some dimension tables) in ETL jobs are immutable and can be added to a whitelist. The workflow eliminates the need to look for business logic upstream of the corresponding table in the whitelist when making automatic changes and resolving dependencies.</li>\n<li>Views are an important factor affecting workflow automation. Views do not have ETL jobs, so we need to consider the view as a virtual job and import the view data into the scheduling platform so that the scheduling system is aware that the jobs that depend on the view are fundamentally dependent on the tasks corresponding to the underlying tables in the view.</li>\n</ul>\n<h2>Job Impact Analysis</h2>\n<p>Thanks to the existence of metadata information, analysis of the impact of jobs is very straightforward.</p>\n<ul>\n<li>The dependencies of the upstream and downstream metadata are used to resolve the upstream jobs which are job-dependent, avoiding the use of the manual configuration to reduce the probability of errors.</li>\n<li>The calculation of some of the latest impacts, e.g. job suspension, failure, and impact of downstream jobs.</li>\n</ul>\n<h2>Low Code Platform</h2>\n<ul>\n<li>For general situations, it is a good choice to build template jobs that can be reused to calculate processes for a large number of job configurations, requiring only a single configuration of the core process to set up the parameters.</li>\n<li>Support of specific systems, such as metrics management systems, tagging systems, data desensitization systems, etc.</li>\n<li>Coding friendly, able to perform coding when required.</li>\n<li>User friendly, under certain circumstances, the system coding is used rather than through user coding, the user can obtain the required data to assemble a specific data model without having to re-code it, e.g. the user can assemble a derivative tag based on the base tag by simple click configuration.</li>\n</ul>\n<h1>How to contribute:</h1>\n<ul>\n<li>\n<p>GitHub Code Repository: https://github.com/apache/dolphinscheduler</p>\n</li>\n<li>\n<p>Official Website:https://dolphinscheduler.apache.org/</p>\n</li>\n<li>\n<p>Mail List:dev@dolphinscheduler@apache.org</p>\n</li>\n<li>\n<p>Twitter:@DolphinSchedule</p>\n</li>\n</ul>\n",
  "time": "2022-10-29",
  "author": "Leonard Nie",
  "title": "How can more people benefit from big data?",
  "type": "tech",
  "label": "Tech Sharing"
}