{
  "__html": "<h1>PyDolphinScheduler releases version 4.0.2, fixing the problem that workflow cannot be submitted to DolphinScheduler 3.1.4</h1>\n<p>PyDolphinScheduler officially releases version 4.0.2, which mainly fixes the problem that version 4.0.1 cannot submit workflows to Apache DolphinScheduler 3.1.4.</p>\n<p>In addition, the major optimizations of PyDolphinScheduler 4.0.2 include:</p>\n<ul>\n<li>PyDolphinScheduler verifies the wrong version of Apache DolphinScheduler</li>\n<li>Python task type adds stmdency dependency</li>\n<li>The problem of missing dependencies of lower versions of Python</li>\n</ul>\n<h2>Optimization Details</h2>\n<h3>01 Fix the problem that the workflow cannot be submitted to DolphinScheduler 3.1.4</h3>\n<p>PyDolphinScheduler 4.0.1 cannot submit workflows to Apache DolphinScheduler 3.1.4, because Apache DolphinScheduler 3.1.4 is released later than PyDolphinScheduler 4.0.1, and there are some incompatible updates.</p>\n<p>PyDolphinScheduler 4.0.2 version fixes this problem.</p>\n<h3>02 The issue of verifying the version of DolphinScheduler incorrectly</h3>\n<p>This happens only in extreme situations, where the user does not use the official installation package of Apache DolphinScheduler, but modifies the code and packages it by himself, there may be a version problem reported by PyDolphinScheduler that is not supported.</p>\n<p>PyDolphinScheduler 4.0.2 is compatible with this scenario.</p>\n<h3>03 Add stmdency dependency to Python task type</h3>\n<p>Before version 4.0.2, only the Python function wrapper introduced stmdency dependency parsing. In 4.0.2 and later versions, we have also added stmdency dependency parsing for the Python task type itself to ensure that the functional dependencies can be obtained.</p>\n<h2>Modification list</h2>\n<h3>01 Bugfixes</h3>\n<ul>\n<li>Support for submitting workflows to Apache DolphinScheduler 3.1.4</li>\n<li>Detect Apache DolphinScheduler version issues #69</li>\n<li>CI anomaly detection due to dev version #70</li>\n<li>Python task type supports stmdency #72</li>\n<li>Add missing packaging dependencies #81</li>\n</ul>\n<h3>02 Optimization</h3>\n<ul>\n<li>Workflow start and end time support datetime type, schedule detection #68</li>\n<li>Migrate CI related configuration to setup.cfg #82</li>\n</ul>\n<h3>03 documents</h3>\n<p>Modify the release document</p>\n<h2>Release Notes</h2>\n<p><a href=\"https://github.com/apache/dolphinscheduler-sdk-Python/releases/tag/4.0.2\">https://github.com/apache/dolphinscheduler-sdk-Python/releases/tag/4.0.2</a></p>\n<h2>Thanks to contributors</h2>\n<p>zhongjiajie</p>\n",
  "time": "2023-3-27",
  "author": "Leonard Nie",
  "title": "# PyDolphinScheduler releases version 4.0.2, fixing the problem that workflow cannot be submitted to DolphinScheduler 3.1.4",
  "type": "release",
  "label": "Release Note"
}