{
  "filename": "workflow-definition.md",
  "__html": "<h1>Workflow Definition</h1>\n<h2>Create workflow definition</h2>\n<ul>\n<li>\n<p>Click Project Management -&gt; Workflow -&gt; Workflow Definition to enter the workflow definition page, and click the &quot;Create Workflow&quot; button to enter the <strong>workflow DAG edit</strong> page, as shown in the following figure:</p>\n<p align=\"center\">\n    <img src=\"/img/dag5.png\" width=\"80%\" />\n</p>\n</li>\n<li>\n<p>Drag in the toolbar <img src=\"/img/tasks/icons/shell.png\" width=\"15\"/> Add a Shell task to the drawing board, as shown in the figure below:</p>\n<p><img src=\"/img/tasks/demo/shell.jpg\" alt=\"demo-shell-simple\"></p>\n</li>\n<li>\n<p><strong>Add parameter settings for this shell task:</strong></p>\n</li>\n</ul>\n<ol>\n<li>Fill in the &quot;Node Name&quot;, &quot;Description&quot;, and &quot;Script&quot; fields;</li>\n<li>Check “Normal” for “Run Flag”. If “Prohibit Execution” is checked, the task will not be executed when the workflow runs;</li>\n<li>Select &quot;Task Priority&quot;: When the number of worker threads is insufficient, high-level tasks will be executed first in the execution queue, and tasks with the same priority will be executed in the order of first in, first out;</li>\n<li>Timeout alarm (optional): Check the timeout alarm, timeout failure, and fill in the &quot;timeout period&quot;. When the task execution time exceeds <strong>timeout period</strong>, an alert email will be sent and the task timeout fails;</li>\n<li>Resources (optional). Resource files are files created or uploaded on the Resource Center -&gt; File Management page. For example, the file name is <code>test.sh</code>, and the command to call the resource in the script is <code>sh test.sh</code>;</li>\n<li>Customize parameters (optional);</li>\n<li>Click the &quot;Confirm Add&quot; button to save the task settings.</li>\n</ol>\n<ul>\n<li>\n<p><strong>Increase the order of task execution:</strong> Click the icon in the upper right corner <img src=\"/img/line.png\" width=\"35\"/> to connect the task; as shown in the figure below, task 2 and task 3 are executed in parallel, When task 1 finished executing, tasks 2 and 3 will be executed simultaneously.</p>\n<p align=\"center\">\n   <img src=\"/img/dag6.png\" width=\"80%\" />\n</p>\n</li>\n<li>\n<p><strong>Delete dependencies:</strong> Click the &quot;arrow&quot; icon in the upper right corner <img src=\"/img/arrow.png\" width=\"35\"/>, select the connection line, and click the &quot;Delete&quot; icon in the upper right corner <img src= \"/img/delete.png\" width=\"35\"/>, delete dependencies between tasks.</p>\n<p align=\"center\">\n   <img src=\"/img/dag7.png\" width=\"80%\" />\n</p>\n</li>\n<li>\n<p><strong>Save workflow definition:</strong> Click the &quot;Save&quot; button, and the &quot;Set DAG chart name&quot; pop-up box will pop up, as shown in the figure below. Enter the workflow definition name, workflow definition description, and set global parameters (optional, refer to <a href=\"../parameter/global.md\">global parameters</a>), click the &quot;Add&quot; button, and the workflow definition is created successfully.</p>\n<p align=\"center\">\n   <img src=\"/img/dag8.png\" width=\"80%\" />\n </p>\n</li>\n</ul>\n<blockquote>\n<p>For other types of tasks, please refer to <a href=\"#TaskParamers\">Task Node Type and Parameter Settings</a>. <!-- markdown-link-check-disable-line --></p>\n</blockquote>\n<h2>Workflow Definition Operation Function</h2>\n<p>Click Project Management -&gt; Workflow -&gt; Workflow Definition to enter the workflow definition page, as shown below:</p>\n<p align=\"center\">\n<img src=\"/img/work_list_en.png\" width=\"80%\" />\n</p>\nThe operation functions of the workflow definition list are as follows:\n<ul>\n<li><strong>Edit:</strong> Only &quot;offline&quot; workflow definitions can be edited. Workflow DAG editing is the same as <a href=\"#create-workflow-definition\">Create Workflow Definition</a>.</li>\n<li><strong>Online:</strong> When the workflow status is &quot;Offline&quot;, used to online workflow. Only the workflow in the &quot;Online&quot; state can run, but cannot be edited.</li>\n<li><strong>Offline:</strong> When the workflow status is &quot;Online&quot;, used to offline workflow. Only the workflow in the &quot;Offline&quot; state can be edited, but not run.</li>\n<li><strong>Run:</strong> Only workflow in the online state can run. See <a href=\"#run-the-workflow\">2.3.3 Run Workflow</a> for the operation steps.</li>\n<li><strong>Timing:</strong> Timing can only be set in online workflows, and the system automatically schedules the workflow to run on a regular basis. The status after creating a timing is &quot;offline&quot;, and the timing must be online on the timing management page to take effect. See <a href=\"#workflow-timing\">2.3.4 Workflow Timing</a> for timing operation steps.</li>\n<li><strong>Timing Management:</strong> The timing management page can be edited, online/offline, and deleted.</li>\n<li><strong>Delete:</strong> Delete the workflow definition.</li>\n<li><strong>Download:</strong> Download workflow definition to local.</li>\n<li><strong>Tree Diagram:</strong> Display the task node type and task status in a tree structure, as shown in the figure below:<p align=\"center\">\n    <img src=\"/img/tree_en.png\" width=\"80%\" />\n</p>\n</li>\n</ul>\n<h2>Run the Workflow</h2>\n<ul>\n<li>\n<p>Click Project Management -&gt; Workflow -&gt; Workflow Definition to enter the workflow definition page, as shown in the figure below, click the &quot;Go Online&quot; button <img src=\"/img/online.png\" width=\"35\"/>，Go online workflow.</p>\n<p align=\"center\">\n    <img src=\"/img/work_list_en.png\" width=\"80%\" />\n</p>\n</li>\n<li>\n<p>Click the &quot;Run&quot; button to pop up the startup parameter setting pop-up box, as shown in the figure below, set the startup parameters, click the &quot;Run&quot; button in the pop-up box, the workflow starts running, and the workflow instance page generates a workflow instance.</p>\n   <p align=\"center\">\n     <img src=\"/img/run_work_en.png\" width=\"80%\" />\n   </p>  \nDescription of workflow operating parameters: \n<pre><code>* Failure strategy: When a task node fails to execute, other parallel task nodes need to execute the strategy. &quot;Continue&quot; means: after a certain task fails, other task nodes execute normally; &quot;End&quot; means: terminate all tasks being executed, and terminate the entire process.\n* Notification strategy: When the process is over, the process execution information notification email is sent according to the process status, including any status is not sent, successful sent, failed sent, successful or failed sent.\n* Process priority: The priority of process operation, divided into five levels: highest (HIGHEST), high (HIGH), medium (MEDIUM), low (LOW), and lowest (LOWEST). When the number of master threads is insufficient, high-level processes will be executed first in the execution queue, and processes with the same priority will be executed in a first-in first-out order.\n* Worker group: The process can only be executed in the specified worker machine group. The default is Default, which can be executed on any worker.\n* Notification group: select notification strategy||timeout alarm||when fault tolerance occurs, process information or email will be sent to all members in the notification group.\n* Recipient: Select notification policy||Timeout alarm||When fault tolerance occurs, process information or alarm email will be sent to the recipient list.\n* Cc: Select the notification strategy||Timeout alarm||When fault tolerance occurs, the process information or warning email will be copied to the CC list.\n* Startup parameter: Set or overwrite global parameter values when starting a new process instance.\n* Complement: Two modes including serial complement and parallel complement. Serial complement: Within the specified time range, the complements are executed from the start date to the end date and N process instances are generated in turn; parallel complement: within the specified time range, multiple days are complemented at the same time to generate N process instances.\n</code></pre>\n<ul>\n<li>For example, you need to fill in the data from May 1 to May 10.</li>\n</ul>\n  <p align=\"center\">\n      <img src=\"/img/complement_en1.png\" width=\"80%\" />\n  </p>\n<blockquote>\n<p>Serial mode: The complement is executed sequentially from May 1 to May 10, and ten process instances are generated on the process instance page;</p>\n</blockquote>\n<blockquote>\n<p>Parallel mode: The tasks from May 1 to may 10 are executed simultaneously, and 10 process instances are generated on the process instance page.</p>\n</blockquote>\n</li>\n</ul>\n<h2>Workflow Timing</h2>\n<ul>\n<li>Create timing: Click Project Management-&gt;Workflow-&gt;Workflow Definition, enter the workflow definition page, go online the workflow, click the &quot;timing&quot; button <img src=\"/img/timing.png\" width=\"35\"/> ,The timing parameter setting dialog box pops up, as shown in the figure below:<p align=\"center\">\n    <img src=\"/img/time_schedule_en.png\" width=\"80%\" />\n</p>\n</li>\n<li>Choose the start and end time. In the start and end time range, the workflow is run at regular intervals; not in the start and end time range, no more regular workflow instances are generated.</li>\n<li>Add a timing that is executed once every day at 5 AM, as shown in the following figure:<p align=\"center\">\n    <img src=\"/img/timer-en.png\" width=\"80%\" />\n</p>\n</li>\n<li>Failure strategy, notification strategy, process priority, worker group, notification group, recipient, and CC are the same as workflow running parameters.</li>\n<li>Click the &quot;Create&quot; button to create the timing successfully. At this time, the timing status is &quot;<strong>Offline</strong>&quot; and the timing needs to be <strong>Online</strong> to take effect.</li>\n<li>Timing online: Click the &quot;timing management&quot; button <img src=\"/img/timeManagement.png\" width=\"35\"/>, enter the timing management page, click the &quot;online&quot; button, the timing status will change to &quot;online&quot;, as shown in the below figure, the workflow takes effect regularly.<p align=\"center\">\n    <img src=\"/img/time-manage-list-en.png\" width=\"80%\" />\n</p>\n</li>\n</ul>\n<h2>Import Workflow</h2>\n<p>Click Project Management -&gt; Workflow -&gt; Workflow Definition to enter the workflow definition page, click the &quot;Import Workflow&quot; button to import the local workflow file, the workflow definition list displays the imported workflow, and the status is offline.</p>\n",
  "link": "/dist/en-us/docs/2.0.3/user_doc/guide/project/workflow-definition.html",
  "meta": {}
}