{
  "filename": "switch.md",
  "__html": "<h1>Switch</h1>\n<p>Switch is a conditional judgment node, which branch should be executes according to the value of <a href=\"../parameter/global.md\">global variable</a> and the expression result written by the user.</p>\n<h2>Create</h2>\n<p>Drag the <img src=\"/img/switch.png\" width=\"20\"/> in the tool bar to create task. <strong>Note</strong> After the switch task is created, you must configure it downstream to make parameter <code>Branch flow</code> work.</p>\n<h2>Parameter</h2>\n<ul>\n<li>Node name: The node name in a workflow definition is unique.</li>\n<li>Run flag: Identifies whether this node can be scheduled normally, if it does not need to be executed, you can turn on the prohibition switch.</li>\n<li>Descriptive information: describe the function of the node.</li>\n<li>Task priority: When the number of worker threads is insufficient, they are executed in order from high to low, and when the priority is the same, they are executed according to the first-in first-out principle.</li>\n<li>Worker grouping: Tasks are assigned to the machines of the worker group to execute. If Default is selected, a worker machine will be randomly selected for execution.</li>\n<li>Number of failed retry attempts: The number of times the task failed to be resubmitted. It supports drop-down and hand-filling.</li>\n<li>Failed retry interval: The time interval for resubmitting the task after a failed task. It supports drop-down and hand-filling.</li>\n<li>Timeout alarm: Check the timeout alarm and timeout failure. When the task exceeds the &quot;timeout period&quot;, an alarm email will be sent and the task execution will fail.</li>\n<li>condition: You can configure multiple conditions for the switch task. When the conditions are true, the configured branch will be executed. You can configure multiple different conditions to satisfy different businesses.</li>\n<li>Branch flow: The default branch flow, when all the conditions are false, it will execute this branch flow.</li>\n</ul>\n<h2>Detail</h2>\n<p>Here we have three tasks, the dependencies are <code>A -&gt; B -&gt; [C, D]</code>, and task_a is a shell task and task_b is a switch task</p>\n<ul>\n<li>In task A, a global variable named <code>id</code> is defined through <a href=\"../parameter/global.md\">global variable</a>, and the declaration method is <code>${setValue(id=1)}</code></li>\n<li>Task B adds conditions and uses global variables declared upstream to achieve conditional judgment (note that global variables must exist when the switch is running, which means that switch task can use global variables that are not directly upstream). We want workflow execute task C when id = 1 else run task D\n<ul>\n<li>Configure task C to run when the global variable <code>id=1</code>. Then edit <code>${id} == 1</code> in the condition of task B, select <code>C</code> as branch flow</li>\n<li>For other tasks, select <code>D</code> as branch flow</li>\n</ul>\n</li>\n</ul>\n<p>Switch task configuration is as follows</p>\n<p><img src=\"../../../../../../img/switch_configure.jpg\" alt=\"task-switch-configure\"></p>\n<h2>Related Task</h2>\n<p><a href=\"conditions.md\">condition</a>：<a href=\"conditions.md\">Condition</a>task mainly executes the corresponding branch based on the execution status (success, failure) of the upstream node. The <a href=\"switch.md\">Switch</a> task mainly executes the corresponding branch based on the value of the <a href=\"../parameter/global.md\">global parameter</a> and the judgment expression result written by the user.</p>\n",
  "link": "/dist/en-us/docs/2.0.1/user_doc/guide/task/switch.html",
  "meta": {}
}