{
  "filename": "Apache_dolphinScheduler_2.0.3.md",
  "__html": "<h1>Apache DolphinScheduler 2.0.3 Release Announcement: DingTalk alert plugin adds signature verification, and supports data sources to obtain links from multiple sessions</h1>\n<div align=center>\n<img src=\"/img/2.0.3/2022-1-2701/1.png\"/>\n</div>\n<blockquote>\n<p>Today, Apache DolphinScheduler announced the official release of version 2.0.3. In this version, DingTalk alert plugin adds signature verification and enables data sources to get links from multiple sessions. In addition, 2.0.3 also optimizes cache management, complement time, data source password display in logs, etc., and fixes several Bug.</p>\n</blockquote>\n<h2>Function Enhancement</h2>\n<h3>DingTalk alert plugin adds signature verification</h3>\n<p>2.0.3 Supports DingTalk robot alarm function through signature verification.</p>\n<div align=center>\n<img src=\"/img/2.0.3/2022-1-2701/2.png\"/>\n</div>\n<p><strong>DingTalk parameter configuration</strong></p>\n<ul>\n<li>Webhooks</li>\n</ul>\n<p>The format is as follows: <a href=\"https://oapi.dingtalk.com/robot/send?access_token=XXXXXX\">https://oapi.dingtalk.com/robot/send?access_token=XXXXXX</a></p>\n<ul>\n<li>Keyword</li>\n</ul>\n<p>Custom keywords for security settings</p>\n<ul>\n<li>Secret</li>\n</ul>\n<p>Signature of security settings</p>\n<p>When a custom bot sends a message, you can specify the &quot;@person list&quot; by your mobile phone number. When a person in the &quot;@people list&quot; receives the message, there will be an @message reminder. Even set to Do Not Disturb mode, there will still be notification reminders for conversations, and the prompt &quot;Someone @ you&quot; will appear on the first screen.</p>\n<ul>\n<li>@Mobiles</li>\n</ul>\n<p>The phone number of the person being @</p>\n<ul>\n<li>@UserIds</li>\n</ul>\n<p>User userid of @person</p>\n<ul>\n<li>@All</li>\n</ul>\n<p>@everyone</p>\n<p>For details, please refer to: <a href=\"https://open.dingtalk.com/document/robots/customize-robot-security-settings\">https://open.dingtalk.com/document/robots/customize-robot-security-settings</a></p>\n<h3>Supports data source to get connection from multi sessions</h3>\n<p>Previously, we use the JdbcDataSourceProvider.createOneSessionJdbcDataSource() method to create a connection pool in hive/impala set MaximumPoolSize=1, while in scheduling tasks, if hive/impala multitasking runs at the same time, getConnection=null will occur, and the SqlTask.prepareStatementAndBind() method will throw a null pointer exception.</p>\n<p>2.0.3 is optimized to support data sources getting links from multiple sessions.</p>\n<h2>Improvements</h2>\n<h3>Introduces cache manager, reduce DB query in Master scheduling</h3>\n<p>Since numerous database read operations, such as tenant, user, processDefinition, etc., will occur during the scheduling process of the master server, it will bring enormous pressure on the DB on the one hand, and will slow down the entire core scheduling process on the other hand.</p>\n<p>Considering that this part of business data involves more reading than writing, 2.0.3 introduces a cache module, which mainly acts on the Master node to cache business data such as tenants and workflow definitions, thus reduces database query pressure, and speeds up the core scheduling process. Please check the official website documentation for details: <a href=\"https://dolphinscheduler.apache.org/en-us/docs/latest/user_doc/architecture/cache.html\">https://dolphinscheduler.apache.org/en-us/docs/latest/user_doc/architecture/cache.html</a></p>\n<h3>Optimize complement task's date, the complement time interval from '[left, right)' to '[left, right]'</h3>\n<p>Previously, the complement time was &quot;left closed and right open&quot; (startDate &lt;= N &lt; endDate), which is actually not conducive to user understanding. After optimization, the deployment time interval is changed to &quot;closed left and closed right&quot;.</p>\n<p>Complement case: <a href=\"https://dolphinscheduler.apache.org/en-us/docs/latest/user_doc/guide/project/workflow-definition.html\">https://dolphinscheduler.apache.org/en-us/docs/latest/user_doc/guide/project/workflow-definition.html</a></p>\n<h3>Encrypted data source password in the logs</h3>\n<p>The password in the data source is encrypted to enhance privacy protection.</p>\n<h2>Bug Fixes</h2>\n<ul>\n<li>zkRoot in conf/config/install_ config does not take effect</li>\n<li>Problems caused by modifying the administrator user information.</li>\n<li>Add delete workflow instance when delete process definition</li>\n<li>udf sub resource manage edit modal cant close</li>\n<li>process is always running: netty writeAndFlush without retry when failed, leads to worker response to master failed</li>\n<li>After deleting the running workflow, the master keeps brushing the error log</li>\n<li>Edit the bug of worker grouping in environment management.</li>\n<li>Dependent node ui dislocation</li>\n<li>Error in querying historical version information of workflow</li>\n<li>Solve the problem that task log output affects performance under high concurrency</li>\n<li>The global parameters of the sub_process node are not passed to the associated workflow task</li>\n<li>Query log can not show contents when task log in master on k8s</li>\n<li>Duplicate processes in the process definition list</li>\n<li>Process instance is always running: task is failure when process instance FailureStrategy.END</li>\n<li>Field ‘is_directory’ in t_ds_resources table has error type in PostgreSQL database</li>\n<li>Repair JDBC connection of Oracle</li>\n<li>When there is a forbidden node in dag, the execution flow is abnormal</li>\n<li>QuerySimpleList return wrong projectCode</li>\n</ul>\n<p><strong>Release Note:</strong> <a href=\"https://github.com/apache/dolphinscheduler/releases/tag/2.0.3\">https://github.com/apache/dolphinscheduler/releases/tag/2.0.3</a></p>\n<p><strong>Download:</strong> <a href=\"https://dolphinscheduler.apache.org/en-us/download/download.html\">https://dolphinscheduler.apache.org/en-us/download/download.html</a></p>\n<h2>Thanks to contributors</h2>\n<p>Thanks to the community contributors for their active contributions to this release! This is the list of Contributors, in no particular order:</p>\n<div align=center>\n<img src=\"/img/2.0.3/2022-1-2701/3.png\"/>\n</div>\n",
  "link": "/dist/en-us/blog/Apache_dolphinScheduler_2.0.3.html",
  "meta": {
    "title": "Apache DolphinScheduler 2.0.3 Release Announcement: DingTalk alert plugin adds signature verification, and supports data sources to obtain links from multiple sessions",
    "keywords": "Apache,DolphinScheduler,scheduler,big data,ETL,airflow,hadoop,orchestration,dataops,2.0.3",
    "description": "Today, Apache DolphinScheduler announced the official release of version 2.0.3. In this version,"
  }
}