{
  "filename": "Apache_dolphinScheduler_2.0.5.md",
  "__html": "<div align=center>\n<img src=\"/img/2022-3-7/1.png\"/>\n</div>\n<p>Today, Apache DolphinScheduler announced the official release of version 2.0.5. This version has carried out some functional optimizations, such as optimizing the fault tolerance process of Worker, adding the function of re-uploading files in the resource center, and making several bug fixes.</p>\n<h2>Optimization</h2>\n<h3>Worker fault tolerance process</h3>\n<p>Version 2.0.5 optimizes the worker's fault tolerance process so that when the server is interrupted due to excessive pressure, it can normally transfer tasks to other workers to continue execution to avoid task interruption.</p>\n<h3>Forbid to run task page sign optimization</h3>\n<p>Optimized the display of flags on pages where tasks are prohibited from running, which distinguishes from the display of tasks that are normally executed, to prevent users from confusing work status.</p>\n<div align=center>\n<img src=\"/img/2022-3-7/2.png\"/>\n</div>\n<h3>Added prompts to the task box</h3>\n<p>In version 2.0.5, a prompt is added to the task box to display all the long task names, which is convenient for users.</p>\n<div align=center>\n<img src=\"/img/2022-3-7/3.png\"/>\n</div>\n<h3>Added the re-uploading files function in the resource center</h3>\n<p>The function of re-uploading files has been added to the resource center. When the user needs to modify the execution, automatical updating of the execution script can be realized without the requirement to reconfigure the task parameters.</p>\n<h3>Jump to the list page directly when modifying the workflow</h3>\n<p>Changed the status that the page remained on the DAG page after modifying the workflow. After optimization, it can jump to the list page, which is convenient for users to follow-up operations.</p>\n<h3>Markdown information type added to DingTalk alert plugin</h3>\n<p>Adds the Markdown information type to the alarm content of the DingTalk alarm plugin to enrich the information type support.</p>\n<h2>Bug Fix</h2>\n<p>[<a href=\"https://github.com/apache/dolphinscheduler/issues/8213\">#8213</a>] The task run incorrectly when the worker group contains uppercase letters.</p>\n<p>[<a href=\"https://github.com/apache/dolphinscheduler/pull/8347\">#8347</a>] Fixed the problem of workflow cannot be stopped when the task fails and retries</p>\n<p>[<a href=\"https://github.com/apache/dolphinscheduler/issues/8135\">#8135</a>] JDBC connection parameter cannot input '@'</p>\n<p>[<a href=\"https://github.com/apache/dolphinscheduler/issues/8367\">#8367</a>] Fixed complement may not end normally</p>\n<p>[<a href=\"https://github.com/apache/dolphinscheduler/issues/8170\">#8170</a>] Fix the problem of failing to enter the sub-workflow from the page</p>\n<p>2.0.5 Download address:</p>\n<p><a href=\"https://dolphinscheduler.apache.org/en-us/download/download.html\">https://dolphinscheduler.apache.org/en-us/download/download.html</a></p>\n<p>Release Note: <a href=\"https://github.com/apache/dolphinscheduler/releases/tag/2.0.5\">https://github.com/apache/dolphinscheduler/releases/tag/2.0.5</a></p>\n<h2>Thanks to Contributors</h2>\n<p>Thanks to the contributors of Apache DolphinScheduler 2.0.5 version, the list of contributor GitHub IDs is as follows (in no particular order):</p>\n<div align=center>\n<img src=\"/img/2022-3-7/4.png\"/>\n</div>\n",
  "link": "/dist/en-us/blog/Apache_dolphinScheduler_2.0.5.html",
  "meta": {
    "title": "Release News! Apache DolphinScheduler 2_0_5 optimizes The Fault Tolerance Process of Worker",
    "keywords": "Apache,DolphinScheduler,scheduler,big data,ETL,airflow,hadoop,orchestration,dataops,Meetup",
    "description": "Today, Apache DolphinScheduler announced the official release of version 2.0.5."
  }
}