{
  "filename": "Awarded_most_popular_project_in_2021.md",
  "__html": "<h1>Apache DolphinScheduler Won the「2021 OSC Most Popular Projects」award, and Whaleops Open Source Technology Received the honor of「Outstanding Chinese Open Source Original Startups」!</h1>\n<div align=center>\n<img src=\"https://s1.imgpp.com/2022/01/07/_1ca0eca926145ffc5f05f15b6b612a2b_64635.jpg\"/>\n</div>\n<p>Recently, the &quot;2021 OSC Best China Open Source Projects Poll」initiated by OSCHINA announced the selection results.</p>\n<p>With the love and support of the users and the open-source community, the cloud-native distributed big data scheduler Apache DolphinScheduler was awarded the 「OSCHINA Popularity Index Top 50 Open Source Projects」and 「Most Popular Projects」in 2021. And Its commercial operating company Whaleops Open Source Technology also was awarded the &quot;Outstanding Chinese Open Source Native Startup&quot; for its outstanding open-source operation performance.</p>\n<h2>Won the Honor of「Most Popular Projects」</h2>\n<p>This year, the 「2021 OSC Best China Open Source Projects Poll&quot; set up two rounds of voting. The first round of voting selected the 「OSCHINA Popularity Index TOP 50 Open Source Projects」based on the number of votes. The second round of voting was conducted based on the TOP 50 projects in the first round, and 30 &quot;Most Popular Projects&quot; were selected.</p>\n<p>In the first round of voting, OSCHINA selected TOP 5 of 7 major categories of  projects (basic Software, Cloud-Native, Front-end, DevOps, Development Frameworks and Tools, AI &amp; Big Data, IoT &amp; 5G) based on the number of votes. Apache DolphinScheduler stood out in the &quot;cloud-native&quot; category and was on the list for its excellent cloud-native capabilities.</p>\n<p>After the fierce competition in the second round of voting, Apache DolphinScheduler won again and was rewarded the &quot;Most Popular Project&quot;.</p>\n<h2>Whaleops Open Source Technology Won the 「Outstanding Chinese Open Source Native Startups」 Award</h2>\n<p>&quot;OSC China Open Source Project Poll&quot; organized by Open Source China (OSCHINA, OSC Open Source Community) is the most authoritative and grandest open source project campaign in China. It aims to showcase the status quo of domestic open-source, explore domestic open source trends, and inspire domestic open-source talents, sequentially to promote the improvement of the domestic open source ecosystem.</p>\n<p>China's open-source software ecosystem is booming. In recent years, numerous outstanding open source software startups have emerged. They have beared original aspirations in mind to contribute to China's open-source software development, deeply cultivated in open-source to gave back to the community, and became an important force that cannot be ignored in the global open-source software ecosystem.</p>\n<p>To appreciate these open source startups for their outstanding contributions to the open-source community, and to let more developers know and understand these high-quality open-source startup teams that have set a good example for Chinese open-source entrepreneurs, OSCHINA specially set up the &quot;Excellent Chinese Open Source Native Startups&quot; award in this year’s poll.</p>\n<p>&quot;Open Source Native Startups&quot; refer to companies established based on open source projects and operate around the following business models:</p>\n<p>The team provides commercial services around self-built open source projects, or\nThe team provides commercial services based on upstream open source projects</p>\n<p>OSCHINA has evaluated open-source native commercial companies in their entrepreneurial stage from the perspective of the company's related open source project communities status, the technical field development prospects of the company's related open source projects, and the company's development status. After professional evaluation, Whaleops Open Source Technology was rewaded the 「Excellent Chinese Open Source Native Startups」award.</p>\n<h2>About Apache DolphinScheduler</h2>\n<p>Apache DolphinScheduler is a top-level project incubated by the Apache Software Foundation. As a new generation of distributed big data workflow task scheduler, it is committed to &quot;solving the intricate dependencies between big data tasks and making the entire data process intuitive and visible&quot;. DolphinScheduler assembles Tasks in the form of DAG (Directed Acyclic Graph), which can monitor the running status of tasks in real-time. At the same time, it supports operations such as retry, recovery from designated nodes, suspend and Kill tasks, and focuses on continuously improving the 6 capabilities of DAG visualization,  rich task types, history, task log/alarm mechanism, and complement.</p>\n<p>So far, the Apache DolphinScheduler community consists of 280+ experienced code contributors and 110+ non-code contributors, including PMC or Committer from other top Apache projects. Since its creation, the Apache DolphinScheduler open source community has continued to grow, and the WeChat user base has reached 6000+ people. As of January 2022, 600+ companies and institutions have adopted Apache DolphinScheduler in their production environments.</p>\n<p>Finally, we would like to thank OSCHINA for recognizing Apache DolphinScheduler and its commercial operating company Whaleops Open Source Technology, especially to every participant that is inseparable in the community build-up.</p>\n<p>In the future, we believe the community will scale new heights with this valuable honor, as well as the joint force of every contributor!</p>\n<h2>The Way to Join US</h2>\n<p>There are many ways to participate and contribute to the DolphinScheduler community, including:\nDocuments, translation, Q&amp;A, tests, codes, articles, keynote speeches, etc.</p>\n<p>We assume the first PR (document, code) to contribute to be simple and should be used to familiarize yourself with the submission process and community collaboration style.</p>\n<ul>\n<li>\n<p>So the community has compiled the following list of issues suitable for novices: <a href=\"https://github.com/apache/dolphinscheduler/issues/5689\">https://github.com/apache/dolphinscheduler/issues/5689</a></p>\n</li>\n<li>\n<p>List of non-newbie issues: <a href=\"https://github.com/apache/dolphinscheduler/issues?q=is%3Aopen+is%3Aissue+label%3A%22volunteer+wanted%22\">https://github.com/apache/dolphinscheduler/issues?q=is%3Aopen+is%3Aissue+label%3A&quot;volunteer+wanted&quot;</a></p>\n</li>\n<li>\n<p>How to participate in the contribution: <a href=\"https://dolphinscheduler.apache.org/en-us/community/development/contribute.html\">https://dolphinscheduler.apache.org/en-us/community/development/contribute.html</a></p>\n</li>\n<li>\n<p>Community Official Website\n<a href=\"https://dolphinscheduler.apache.org/\">https://dolphinscheduler.apache.org/</a></p>\n</li>\n<li>\n<p>GitHub Code repository: <a href=\"https://github.com/apache/dolphinscheduler\">https://github.com/apache/dolphinscheduler</a></p>\n</li>\n</ul>\n<p>Your Star for the project is important, don’t hesitate to lighten a Star for <a href=\"https://github.com/apache/dolphinscheduler\">Apache DolphinScheduler</a> ❤️</p>\n",
  "link": "/dist/en-us/blog/Awarded_most_popular_project_in_2021.html",
  "meta": {
    "title": "Apache DolphinScheduler Won the「2021 OSC Most Popular Projects」award, and Whaleops Open Source Technology Received the honor of「Outstanding Chinese Open Source Original Startups」!",
    "keywords": "Apache,DolphinScheduler,scheduler,big data,ETL,airflow,hadoop,orchestration,dataops,2021",
    "description": "Recently, the \"2021 OSC Best China Open Source Projects Poll」initiated by OSCHINA announced the selection results."
  }
}