{
  "filename": "DAG.md",
  "__html": "<h2>Big Data Workflow Task Scheduling - Directed Acyclic Graph (DAG) for Topological Sorting</h2>\n<h3>Reviewing the basics：</h3>\n<h4>Graph traversal：</h4>\n<p>A graph traversal is a visit to all the vertices in a graph once and only once, starting from a vertex in the graph and following some search method along the edges of the graph.</p>\n<p>Note : the tree is a special kind of graph, so tree traversal can actually be seen as a special kind of graph traversal.</p>\n<h4>There are two main algorithms for graph traversal</h4>\n<h5>Breadth First Search (BFS)</h5>\n<p>The basic idea: first visit the starting vertex v, then from v, visit each of v's unvisited adjacent vertices w1, w2 , ... ,wi, then visit all the unvisited adjacent vertices of w1, w2, ... , wi in turn; from these visited vertices, visit all their unvisited adjacent vertices until all vertices in the graph have been visited. and from these visited vertices, visit all their unvisited adjacent vertices, until all vertices in the graph have been visited. If there are still vertices in the graph that have not been visited, choose another vertex in the graph that has not been visited as the starting point and repeat the above process until all vertices in the graph have been visited.</p>\n<h5>Depth First Search (DFS)</h5>\n<p>The basic idea: first visit a starting vertex v in the graph, then from v, visit any vertex w~1~ that is adjacent to v and has not been visited, then visit any vertex w~2~ that is adjacent to w~1~ and has not been visited ...... Repeat the above process. When it is no longer possible to go down the graph, go back to the most recently visited vertex, and if it has adjacent vertices that have not been visited, continue the search process from that point until all vertices in the graph have been visited.</p>\n<h4>Example</h4>\n<p>In the diagram below, if the breadth first search (BFS) is used, the traversal is as follows: <code>1 2 5 3 4 6 7</code>. If the depth first search (DFS) is used, the traversal is as follows <code>1 2 3 4 5 6 7</code>.</p>\n<p><img src=\"https://github.com/apache/dolphinscheduler-website/blob/master/img/DAG/DAG01.png?raw=true\" alt=\"DAG01\"></p>\n<h3>Topological Sorting</h3>\n<p>The definition of topological ordering on Wikipedia is :</p>\n<p>For any Directed Acyclic Graph (DAG), the topological sorting is a linear sorting of all its nodes (there may be multiple such node sorts in the same directed graph). This sorting satisfies the condition that for any two nodes U and V in the graph, if there is a directed edge pointing from U to V, then U must appear ahead of V in the topological sorting.</p>\n<p><strong>In layman's terms: Topological sorting is a linear sequence of all vertices of a directed acyclic graph (DAG), which must satisfy two conditions :</strong></p>\n<ul>\n<li>Each vertex appears and only appears once.</li>\n<li>If there is a path from vertex A to vertex B, then vertex A appears before vertex B in the sequence.</li>\n</ul>\n<p><strong>How to find out its topological sort? Here is a more commonly used method :</strong></p>\n<p>Before introducing this method, it is necessary to add the concepts of indegree and outdegree of a directed graph node.</p>\n<p>Assuming that there is no directed edge whose starting point and ending point are the same node in a directed graph, then:</p>\n<p>In-degree: Assume that there is a node V in the graph, and the in-degree is the number of edges that start from other nodes and end at V. That is, the number of all directed edges pointing to V.</p>\n<p>Out-degree: Assuming that there is a node V in the directed graph, the out-degree is the number of edges that currently have a starting point of V and point to other nodes. That is, the number of edges issued by V.</p>\n<ol>\n<li>Select a vertex with an in-degree of 0 from the DAG graph and output it.</li>\n<li>Delete the vertex and all directed edges starting with it from the graph.</li>\n<li>Repeat 1 and 2 until the current DAG graph is empty or there are no vertices of degree 0 in the current graph. The latter case indicates that a ring must exist in the directed graph.</li>\n</ol>\n<p><strong>For example, the following DAG graph :</strong></p>\n<p><img src=\"https://github.com/apache/dolphinscheduler-website/blob/master/img/DAG/DAG02.png?raw=true\" alt=\"DAG02\"></p>\n<table>\n<thead>\n<tr>\n<th>Node</th>\n<th>in degree</th>\n<th>out degree</th>\n<th>count of in degree</th>\n<th>count of out degree</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Node 1</td>\n<td>0</td>\n<td>Node 2,Node 4</td>\n<td>0</td>\n<td>2</td>\n</tr>\n<tr>\n<td>Node 2</td>\n<td>Node 1</td>\n<td>Node 3,Node 4</td>\n<td>1</td>\n<td>2</td>\n</tr>\n<tr>\n<td>Node 3</td>\n<td>Node 2,Node 4</td>\n<td>Node 5</td>\n<td>2</td>\n<td>1</td>\n</tr>\n<tr>\n<td>Node 4</td>\n<td>Node 1,Node 2</td>\n<td>Node 3,Node 5</td>\n<td>2</td>\n<td>2</td>\n</tr>\n<tr>\n<td>Node 5</td>\n<td>Node 3,Node 4</td>\n<td>0</td>\n<td>2</td>\n<td>0</td>\n</tr>\n</tbody>\n</table>\n<p><strong>Its topological sorting process is:</strong></p>\n<p><img src=\"https://github.com/apache/dolphinscheduler-website/blob/master/img/DAG/DAG03.png?raw=true\" alt=\"DAG03\"></p>\n<p>Therefore, the result of topological sorting is: {1,2,4,3,5}.</p>\n<p>If there is no node 2 —&gt; the arrow of node 4, then it is as follows:</p>\n<p><img src=\"https://github.com/apache/dolphinscheduler-website/blob/master/img/DAG/DAG04.png?raw=true\" alt=\"DAG04\"></p>\n<p>We can get its topological sort as: {1,2,4,3,5} or {1,4,2,3,5}, that is, for the same DAG graph, there may be multiple topological sort results .</p>\n<p>Topological sorting is mainly used to solve the dependency problem in directed graphs.</p>\n<p>**When talking about the implementation, it is necessary to insert the following : **</p>\n<p>From this we can further derive an improved depth first search or breadth first search algorithm to accomplish topological sorting. Taking the breadth first search as an example, the only difference between this improved algorithm and the ordinary breadth first search is that we should save the degree of entry corresponding to each node and select the node with a degree of entry of 0 at each level of the traversal to start the traversal (whereas the ordinary breadth first search has no such restriction and can start from any node in the tale). The algorithm is described as follows :</p>\n<ol>\n<li>Initialize a Map or similar data structure to save the in-degree of each node.</li>\n<li>For the child nodes of each node in the graph, add 1 to the in-degree of its child nodes.</li>\n<li>Select any node with an in-degree of 0 to start traversal, and add this node to the output.</li>\n<li>For each node traversed, update the in-degree of its child node: subtract 1 from the in-degree of the child node.</li>\n<li>Repeat step 3 until all nodes have been traversed.</li>\n<li>If it is impossible to traverse all the nodes, it means that the current graph is not a directed acyclic graph. There is no topological sort.</li>\n</ol>\n<p><strong>The core Java code for breadth first search topological sorting is as follows :</strong></p>\n<pre><code class=\"language-java\"><span class=\"hljs-keyword\">public</span> <span class=\"hljs-class\"><span class=\"hljs-keyword\">class</span> <span class=\"hljs-title\">TopologicalSort</span> </span>{\n  <span class=\"hljs-comment\">/**\n   * Determine whether there is a ring and the result of topological sorting\n   *\n   * Only directed acyclic graph (DAG) has topological sorting\n   * The main methods of breadth first search:\n   *    1、Iterate over all the vertices in the graph, and put the vertices whose in-degree is 0 into the queue.\n   *    2、A vertex is polled from the queue, and the in-degree of the adjacent point of the vertex is updated (minus 1). If the in-degree of the adjacent point is reduced by 1 and then equals to 0, the adjacent point is entered into the queue.\n   *    3、Keep executing step 2 until the queue is empty.\n   * If it is impossible to traverse all the vertics, it means that the current graph is not a directed acyclic graph. There is no topological sort.\n   *\n   *\n   * <span class=\"hljs-doctag\">@return</span> key returns the state, true if successful (no-loop), value if failed (loop), value is the result of topological sorting (could be one of these)\n   */</span>\n  <span class=\"hljs-keyword\">private</span> Map.Entry&lt;Boolean, List&lt;Vertex&gt;&gt; topologicalSort() {\n <span class=\"hljs-comment\">// Node queue with an in-degree of 0</span>\n    Queue&lt;Vertex&gt; zeroIndegreeVertexQueue = <span class=\"hljs-keyword\">new</span> LinkedList&lt;&gt;();\n    <span class=\"hljs-comment\">// Save the results</span>\n    List&lt;Vertex&gt; topoResultList = <span class=\"hljs-keyword\">new</span> ArrayList&lt;&gt;();\n    <span class=\"hljs-comment\">// Save the nodes whose in-degree is not 0</span>\n    Map&lt;Vertex, Integer&gt; notZeroIndegreeVertexMap = <span class=\"hljs-keyword\">new</span> HashMap&lt;&gt;();\n\n    <span class=\"hljs-comment\">// Scan all nodes and queue vertices with in-degree 0</span>\n    <span class=\"hljs-keyword\">for</span> (Map.Entry&lt;Vertex, VertexInfo&gt; vertices : verticesMap.entrySet()) {\n      Vertex vertex = vertices.getKey();\n      <span class=\"hljs-keyword\">int</span> inDegree = getIndegree(vertex);\n\n      <span class=\"hljs-keyword\">if</span> (inDegree == <span class=\"hljs-number\">0</span>) {\n        zeroIndegreeVertexQueue.add(vertex);\n        topoResultList.add(vertex);\n      } <span class=\"hljs-keyword\">else</span> {\n        notZeroIndegreeVertexMap.put(vertex, inDegree);\n      }\n    }\n    \n <span class=\"hljs-comment\">// After scanning, there is no node with an in-degree of 0, indicating that there is a loop, and return directly</span>\n    <span class=\"hljs-keyword\">if</span>(zeroIndegreeVertexQueue.isEmpty()){\n      <span class=\"hljs-keyword\">return</span> <span class=\"hljs-keyword\">new</span> AbstractMap.SimpleEntry(<span class=\"hljs-keyword\">false</span>, topoResultList);\n    }\n\n    <span class=\"hljs-comment\">// Using the topology algorithm, delete the node with an in-degree of 0 and its associated edges</span>\n    <span class=\"hljs-keyword\">while</span> (!zeroIndegreeVertexQueue.isEmpty()) {\n      Vertex v = zeroIndegreeVertexQueue.poll();\n      <span class=\"hljs-comment\">// Get the adjacent nodes</span>\n      Set&lt;Vertex&gt; subsequentNodes = getSubsequentNodes(v);\n\n      <span class=\"hljs-keyword\">for</span> (Vertex subsequentVertex : subsequentNodes) {\n\n        Integer degree = notZeroIndegreeVertexMap.get(subsequentVertex);\n\n        <span class=\"hljs-keyword\">if</span>(--degree == <span class=\"hljs-number\">0</span>){\n          topoResultList.add(subsequentVertex);\n          zeroIndegreeVertexQueue.add(subsequentVertex);\n          notZeroIndegreeVertexMap.remove(subsequentVertex);\n        }<span class=\"hljs-keyword\">else</span>{\n          notZeroIndegreeVertexMap.put(subsequentVertex, degree);\n        }\n\n      }\n    }\n\n    <span class=\"hljs-comment\">//notZeroIndegreeVertexMap If it is empty, it means there is no ring</span>\n    AbstractMap.SimpleEntry resultMap = <span class=\"hljs-keyword\">new</span> AbstractMap.SimpleEntry(notZeroIndegreeVertexMap.size() == <span class=\"hljs-number\">0</span> , topoResultList);\n    <span class=\"hljs-keyword\">return</span> resultMap;\n\n  }\n}\n</code></pre>\n<p><em>Notice: the output result is one of the topological sorting sequences of the graph.</em></p>\n<p>Every time a vertex is taken from a set with an in-degree of 0, there is no special rule for taking out. The order of taking the vertices will result in a different topological sorting sequence (if the graph has multiple sorting sequences).</p>\n<p>Since each vertex is outputted with the edges starting from it removed. If the graph has V vertices and E edges, the time complexity of the algorithm is typically O(V+E). The final key of the algorithm as implemented here returns the state, true if it succeeds (no rings), with  rings if it fails, and value if there are no rings as the result of topological sorting (which may be one of these). Note that the output is one of the topologically sorted sequences of the graph.</p>\n",
  "link": "/dist/en-us/blog/DAG.html",
  "meta": {}
}