{
  "filename": "DolphinScheduler_Kubernetes_Technology_in_action.md",
  "__html": "<h1>Technical Practice of Apache DolphinScheduler in Kubernetes System</h1>\n<div align=center>\n<img src=\"/img/2022-02-24/1.jpeg\"/>\n</div>\n<p>Author | Yang Dian, Data and Algorithm Platform Architect | Shenzhen Transportation Center</p>\n<p>Editor | warrior_</p>\n<blockquote>\n<p>Editor's note：</p>\n</blockquote>\n<blockquote>\n<p>Kubernetes is a cluster system based on container technology, implements container orchestration, provides microservices and buses, and involves a large number of knowledge systems.</p>\n</blockquote>\n<blockquote>\n<p>Starting from the author's actual work experience, this article shows us the use and technology sharing of DolphinScheduler in practice scenarios, hoping it can inspire those who have the same experience.</p>\n</blockquote>\n<h2>Why do we use DolphinSchedule? What value does it bring to us? And what problems did we encounter?</h2>\n<p>Apache DolphinScheduler is an excellent distributed and easily scalable visual workflow task scheduling platform.</p>\n<p>In the field I'm working in, the application of DolphinScheduler can quickly solve the top ten pain points of data development for enterprises:</p>\n<ul>\n<li>Multi-source data connection and access, most common data sources in the technical field can be accessed, and adding new data sources does not require too many changes;</li>\n<li>Diversified +specialized + massive data task management, which really revolves problems focusing on big data (Hadoop family, Flink, etc.) task scheduling, and is significantly different from traditional schedulers;</li>\n<li>Graphical task arrangement, super convenient user experience, competitive ability with commercial products, especially to most foreign open source products that cannot directly generate data tasks by dragging and dropping;</li>\n<li>Task details, rich viewing of tasks, log, and time-running axis display, which well meet developers' requirement of refined data tasks management, quickly locating slow SQL and performance bottlenecks;</li>\n<li>Support for a variety of distributed file systems, enrich users' choices for unstructured data;</li>\n<li>Native multi-tenant management to meet the data task management and isolation requirements of large organizations;</li>\n<li>Fully automatic distributed scheduling algorithm to balance all scheduling tasks;</li>\n<li>The native function of cluster monitoring, which can monitor CPU, memory, number of connections, Zookeeper status is suitable for one-stop operation and maintenance for SME;</li>\n<li>The native task alarm function, which minimizes the risk of task operation;</li>\n<li>The strong community-based operation, listening to the real voice of customers, constantly adding new functions, and continuously optimizing the customer experience.</li>\n</ul>\n<p>I also encountered many new challenges in the projects launching various types of Apache DolphinScheduler:</p>\n<ul>\n<li>How to deploy Apache DolphinScheduler with less human resources, and can a fully automatic cluster installation and deployment mode be realized?</li>\n<li>How to standardize technical component implementation specifications?</li>\n<li>Can unmanned supervision and system self-healing be achieved?</li>\n<li>How to install and update the air-gap mode under the network security control?</li>\n<li>Can it automatically expand without disturbing?</li>\n<li>How to build and integrate the monitoring system?</li>\n</ul>\n<p>To solve the above challenges, we repeatedly integrated Apache DolphinScheduler into the existing Kubernetes cloud-native system to tackle problems and make Apache DolphinScheduler technology more powerful.</p>\n<h2>Kubernetes Technical System Bring New Technical Features to Apache DolphinScheduler</h2>\n<p>After using Kubernetes to manage Apache DolphinScheduler, the overall technical solutions are quickly enriched and efficient technical features added, by which the above practical challenges  tackled quickly:</p>\n<ul>\n<li>The development environment and production environment was rapidly established in various independent deployment projects, and all can be implemented by one-key deployment and one-key upgrade;</li>\n<li>Overall supports offline installation, and the installation speed is faster;</li>\n<li>Unify the installation configuration information as much as possible to reduce the abnormal configuration of multiple projects. All configuration items can be managed through the internal git of the enterprise based on different projects;</li>\n<li>Combine with object storage technology to unify unstructured data technology;</li>\n<li>The convenient monitoring system is integrated with the existing prometheus monitoring system;</li>\n<li>Mixed-use of multiple schedulers;</li>\n<li>Fully automatic resource scheduling capability;</li>\n<li>Fast self-healing ability, automatic abnormal restart, and restart mode based on probe mode.</li>\n</ul>\n<p>The cases in this article are based on Apache DolphinScheduler version 1.3.9.</p>\n<h2>Automated and Efficient Deployment Based on Helm tools</h2>\n<p>First, let's introduce the installation method based on the Helm provided by the official website. Helm is the best way to find, share and use software to build Kubernetes, which is one of the graduate projects of cloud-native CNCF.</p>\n<div align=center>\n<img src=\"/img/2022-02-24/2.png\"/>\n</div>\n<p>There are very detailed configuration files and cases on Apache DolphinScheduler official website and GitHub. Here I‘ll highlight some of the FAQs in the community.</p>\n<p>Official website document address\n<a href=\"https://dolphinscheduler.apache.org/en-us/docs/1.3.9/user_doc/kubernetes-deployment.html\">https://dolphinscheduler.apache.org/en-us/docs/1.3.9/user_doc/kubernetes-deployment.html</a></p>\n<p>GitHub folder address\n<a href=\"https://github.com/apache/dolphinscheduler/tree/1.3.9-release/docker/kubernetes/dolphinscheduler\">https://github.com/apache/dolphinscheduler/tree/1.3.9-release/docker/kubernetes/dolphinscheduler</a></p>\n<p>Modify the image in the value.yaml file for offline installation (air-gap install);</p>\n<pre><code>image:\nrepository: &quot;apache/dolphinscheduler&quot;\ntag: &quot;1.3.9&quot;\npullPolicy: &quot;IfNotPresent&quot;\n</code></pre>\n<p>Pull, tag, and push for harbors installed in the company or private warehouses of other public clouds. Here we assume that the private warehouse address is <a href=\"http://harbor.abc.com\">harbor.abc.com</a>, the host where the image is built has been docker login <a href=\"http://harbor.abc.com\">harbor.abc.com</a>, and the new apache project under the private warehouse has been established and authorized.</p>\n<p>execute shell commands</p>\n<pre><code>docker pull apache/dolphinscheduler:1.3.9\ndock tag apache/dolphinscheduler:1.3.9 \nharbor.abc.com/apache/dolphinscheduler:1.3.9\ndocker push apache/dolphinscheduler:1.3.9\n</code></pre>\n<p>Then replace the image information in the value file. Here we recommend using the Always method to pull the image. In the production environment, try to check whether it is the latest image content every time to ensure the correctness of the software product. In addition, many coders are used to writing the tag as latest, and making the image without adding the tag information, which is very dangerous in the production environment. Because the image of the latest will be changed once anyone pushes the image and it is impossible to judge the version of the latest. So, it is recommended to be clear about the tags of each release, and use Always.</p>\n<pre><code>image:\nrepository: &quot;harbor.abc.com/apache/dolphinscheduler&quot;\ntag: &quot;1.3.9&quot;\npullPolicy: &quot;Always&quot;\n</code></pre>\n<p>Copy the entire directory of <a href=\"https://github.com/apache/dolphinscheduler/tree/1.3.9-release/docker/kubernetes/dolphinscheduler\">https://github.com/apache/dolphinscheduler/tree/1.3.9-release/docker/kubernetes/dolphinscheduler</a> to a host that can execute the Helm command, and then execute</p>\n<pre><code>kubectl create ns ds139\nhelm install dolphinscheduler . -n ds139 following the official website instruction to install offline.\n</code></pre>\n<p>to install offline.</p>\n<ul>\n<li>To integrate DataX, MySQL, Oracle client components, first download the following components:\n<a href=\"https://repo1.maven.org/maven2/mysql/mysql-connector-java/5.1.49/mysql-connector-java-5.1.49.jar\">https://repo1.maven.org/maven2/mysql/mysql-connector-java/5.1.49/mysql-connector-java-5.1.49.jar</a>\n<a href=\"https://repo1.maven.org/maven2/com/oracle/database/jdbc/ojdbc8/\">https://repo1.maven.org/maven2/com/oracle/database/jdbc/ojdbc8/</a>\n<a href=\"https://github.com/alibaba/DataX/blob/master/userGuid.md\">https://github.com/alibaba/DataX/blob/master/userGuid.md</a> Compile</li>\n</ul>\n<p>build and compile according to the prompt, and the file package is located in {DataX_source_code_home}/target/datax/datax/</p>\n<p>Create a new dockerfile based on the above plugin components, and the image that has been pushed to the private warehouse can be applied to the basic image.</p>\n<pre><code>FROM harbor.abc.com/apache/dolphinscheduler:1.3.9\nCOPY *.jar /opt/dolphinscheduler/lib/\nRUN mkdir -p /opt/soft/datax\nCOPY datax /opt/soft/datax\n</code></pre>\n<p>Save the dockerfile and execute the shell command</p>\n<pre><code>docker build -t harbor.abc.com/apache/dolphinscheduler:1.3.9-mysql-oracle-datax . #Don't forget the last point\ndocker push harbor.abc.com/apache/dolphinscheduler:1.3.9-mysql-oracle-datax\n</code></pre>\n<p>Modify the value file</p>\n<pre><code>image:\nrepository: &quot;harbor.abc.com/apache/dolphinscheduler&quot;\ntag: &quot;1.3.9-mysql-oracle-datax&quot;\npullPolicy: &quot;Always&quot;\n</code></pre>\n<p>Execute helm install dolphinscheduler . -n ds139\nor helm upgrade dolphinscheduler -n ds139, or  firstly helm uninstall dolphinscheduler -n ds139, and then execute helm install dolphinscheduler . -n ds139.</p>\n<ul>\n<li>Generally, it is recommended to use an independent external PostgreSQL as the management database in the production environment, and use the independently installed Zookeeper environment (I used the Zookeeper operator  <a href=\"https://github.com/pravega/zookeeper-operator\">https://github.com/pravega/zookeeper-operator</a> in this case, which is scheduled in the same Kubernetes cluster as Apache DolphinScheduler ). We found that after using the external database, completely deleting  and redeploying the Apache DolphinScheduler in Kubernetes, the task data, tenant data, user data, etc. are retained, which once again verifies the high availability of the system and data integrity. (If the pvc is deleted, the historical job log will be lost)</li>\n</ul>\n<pre><code>## If not exists external database, by default, Dolphinscheduler's database will use it.\npostgresql:\nenabled: false\npostgresqlUsername: &quot;root&quot;\npostgresqlPassword: &quot;root&quot;\npostgresqlDatabase: &quot;dolphinscheduler&quot;\npersistence:\n  enabled: false\n  size: &quot;20Gi&quot;\n  storageClass: &quot;-&quot;\n\n## If exists external database, and set postgresql.enable value to false.\n## external database will be used, otherwise Dolphinscheduler's database will be used.\nexternalDatabase:\ntype: &quot;postgresql&quot;\ndriver: &quot;org.postgresql.Driver&quot;\nhost: &quot;192.168.1.100&quot;\nport: &quot;5432&quot;\nusername: &quot;admin&quot;\npassword: &quot;password&quot;\ndatabase: &quot;dolphinscheduler&quot;\nparams: &quot;characterEncoding=utf8&quot;\n \n## If not exists external zookeeper, by default, Dolphinscheduler's zookeeper will use it.\nzookeeper:\nenabled: false\nfourlwCommandsWhitelist: &quot;srvr,ruok,wchs,cons&quot;\npersistence:\n  enabled: false\n  size: &quot;20Gi&quot;\n  storageClass: &quot;storage-nfs&quot;\nzookeeperRoot: &quot;/dolphinscheduler&quot;\n\n## If exists external zookeeper, and set zookeeper.enable value to false.\n## If zookeeper.enable is false, Dolphinscheduler's zookeeper will use it.\nexternalZookeeper:\nzookeeperQuorum: &quot;zookeeper-0.zookeeper-headless.zookeeper.svc.cluster.local:2181,zookeeper-1.zookeeper-headless.zookeeper.svc.cluster.local:2181,zookeeper-2.zookeeper-headless.zookeeper.svc.cluster.local:2181&quot;\nzookeeperRoot: &quot;/dolphinscheduler&quot;\n</code></pre>\n<h2>How to deploy GitOps based on Argo CD</h2>\n<p>Argo CD is a declarative GitOps continuous delivery tool based on Kubernetes. GitOps is an incubation project of CNCF and a best practice tool for GitOps. For more details of GitOps, please refer to <a href=\"https://about.gitlab.com/topics/gitops/\">https://about.gitlab.com/topics/gitops/</a></p>\n<div align=center>\n<img src=\"/img/2022-02-24/3.png\"/>\n</div>\n<p>GitOps can bring the following advantages to the implementation of Apache DolphinScheduler.</p>\n<ul>\n<li>Graphical &amp; one-click installation of clustered software;</li>\n<li>Git records the full release process, one-click rollback;</li>\n<li>Convenient DolphinScheduler tool log viewing.</li>\n</ul>\n<p>Implementation installation steps using Argo CD:</p>\n<ul>\n<li>Download the Apache DolphinScheduler source code from GitHub, modify the value file, and refer to the content that needs to be modified in the helm installation in the previous chapter;</li>\n<li>Create a new git project in the modified source code directory, and push it to the company's internal GitLab. The directory name of the GitHub source code is docker/kubernetes/dolphinscheduler;</li>\n<li>Configure GitLab information in Argo CD, we use https mode here;</li>\n</ul>\n<div align=center>\n<img src=\"/img/2022-02-24/4.png\"/>\n</div>\n<ul>\n<li>Argo CD Create a new deployment project and fill in the relevant information</li>\n</ul>\n<div align=center>\n<img src=\"/img/2022-02-24/5.png\"/>\n</div>\n<div align=center>\n<img src=\"/img/2022-02-24/6.png\"/>\n</div>\n<p>Refresh and pull the deployment information in git to complete the final deployment work. You can see that pod, configmap, secret, service, ingress and other resources are automatically pulled up, and Argo CD displays the commit information and submitter username used by git push before, which completely records all release event information. At the same time, you can also roll back to the historical version with one click.</p>\n<div align=center>\n<img src=\"/img/2022-02-24/7.png\"/>\n</div>\n<div align=center>\n<img src=\"/img/2022-02-24/8.png\"/>\n</div>\n<ul>\n<li>Relevant resource information can be seen through the kubectl command;</li>\n</ul>\n<pre><code>[root@tpk8s-master01 ~]# kubectl get po -n ds139\nNAME READY STATUS RESTARTS AGE\ndolphinscheduler-alert-96c74dc84-72cc9 1/1 Running 0 22m\ndolphinscheduler-api-78db664b7b-gsltq 1/1 Running 0 22m\ndolphinscheduler-master-0 1/1 Running 0 22m\ndolphinscheduler-master-1 1/1 Running 0 22m\ndolphinscheduler-master-2 1/1 Running 0 22m\ndolphinscheduler-worker-0 1/1 Running 0 22m\ndolphinscheduler-worker-1 1/1 Running 0 22m\ndolphinscheduler-worker-2 1/1 Running 0 22m\n\n[root@tpk8s-master01 ~]# kubectl get statefulset -n ds139\nNAME READY AGE\ndolphinscheduler-master 3/3 22m\ndolphinscheduler-worker 3/3 22m\n\n[root@tpk8s-master01 ~]# kubectl get cm -n ds139\nNAME DATA AGE\ndolphinscheduler-alert 15 23m\ndolphinscheduler-api 1 23m\ndolphinscheduler-common 29 23m\ndolphinscheduler-master 10 23m\ndolphinscheduler-worker 7 23m\n\n[root@tpk8s-master01 ~]# kubectl get service -n ds139\nNAME TYPE CLUSTER-IP EXTERNAL-IP PORT(S) AGE\ndolphinscheduler-api ClusterIP 10.43.238.5 &lt;none&gt; 12345/TCP 23m\ndolphinscheduler-master-headless ClusterIP None &lt;none&gt; 5678/TCP 23m\ndolphinscheduler-worker-headless ClusterIP None &lt;none&gt; 1234/TCP,50051/TCP 23m\n\n[root@tpk8s-master01 ~]# kubectl get ingress -n ds139\nNAME CLASS HOSTS ADDRESS\ndolphinscheduler &lt;none&gt; ds139.abc.com\n</code></pre>\n<ul>\n<li>You can see that all pods are scattered on different hosts in the Kubernetes cluster, for example, workers 1 and 2 are on different nodes.</li>\n</ul>\n<div align=center>\n<img src=\"/img/2022-02-24/9.png\"/>\n</div>\n<div align=center>\n<img src=\"/img/2022-02-24/10.png\"/>\n</div>\n<p>We have configured ingress, and the company can easily use the domain name for access by configuring the pan-domain name within the company;</p>\n<div align=center>\n<img src=\"/img/2022-02-24/11.png\"/>\n</div>\n<p>You can log in to the domain name for access：</p>\n<p>http:ds.139.abc.com/dolphinscheduler/ui/#/home</p>\n<ul>\n<li>The specific configuration can modify the content in the value file:</li>\n</ul>\n<pre><code>ingress:\nenabled: true\nhost: &quot;ds139.abc.com&quot;\npath: &quot;/dolphinscheduler&quot;\ntls:\n  enabled: false\n  secretName: &quot;dolphinscheduler-tls&quot;\n\n</code></pre>\n<ul>\n<li>It is convenient to view the internal logs of each component of Apache DolphinScheduler:</li>\n</ul>\n<div align=center>\n<img src=\"/img/2022-02-24/13.png\"/>\n</div>\n<ul>\n<li>Check the deployed system, 3 masters, 3 workers, and Zookeeper are all configured normally;</li>\n</ul>\n<div align=center>\n<img src=\"/img/2022-02-24/14.png\"/>\n</div>\n<div align=center>\n<img src=\"/img/2022-02-24/15.png\"/>\n</div>\n<ul>\n<li>Using Argo CD, it is very convenient to modify the number of replicas of components such as master, worker, api, alert, etc. Apache DolphinScheduler's helm configuration also reserves the setting information of CPU and memory. Here we modify the copy value in value. After modification, git push it to the company's internal GitLab.</li>\n</ul>\n<pre><code>master:\n \n ## PodManagementPolicy controls how pods are created during initial scale up, when replacing pods on nodes, or when scaling down.\npodManagementPolicy: &quot;Parallel&quot;\n ## Replicas is the desired number of replicas of the given Template.\nreplicas: &quot;5&quot;\n \nworker:\n ## PodManagementPolicy controls how pods are created during initial scale up, when replacing pods on nodes, or when scaling down.\npodManagementPolicy: &quot;Parallel&quot;\n ## Replicas is the desired number of replicas of the given Template.\nreplicas: &quot;5&quot;\n \n \nalert:\n ## Number of desired pods. This is a pointer to distinguish between explicit zero and not specified. Defaults to 1.\nreplicas: &quot;3&quot;\n \napi:\n ## Number of desired pods. This is a pointer to distinguish between explicit zero and not specified. Defaults to 1.\nreplicas: &quot;3&quot;\n</code></pre>\n<ul>\n<li>Just click sync on Argo CD to synchronize, and the corresponding pods will be added as required</li>\n</ul>\n<div align=center>\n<img src=\"/img/2022-02-24/17.png\"/>\n</div>\n<div align=center>\n<img src=\"/img/2022-02-24/18.png\"/>\n</div>\n<pre><code>[root@tpk8s-master01 ~]# kubectl get po -n ds139\nNAME                  READY STATUS RESTARTS AGE\ndolphinscheduler-alert-96c74dc84-72cc9 1/1  Running 0    43m\ndolphinscheduler-alert-96c74dc84-j6zdh 1/1  Running 0    2m27s\ndolphinscheduler-alert-96c74dc84-rn9wb 1/1  Running 0    2m27s\ndolphinscheduler-api-78db664b7b-6j8rj 1/1  Running 0    2m27s\ndolphinscheduler-api-78db664b7b-bsdgv 1/1  Running 0    2m27s\ndolphinscheduler-api-78db664b7b-gsltq 1/1  Running 0    43m\ndolphinscheduler-master-0       1/1  Running 0    43m\ndolphinscheduler-master-1       1/1  Running 0    43m\ndolphinscheduler-master-2       1/1  Running 0    43m\ndolphinscheduler-master-3       1/1  Running 0    2m27s\ndolphinscheduler-master-4       1/1  Running 0    2m27s\ndolphinscheduler-worker-0       1/1  Running 0    43m\ndolphinscheduler-worker-1       1/1  Running 0    43m\ndolphinscheduler-worker-2       1/1  Running 0    43m\ndolphinscheduler-worker-3       1/1  Running 0    2m27s\ndolphinscheduler-worker-4       1/1  Running 0    2m27s\n\n</code></pre>\n<h2>Apache DolphinScheduler integrates with S3 Object Storage Technology</h2>\n<p>How to configure the integration of s3 minio is one of the FAQs in the community. Here is the method of helm configuration based on Kubernetes.</p>\n<ul>\n<li>Modify the s3 part of value, it is recommended to use ip+port to point to the minio server.</li>\n</ul>\n<pre><code>common:\n ##Configmap\nconfigmap:\n  DOLPHINSCHEDULER_OPTS: &quot;&quot;\n  DATA_BASEDIR_PATH: &quot;/tmp/dolphinscheduler&quot;\n  RESOURCE_STORAGE_TYPE: &quot;S3&quot;\n  RESOURCE_UPLOAD_PATH: &quot;/dolphinscheduler&quot;\n  FS_DEFAULT_FS: &quot;s3a://dfs&quot;\n  FS_S3A_ENDPOINT: &quot;http://192.168.1.100:9000&quot;\n  FS_S3A_ACCESS_KEY: &quot;admin&quot;\n  FS_S3A_SECRET_KEY: &quot;password&quot;\n</code></pre>\n<ul>\n<li>The name of the bucket that stores dolphin files in minio is dolphinscheduler. I create new folders and files for testing here. The directory of the minio is under the tenant of the upload operation.</li>\n</ul>\n<div align=center>\n<img src=\"/img/2022-02-24/19.png\"/>\n</div>\n<h2>Apache DolphinScheduler Integrates with Kube-Prometheus Technology</h2>\n<ul>\n<li>\n<p>We use the Kube-prometheus operator technology in Kubernetes to automatically monitor the resources of each component of  Apache DolphinScheduler after deploying.</p>\n</li>\n<li>\n<p>Please pay attention to that the version of kube-prometheus needs to correspond to the major version of Kubernetes. <a href=\"https://github.com/prometheus-operator/kube-prometheus\">https://github.com/prometheus-operator/kube-prometheus</a></p>\n</li>\n</ul>\n<div align=center>\n<img src=\"/img/2022-02-24/20.png\"/>\n</div>\n<div align=center>\n<img src=\"/img/2022-02-24/21.png\"/>\n</div>\n<div align=center>\n<img src=\"/img/2022-02-24/22.png\"/>\n</div>\n<h2>Technical Integration of Apache DolphinScheduler and Service Mesh</h2>\n<ul>\n<li>Through the service mesh technology, the observability analysis of API external service calls and internal calls of Apache DolphinScheduler can be realized to optimize the Apache DolphinScheduler product services.</li>\n</ul>\n<p>We use linkerd as a service mesh product for integration, which is also one of CNCF's excellent graduate projects.</p>\n<div align=center>\n<img src=\"/img/2022-02-24/23.png\"/>\n</div>\n<p>Just modify the annotations in the value file of the Apache  DolphinScheduler helm and redeploy, you can quickly inject the mesh proxy sidecar, as well as master, worker, API, alert and other components.</p>\n<pre><code>annotations: #{}\n   linkerd.io/inject: enabled\n</code></pre>\n<p>You can observe the quality of service communication between components, the number of requests per second, etc.</p>\n<div align=center>\n<img src=\"/img/2022-02-24/24.png\"/>\n</div>\n<div align=center>\n<img src=\"/img/2022-02-24/25.png\"/>\n</div>\n<h2>Prospects on Apache DolphinScheduler Based on cloud-native Technology</h2>\n<p>As a new-generation Cloud-Native big data tool, Apache DolphinScheduler is expected to integrate more excellent tools and features in the Kubernetes ecosystem in the future to meet more requirements of diversified user groups and scenarios.</p>\n<ul>\n<li>Integration with Argo-workflow, users can call Argo-workflow single job, dag job, and periodic job in Apache DolphinScheduler through api, cli, etc.;</li>\n<li>Use HPA to automatically expand and shrink workers to achieve unattended horizontal expansion;</li>\n<li>Integrate the Spark operator and Flink operator tools of Kubernetes to achieve comprehensive cloud-native;</li>\n<li>Implement multi-cloud and multi-cluster distributed job scheduling, and strengthen the architectural attributes of serverless+faas classes;</li>\n<li>Use sidecar to periodically delete worker job logs to realize carefree operation and maintenance;</li>\n</ul>\n<p>Finally, I strongly recommend you to use Slack to communicate with the Apache DolphinScheduler community, which is officially recommended！</p>\n<div align=center>\n<img src=\"/img/2022-02-24/26.png\"/>\n</div>",
  "link": "/dist/en-us/blog/DolphinScheduler_Kubernetes_Technology_in_action.html",
  "meta": {
    "title": "Technical Practice of Apache DolphinScheduler in Kubernetes System",
    "keywords": "Apache,DolphinScheduler,scheduler,big data,ETL,airflow,hadoop,orchestration,dataops,Kubernetes",
    "description": "Kubernetes is a cluster system based on container technology"
  }
}