{
  "filename": "DS-2.0-alpha-release.md",
  "__html": "<h1>Refactoring, Plug-in, Performance Improves By 20 times, Apache DolphinScheduler 2.0 alpha Release Highlights Check!</h1>\n<div align='center'><img src=\"https://s1.imgpp.com/2021/11/16/a920be6733a3d99af38d1cdebfcbb3ff.md.png\"></div>\n<p>Hello community, good news! After nearly 10 months of joint efforts by more than 100 community contributors, we are happy to announce the release of Apache DolphinScheduler 2.0 alpha. This is the first major version of DolphinScheduler since it entered Apache. It has undergone a number of key updates and optimizations, which means a milestone in the development of DolphinScheduler.\nDolphinScheduler 2.0 alpha mainly refactors the implementation of Master, greatly optimizes the metadata structure and processing flow, adds SPI plug-in capabilities, and improves performance by 20 times. At the same time, the new version has designed a brand new UI interface to bring a better user experience. In addition, 2.0 alpha has newly added and optimized some features that are eagerly demanded in the community, such as parameter transfer, version control, import and export functions.\nNote: The current alpha version does not support automatic upgrades, and we will support this feature in the next version.</p>\n<p>2.0 alpha download link: <a href=\"https://dolphinscheduler.apache.org/en-us/download/download.html\">https://dolphinscheduler.apache.org/en-us/download/download.html</a></p>\n<h2>Optimize the Kernel and Increase Performance By 20 Times</h2>\n<p>Compared with DolphinScheduler 1.3.8, under the same hardware configuration (3 sets of 8-core 16G), 2.0 alpha throughput performance is increased by 20 times, which is mainly due to the reconstruction of the Master, the optimization of master execution process and the workflow processing process, etc. ,including:</p>\n<ul>\n<li>\n<p>Refactor the execution process of the Master, change the previous status polling monitoring to an event notification mechanism, which greatly reduces the pressure of the database polling;\nRemove the global lock, increase the fragmentation processing mechanism of the Master, change the sequential read and write commands to parallel processing, and enhance the horizontal expansion ability of the Master;</p>\n</li>\n<li>\n<p>Optimize the workflow processing process, reduce the use of thread pool, and greatly increase the number of workflows processed by a single Master;\nIncrease the caching mechanism to greatly reduce the number of database operations;</p>\n</li>\n<li>\n<p>Optimize the database connection mode, which immensely reduces the time-consuming of database operation;</p>\n</li>\n<li>\n<p>Simplify the processing flow and reduce unnecessary time-consuming operations during the processing.</p>\n</li>\n</ul>\n<h2>UI Components Optimization Brings Brand New UI Interface</h2>\n<div align='center'><img src=\"https://s1.imgpp.com/2021/11/16/4e4024cbddbe3113f730c5e67f083c4f.md.png\"></div>\n<div align='center'><img src=\"https://s1.imgpp.com/2021/11/16/75e002b21d827aee9aeaa3922c20c13f.md.png\"></div>\n<p>UI interface comparison: 1.3.9 (top) VS. 2.0 alpha (bottom)</p>\n<blockquote></blockquote>\n<p>2.0 UI mainly optimized by:</p>\n<ul>\n<li>\n<p>Optimize the display of components: the interface is more concise, and the workflow process display is clearer;</p>\n</li>\n<li>\n<p>Highlight the key content: click the task box can display task details;</p>\n</li>\n<li>\n<p>Enhanced recognizability: The tool bar on the left is marked with names to make the tools easier to identify and easy to operate;</p>\n</li>\n<li>\n<p>Adjust the order of the components: adjust the order of the components to be more in line with user habits.</p>\n</li>\n</ul>\n<p>In addition to changes in performance and UI, DolphinScheduler has also undergone more than 20 new features and bug fixes.</p>\n<h2>List of New Features</h2>\n<ul>\n<li>Task result transfer function</li>\n<li>Added Switch task and Pigeon task components</li>\n<li>Added environmental management function</li>\n<li>Added batch import , export and batch move functions</li>\n<li>New registration center plug-in function</li>\n<li>New task plugin function</li>\n</ul>\n<h2>Optimizations</h2>\n<ul>\n<li>Optimize the alarm group function</li>\n<li>Optimize RestApi</li>\n<li>Optimize workflow version management</li>\n<li>Optimize import and export</li>\n<li>Optimize worker group management function</li>\n<li>Optimize the <a href=\"http://install.sh\">install.sh</a> installation script to simplify the configuration process</li>\n</ul>\n<h2>Bug fix</h2>\n<ul>\n<li>[#6550]The list of environments in the DAG task pop-up window is not updated</li>\n<li>[#6506]Fix <a href=\"http://install.sh\">install.sh</a> for DS 2.0 and add comment to install_config.conf</li>\n<li>[#6497]Shell task can not use user defined environment correctly</li>\n<li>[#6478]Missing history data in complement data mode</li>\n<li>[#6352]override the old process definition when I use the copy workflow feature</li>\n<li>[#6342]Task instance page date backfill bug</li>\n<li>[#5701]When deleting a user, the accessToken associated with the user should also be deleted</li>\n<li>[#4809]cannot get application status when kerberos authentication is enabled</li>\n<li>[#4450]Hive/Spark data sources do not support multi-tenancy when Kerberos authentication is enabled bug</li>\n</ul>\n<h2>Thanks to Contributors</h2>\n<p>The release of DolphinScheduler 2.0 alpha embodies the wisdom and strength of the community contributors. Their active participation and great enthusiasm open the DolphinScheduler 2.0 era!\nThanks so much for the participation of 100+ contributors (GitHub ID), and we are looking forward to more and more open sourcing enthusiasts joining the DolphinScheduler community co-construction, to contribute yourself to building a more usable big data workflow scheduling platform!</p>\n<div align='center'><img src=\"https://s1.imgpp.com/2021/11/16/8926d45ead1f735e8cfca0e8142b315f.md.png\"></div>\n<p>2.0 List of alpha contributors</p>\n",
  "link": "/dist/en-us/blog/DS-2.0-alpha-release.html",
  "meta": {}
}