{
  "filename": "Introducing-Apache-DolphinScheduler-1.3.9.md",
  "__html": "<h1>Introducing Apache DolphinScheduler 1.3.9, StandaloneServer is Available!</h1>\n<p><a href=\"https://imgpp.com/image/OQFd4\"><img src=\"https://s1.imgpp.com/2021/10/25/_5fc2f5f0697d2457db591583571c1a50_25072.md.jpg\" alt=\"_5fc2f5f0697d2457db591583571c1a50_25072.md.jpg\"></a></p>\n<p>On October 22, 2021, we are excited to announce the release of Apache DolphinScheduler 1.3.9. After a month and a half，Apache DolphinScheduler 1.3.9 brings StandaloneServer to users with the joint efforts of the community. StandaloneServer is a major update of this version, which means a huge leap in ease of use, and the details will be introduced below. In addition, this upgrade also fixes two critical bugs in 1.3.8.</p>\n<h2>1.3.9 Download：<a href=\"https://dolphinscheduler.apache.org/en-us/download/download.html\">1.3.9 Download Link</a></h2>\n<p>In 1.3.9, the main updates include:</p>\n<h2>New Features</h2>\n<p><strong>[Feature#6480] Add StandaloneServer to make development and operation easier</strong></p>\n<p>StandaloneServer is a service created to allow users to quickly experience the product. The registry and database H2-DataBase and Zk-TestServer are built-in. Users can start StandaloneServer for debugging with only one line of command.</p>\n<p>The way to start StandaloneServer with one-line command: switch to a user with sudo permission, and run the script</p>\n<pre><code class=\"language-plain\">sh ./bin/dolphinscheduler-daemon.sh start standalone-server\n</code></pre>\n<p>It shows that 1.3.9 reduces the configuration cost through built-in components. You only need to configure the jdk environment to start the DolphinScheduler system with one click, thereby improving the efficiency of research and development. For detailed usage documents, please refer to: link to be added.</p>\n <img src=\"/img/login_en.png\" width=\"60%\" />\n<p>Access the front page address, interface IP (self-modified) <a href=\"http://localhost:12345/dolphinscheduler\">http://localhost:12345/dolphinscheduler</a>, with the default name and password:admin/dolphinscheduler123.</p>\n<p>The detailed user docs for Standalone, please refer to:<a href=\"https://dolphinscheduler.apache.org/en-us/docs/1.3.9/user_doc/standalone-server.html\">1.3.9 standalone-server</a></p>\n<h2>Optimization and Fix</h2>\n<p><strong>☆[Fix #6337][Task] Sql limit param no default value</strong></p>\n<p>When the SqlTask ​​is executed, if the limit parameter is not set, the displayed result is empty. Based on this, the default parameters have been added in 1.3.9, and relevant instructions have been made on the log to allow users to track the problem more clearly.</p>\n<p><strong>☆[Bug#6429] [ui] sub_process node open sub_task show empty page #6429</strong></p>\n<p>The problem that the sub_task node is displayed as empty has been fixed.</p>\n<h2>Contributor</h2>\n<p>Thanks to PMC Ke Zhenxu from the SkyWalking community for his contribution to StandaloneServer, Apache DolphinScheduler will persistently optimize the function design and enhance the user experience with the participation of more contributors, so stay tuned.</p>\n<h3>1 DolphinScheduler introduction</h3>\n<p>Apache DolphinScheduler is a distributed and extensible workflow scheduler platform with powerful DAG visual interfaces, dedicated to solving complex job dependencies in the data pipeline and providing various types of jobs available out of box.</p>\n<p>DolphinScheduler assembles Tasks in the form of DAG (Directed Acyclic Graph), which can monitor the running status of tasks in real time. At the same time, it supports operations such as retry, recovery from designated nodes, suspend and Kill tasks, and focuses on the following 6 capabilities :</p>\n<img src=\"https://s1.imgpp.com/2021/10/25/WechatIMG89.md.jpg\" width=\"60%\" />\n<h2>2 Partial User Cases</h2>\n<p>According to incomplete statistics, as of October 2020, 600+ companies and institutions have adopted DolphinScheduler in production environments. Partial cases are shown as below (in no particular order).</p>\n<p><a href=\"https://imgpp.com/image/OQylI\"><img src=\"https://s1.imgpp.com/2021/10/25/logo.md.png\" alt=\"logo.md.png\"></a></p>\n<h2>3 Participate in Contribution</h2>\n<p>With the prosperity of open source in China, the Apache DolphinScheduler community ushered in vigorous development. In order to make better and easy-to-use scheduling system, we sincerely welcome partners who love open source to join Apache DolphinScheduler Community.</p>\n<p>There are many ways to participate in and contribute to the Apache DolphinScheduler Community, including:</p>\n<ul>\n<li>Contribute to the first PR (document, code). We hope it to be simple and a try to get yourself familiar with the submission process and community collaboration.</li>\n<li>We have compiled a list of issues suitable for novices: <a href=\"https://github.com/apache/dolphinscheduler/issues/5689\">Good First Issues</a></li>\n<li>And a list of issues for non-newbie: <a href=\"https://github.com/apache/dolphinscheduler/issues?q=is%3Aopen+is%3Aissue+label%3A%22volunteer+wanted%22\">Volunteer Wanted</a></li>\n<li>How to participate in the contribution: <a href=\"https://dolphinscheduler.apache.org/en-us/community/development/contribute.html\">Participate in Contributing</a></li>\n</ul>\n<p>Apache DolphinScheduler Community needs you! Even if a small piece of tile will make a big differnce.</p>\n<p>If you are interested in contributing code we created <a href=\"https://github.com/apache/dolphinscheduler/issues/5689\">Good First Issues </a> to get you started. If you have any questions about <a href=\"https://github.com/apache/dolphinscheduler\">code</a>, <a href=\"https://dolphinscheduler.apache.org/en-us/download/download.html\">installation</a>, and <a href=\"https://dolphinscheduler.apache.org/en-us/docs/1.3.9/user_doc/quick-start.html\">docs</a> please do not hesitate to reach out to us on <a href=\"https://app.slack.com/client/T01L3LB96V7/C01LUG59GPR\">slack</a>.</p>\n<p><strong>Community Official Website</strong></p>\n<p><a href=\"/\">https://dolphinscheduler.apache.org/</a></p>\n<p><strong>Code Warehouse Address</strong></p>\n<p><a href=\"https://github.com/apache/dolphinscheduler\">https://github.com/apache/dolphinscheduler</a></p>\n",
  "link": "/dist/en-us/blog/Introducing-Apache-DolphinScheduler-1.3.9.html",
  "meta": {}
}