{
  "filename": "Lizhi-case-study.md",
  "__html": "<h1>A Formidable Combination of Lizhi Machine Learning Platform&amp; DolphinScheduler Creates New Paradigm for Data Process in the Future</h1>\n<blockquote>\n<p>Editor's word: The online audio industry is a blue ocean market in China nowadays. According to CIC data, the market size of China’s online audio industry has grown from 1.6 billion yuan in 2016 to 13.1 billion yuan in 2020, with a compound annual growth rate of 69.4%. With the popularity of the Internet of Things, audio has permeated into various terminals mobiles, vehicles, smart hardware, home equipment, and other various scenarios, sequentially to maximize the accompanying advantages of audio carriers.</p>\n</blockquote>\n<blockquote>\n<p>In recent years, domestic audio communities have successfully been listed one after another. Among them, Lizhi was listed on NASDAQ in 2020 as the first “online audio” stock, which has more than 200 million users at present. In the information age, the audio industry also faces the generation of massive UGC data on the platform. On one hand, the users and consumers of audio content expect high-efficiency information transmission; on the other hand, the internet audio platforms hope that information can be accurately and quickly pushed to users while ensuring the security of platform UGC content. To process massive data most efficiently, major audio platforms are seeking methods to combine the increasingly mature machine learning technology with big data scheduling systems. Lizhi’s Machine Learning Intelligent Recommendation Platform is having a try by combining the machine learning platform with the big data scheduling system DolphinScheduler.</p>\n</blockquote>\n<h2>Background</h2>\n<div align=center>\n<img src=\"https://s1.imgpp.com/2021/11/23/radio-g360707f44_1920.md.jpg\"/>\n</div>\n<p>Lizhi is a fast-growing UGC audio community company that attaches great importance to AI and data analysis technology development. AI can find the right voice for each user among the massively fragmented audios, and build it into a sustainable ecological closed loop. And data analysis can guide the company’s fast-growing business. Both of the two fields need to process massive amounts of data and require a big data scheduling system.</p>\n<p>Before the beginning of 2020, Lizhi used the Azkaban scheduling system. Although the big data scheduling SQL/shell/python scripts and other big data-related modules can complete the entire AI process, it is not easy and reusable enough. The machine learning platform is a set of systems built specifically for AI, which abstracts the AI development paradigm, i.e. data acquisition, data preprocessing, model training, model prediction, model evaluation, and model release into modules. Each module provides multiple implementations and is connected in series by DAG to achieve low-code development by drag-and-drop configuration.</p>\n<h2>Challenges During Machine Learning Platform Development</h2>\n<p>During the machine learning platform development, Lizhi has some clear requirements for the scheduling system:</p>\n<ol>\n<li>\n<p>It should be able to store and calculate massive data, such as screening samples, generating portraits, feature preprocessing, distributed model training, etc.;</p>\n</li>\n<li>\n<p>The DAG execution engine is required, and the processes such as data acquisition -&gt; data preprocessing -&gt; model training -&gt; model prediction -&gt; model evaluation -&gt; model release should be executed in series with DAG.</p>\n</li>\n</ol>\n<p>In the development by Azkaban, the team encountered some challenges:</p>\n<p>Challenge 1: The development model is cumbersome, which requires the user to package scripts and build DAG dependencies, and there is no implementation of DAG drag and drop;</p>\n<p>Challenge 2: The modules are not rich enough, and the scripted AI modules are not universal enough, thus the team need to develop modules repeatedly, which is unnecessary and error-prone;</p>\n<p>Challenge 3: Stand-alone deployment, the system is unstable and prone to failures. Besides, Task jams can easily cause downstream tasks to fail.</p>\n<h2>Turn to DolphinScheduler</h2>\n<p>After stepping on numerous pits in the old system, the Lizhi machine learning team, including recommendation system engineers Haibin Yu, Yanbin Lin, Huanjie Xie, and Yifei Guo, decided to adopt DolphinScheduler.</p>\n<p>Currently, 1,600+ processes and 12,000+ tasks (IDC) are running smoothly on DolphinScheduler every day.</p>\n<p>Haibin Yu said that the majority of the users of the scheduling system are recommendation algorithms engineers&gt; data analysts&gt; risk control algorithms engineers&gt; business developers (importance decreased in order). Not all of them are masters of data management operations, and DolphinScheduler perfectly meets their needs for a simple, easy-to-use, drag-and-drop scheduling system:</p>\n<ol>\n<li>\n<p>Distributed decentralized architecture and fault tolerance mechanism to ensure the high availability of the system;</p>\n</li>\n<li>\n<p>Visual DAG drag-and-drop UI, easy to use, and iterates quickly;</p>\n</li>\n<li>\n<p>It supports various modules, and can simply develop and integrate its modules;</p>\n</li>\n<li>\n<p>The community is active, hence there are no worries about the project supports;</p>\n</li>\n<li>\n<p>It is very close to the operating mode of the machine learning platform, using DAG to drag and drop UI programming.</p>\n</li>\n</ol>\n<h2>Use Case</h2>\n<p>After selecting the DolphinScheduler, the Lizhi machine learning platform carries out re-development based on it and applies the achievements to actual business scenarios, which are mainly about recommendation and risk control. Recommendation scenarios cover recommendation of voice, anchor, live broadcast, podcast, friend, etc., and risk control scenarios cover risk control in payment, advertising, and comment, etc.\nAt the technical level of the platform, Lizhi optimizes the extended modules for the five paradigms of machine learning, i.e. obtaining training samples, data preprocessing, model training, model evaluation, and model release.</p>\n<p>A simple xgboost case:</p>\n<div align=center>\n<img src=\"https://s1.imgpp.com/2021/11/23/1.png\"/>\n</div>\n<h3>1. Obtaining training samples</h3>\n<p>At present, Lizhi does not directly select data from Hive, and joins the union, splitting the sample afterward, but directly processes the sample by shell nodes.</p>\n<div align=center>\n<img src=\"https://s1.imgpp.com/2021/11/23/2.png\"/>\n</div>\n<h3>2. Data preprocessing</h3>\n<p>Transformer&amp; custom preprocessing configuration file, use the same configuration for online training, and feature preprocessing is performed after the feature is obtained. It contains the itemType and its feature set to be predicted, the user’s userType and its feature set, as well as the associated and crossed itemType and its feature set. Define the transformer function for each feature preprocessing, supports custom transformer and hot update, xgboost, and tf model feature preprocessing. After the node process, the data format that is needed for model training is prepared. This configuration file will also be brought along when the model is released to keep training and online prediction consistent. This file is maintained in the resource center of DolphinScheduler.</p>\n<div align=center>\n<img src=\"https://s1.imgpp.com/2021/11/23/2.png\"/>\n</div>\n<h3>3. Xgboost training</h3>\n<p>It supports w2v, xgboost, tf model training modules. The training modules are first packaged with TensorFlow or PyTorch and then packaged into DolphinScheduler modules.\nFor example, in the xgboost training process, use Python to package the xgboost training script into the xgboost training node of DolphinScheduler, and show the parameters required for training on the interface. The file exported by “training set data preprocessing” is input to the training node through HDFS.</p>\n<div align=center>\n<img src=\"https://s1.imgpp.com/2021/11/23/3.png\"/>\n</div>\n<h3>4. Model release</h3>\n<p>The release model will send the model and preprocessing configuration files to HDFS and insert records into the model release table. The model service will automatically identify the new model, update the model, and provide online prediction services to the external.</p>\n<div align=center>\n<img src=\"https://s1.imgpp.com/2021/11/23/4.png\"/>\n</div>\n<p>Haibin Yu said that due to historical and technical limitations, Lizhi has not yet built a machine learning platform like Ali PAI, but the practice has proved that similar platform functions can be achieved based on DolphinScheduler.</p>\n<p>In addition, Lizhi has also carried out many re-developments based on DolphinScheduler to make the scheduling system more in line with actual business needs, such as:</p>\n<ol>\n<li>\n<p>Pop-up the window of whether to set timing when defining the workflow</p>\n</li>\n<li>\n<p>Add display pages for all workflow definitions to facilitate searching</p>\n</li>\n</ol>\n<p>a) Add the workflow definition filter and jump to the workflow instance page, and use a line chart to show the change of its running time\nb) The workflow instance continues to dive to the task instance</p>\n<ol start=\"3\">\n<li>Enter parameters during runtime to configure the disabled task nodes</li>\n</ol>\n<h2>Machine Learning Platform based on Scheduling System May Lead the Future Trend</h2>\n<p>Deep learning is a leading trend in the future. Lizhi has developed new modules for deep learning models. The entire tf process has been completed yet, and LR and GBDT model-related modules are also in the plan. The latter two deep learning models are relatively more simple, easier to get started, faster to iterate, and can be used in generally recommended scenarios. After implementation, the Lizhi machine learning platform can be more complete.\nLizhi believes that if the scheduling system can be improved in terms of kernel stability, drag-and-drop UI support, convenient modules' expansion, task plug-in, and task parameter transfer, building the machine learning platform based on the scheduling system may become a common practice in the industry.</p>\n",
  "link": "/dist/en-us/blog/Lizhi-case-study.html",
  "meta": {}
}