{
  "filename": "Meetup_2022_02_26.md",
  "__html": "<h1>Sign Up to Apache DolphinScheduler Meetup Online | We Are Waiting For You to Join the Grand Gathering on 2.26 2022!</h1>\n<div align=center>\n<img src=\"/img/2022-02-26/08.png\"/>\n</div>\n<p>Hello the community! After having adjusted ourselves from the pleasure of Spring Festival and re-devote to the busywork, study, and life, Apache DolphinScheduler is here to wish everyone a prosperous and successful journey in the Lunar year of the Tiger.</p>\n<p>In this early spring, Apache DolphinScheduler's first Meetup in 2022 is also coming soon. I believe that the community has already been looking forward to it!</p>\n<p>In this Meetup, four guests from our user companies will share their experience when using Apache DolphinScheduler. Whether you are a user of Apache DolphinScheduler or a spectator, you can definitely learn a lot from it.</p>\n<p>We are looking forward to more friends joining us in the future, and more and more users will share practical experiences with each other.</p>\n<p>The first show of Apache DolphinScheduler in February 2022 will be broadcast on time at 14:00 pm on February 26th.</p>\n<p>You can also click <a href=\"https://www.slidestalk.com/m/679\">https://www.slidestalk.com/m/679</a> to go directly to the live broadcast reservation interface!</p>\n<h2>1. Introduction to the Event</h2>\n<p>Topic: Apache DolphinScheduler user practice sharing</p>\n<p>Time: 2022-2-26 14:00-17:00（Beijing Time）</p>\n<p>Format: Live online</p>\n<p><a href=\"https://www.slidestalk.com/m/679\">Click https://www.slidestalk.com/m/679</a> <strong>to register.</strong></p>\n<p><strong>Click</strong> <a href=\"https://asf-dolphinscheduler.slack.com/\">https://asf-dolphinscheduler.slack.com/</a> <strong>to join the community on Slack</strong></p>\n<h2>2. Event Highlights</h2>\n<p>In this meetup, we invite four big data engineers from 360 Digital Technology, CISCO (China) and Tujia to share their development experiences based on Apache DolphinScheduler, which is highly representative and typical. The topics they shared with us refer to the exploration and application on the K8S cluster and the transformation of the Alert module, etc., which are of great significance to solve the difficulties you may encounter in scenario application. We hope these technical exchanges will help to solve your urgent needs.</p>\n<h2>3. Event Agenda</h2>\n<div align=center>\n<img src=\"/img/2022-02-26/Schedule.png\"/>\n</div>\n<h2>4. Topic introduction</h2>\n<p>Jianmin Liu/ 360 Digital Technology/ Big Data Engineer</p>\n<p><strong>Speech Topic: Practice on Apache DolphinScheduler in 360 Digital Technology</strong></p>\n<p><strong>Speech Outline:</strong> The evolution of big data scheduling from Azkaban to DS, and the use and transformation of Apache DolphinScheduler.</p>\n<p>Qingwang Li/CISCO (China) /Big Data Engineer</p>\n<p><strong>Speech Topic: Retrofit of Apache DolphinScheduler Alert module</strong></p>\n<p><strong>Speech outline:</strong>  The exploration of switching to Apache DolphinScheduler, and modifying the Alert module of Apache DolphinScheduler for different alarm scenarios.</p>\n<p>Xuchao Zan/Tujia/Big Data Engineer</p>\n<p><strong>Speech topic: Exploration and Application on Apache DolphinScheduler</strong></p>\n<p><strong>Speech outline:</strong> Tujia introduced Apache DolphinScheduler, built Tujia data scheduling system, and completed the access of data services, including offline tables, emails, and data synchronization. The function development on the scheduling system will be introduced in detail.</p>\n<p>Qian Liu/Cisco(China)/Big Data Engineer</p>\n<p><strong>Speech Topic: Exploration and Application of Apache DolphinScheduler on K8S Cluster</strong></p>\n<p><strong>Speech outline:</strong> The exploration of switching to Apache DolphinScheduler, and submitting tasks to k8s based on DS secondary development support. Currently, tasks such as mirroring, Spark, Flink, etc. can be run on our scheduling system,  and the exploration of log monitoring and alarming will also be introduced.</p>\n<p>We will see you at 14:00 on February 26th!</p>\n",
  "link": "/dist/en-us/blog/Meetup_2022_02_26.html",
  "meta": {
    "title": "# Sign Up to Apache DolphinScheduler Meetup Online | We Are Waiting For You to Join the Grand Gathering on 2.26 2022!",
    "keywords": "Apache,DolphinScheduler,scheduler,big data,ETL,airflow,hadoop,orchestration,dataops,Meetup",
    "description": "Hello the community! After having adjusted ourselves from the pleasure of Spring Festival and re-devote to the busywork,"
  }
}