{
  "filename": "Twos.md",
  "__html": "<h2>Congratulations! Apache DolphinScheduler Has Been Approved As A TWOS Candidate Member</h2>\n<div align=center>\n<img src=\"https://s1.imgpp.com/2022/01/10/1641804549068.png\"/>\n</div>\n<p>Recently, TWOS officially announced the approval of 6 full members and 3 candidate members, Apache DolphinScheduler, a cloud-native distributed big data scheduler, was listed by TWOS.</p>\n<p>Apache DolphinScheduler is a new-generation workflow scheduling platform that is distributed and easy to expand. It is committed to &quot;solving the intricate dependencies among big data tasks and visualizing the entire data processing&quot;. Its powerful visual DAG interface greatly improves the user experience and can configure workflow without complex code.</p>\n<p>Since it was officially open-sourced in April 2019, Apache DolphinScheduler (formerly known as EasyScheduler) has undergone several architectural evolutions. So far, the relevant open-source codes have accumulated 7100+ Stars, with 280+ experienced code contributors, 110+ non-code contributors participating in the project, which includes PMCs and Committers of other Apache top-level projects. The Apache DolphinScheduler open source community continues to grow, and the WeChat user group has reached 6000+ people, and 600+ companies and institutions have adopted Apache DolphinScheduler in their production environment.</p>\n<h2>TWOS</h2>\n<p>At the &quot;2021 OSCAR Open Source Industry Conference&quot;, China Academy of Telecommunication Research of MIIT (CAICT) officially established TWOS. TWOS is composed of open-source projects and open-source communities, which aims to guide the establishment of a healthy, credible, sustainable open source community, and build a communication platform providing a complete set of open source risk monitoring and ecological monitoring services.</p>\n<p>To help enterprises reduce the risk of using open source software and promote the establishment of a credible open source ecosystem, CAICT has created a credible open-source standard system, which carries authoritative evaluation on enterprise open source governance capabilities, open-source project compliance, open-source community maturity, open-source tool detection capabilities, Open- source risk management capabilities of commercial products.</p>\n<p>After being screened by TWOS evaluation criteria, Apache DolphinScheduler was approved to be a candidate member, which shows its recognition of Apache DolphinScheduler's way of open-source operation, maturity, and contribution, and encourages the community to keep active.</p>\n<p>On September 17, 2021, the first batch of members joined TWOS, including 25 full members such as openEuler, openGauss, MindSpore, openLookeng, etc., and 27 candidate members like Apache RocketMQ, Dcloud, Fluid, FastReID, etc., with a total of 52 members:</p>\n<div align=center>\n<img src=\"https://s1.imgpp.com/2022/01/10/1.png\"/>\n</div>\n<p>Only two communities were selected for the second batch of candidate members—Apache DolphinScheduler and PolarDB, an open-source cloud-native ecological distributed database contributed by Alibaba Cloud.</p>\n<p>The Apache DolphinScheduler community is very honored to be selected as a candidate member of TWOS, which is an affirmation and incentive for the entire industry to build the community a better place. The community will make persistent efforts and strive to become a full member as soon as possible., and provide more value for China's open-source ecological construction together, with all the TWOS members!</p>\n",
  "link": "/dist/en-us/blog/Twos.html",
  "meta": {
    "title": "Congratulations! Apache DolphinScheduler Has Been Approved As A TWOS Candidate Member",
    "keywords": "Apache,DolphinScheduler,scheduler,big data,ETL,airflow,hadoop,orchestration,dataops,TWOS",
    "description": "Recently, TWOS officially announced the approval of 6 full members and 3 candidate members,"
  }
}