{
  "__html": "<h1 id=\"project\">Project</h1>\n<p>This page describes details regarding Project screen in Apache DolphinScheduler. Here, you will see all the functions which can be handled in this screen. The following table explains commonly used terms in Apache DolphinScheduler:</p>\n<table>\n<thead>\n<tr>\n<th>Glossary</th>\n<th>description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>DAG</td>\n<td>Tasks in a workflow are assembled in form of Directed Acyclic Graph (DAG). A topological traversal is performed from nodes with zero degrees of entry until there are no subsequent nodes.</td>\n</tr>\n<tr>\n<td>Workflow Definition</td>\n<td>Visualization formed by dragging task nodes and establishing task node associations (DAG).</td>\n</tr>\n<tr>\n<td>Workflow Instance</td>\n<td>Instantiation of the workflow definition, which can be generated by manual start or scheduled scheduling. Each time the process definition runs, a workflow instance is generated.</td>\n</tr>\n<tr>\n<td>Workflow Relation</td>\n<td>Shows dynamic status of all the workflows in a project.</td>\n</tr>\n<tr>\n<td>Task</td>\n<td>Task is a discrete action in a Workflow. Apache DolphinScheduler supports SHELL, SQL, SUB_PROCESS (sub-process), PROCEDURE, MR, SPARK, PYTHON, DEPENDENT ( depends), and plans to support dynamic plug-in expansion, (SUB_PROCESS). It is also a separate process definition that can be started and executed separately.</td>\n</tr>\n<tr>\n<td>Task Instance</td>\n<td>Instantiation of the task node in the process definition, which identifies the specific task execution status.</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"project-list\">Project List</h2>\n<p>On the project screen, list of all the existing projects along with details like name, owner, workflow definition, process instance, create and update time. This page also facilitates operations like create, edit, and delete project.</p>\n<p><img src=\"/img/new_ui/dev/project/project-list.png\" alt=\"project-list\"></p>\n<h2 id=\"create-project\">Create Project</h2>\n<ul>\n<li>Click <code>Project Management</code> to enter the project management page, click the <code>Create Project</code> button, enter the project name, project description, and click &quot;Submit&quot; to create a new project.</li>\n</ul>\n<p><img src=\"/img/new_ui/dev/project/project-create.png\" alt=\"project-list\"></p>\n<h2 id=\"project-overview\">Project Overview</h2>\n<ul>\n<li>Click the project name link on the project management page to enter the project home page, as shown in the figure below, the project home page contains the task status statistics, process status statistics, and workflow definition statistics of the project. The introduction for those metrics:</li>\n<li>Task status statistics: Within the specified time range, count the number of task instances status as successful submission, running, ready to pause, pause, ready to stop, stop, failure, success, need fault tolerance, kill and waiting threads</li>\n<li>Process status statistics: Within the specified time range, count the number of workflow instances status as submission success, running, ready to pause, pause, ready to stop, stop, failure, success, need fault tolerance, kill and waiting threads</li>\n<li>Workflow definition statistics: Count the workflow definitions created by this user and granted by the administrator</li>\n</ul>\n<p><img src=\"/img/new_ui/dev/project/project-overview.png\" alt=\"project-overview\"></p>\n",
  "location": [
    "Introduction to Functions",
    "Project",
    "Project List"
  ],
  "time": "2023-05-25",
  "structure": [
    {
      "title": "Project List",
      "children": [],
      "anchor": "project-list"
    },
    {
      "title": "Create Project",
      "children": [],
      "anchor": "create-project"
    },
    {
      "title": "Project Overview",
      "children": [],
      "anchor": "project-overview"
    }
  ],
  "title": "Project",
  "link": "/guide/project/project-list"
}