{
  "filename": "system-manual.md",
  "__html": "<h1>System Use Manual</h1>\n<h2>Operational Guidelines</h2>\n<h3>Home page</h3>\n<p>The homepage contains task status statistics, process status statistics, and workflow definition statistics for all user projects.</p>\n<p align=\"center\">\n      <img src=\"/img/home_en.png\" width=\"80%\" />\n </p>\n<h3>Create a project</h3>\n<ul>\n<li>Click &quot;Project - &gt; Create Project&quot;, enter project name,  description, and click &quot;Submit&quot; to create a new project.</li>\n<li>Click on the project name to enter the project home page.</li>\n</ul>\n<p align=\"center\">\n      <img src=\"/img/project_home_en.png\" width=\"80%\" />\n </p>\n<blockquote>\n<p>The project home page contains task status statistics, process status statistics, and workflow definition statistics for the project.</p>\n</blockquote>\n<ul>\n<li>Task State Statistics: It refers to the statistics of the number of tasks to be run, failed, running, completed and succeeded in a given time frame.</li>\n<li>Process State Statistics: It refers to the statistics of the number of waiting, failing, running, completing and succeeding process instances in a specified time range.</li>\n<li>Process Definition Statistics: The process definition created by the user and the process definition granted by the administrator to the user are counted.</li>\n</ul>\n<h3>Creating Process definitions</h3>\n<ul>\n<li>Go to the project home page, click &quot;Process definitions&quot; and enter the list page of process definition.</li>\n<li>Click &quot;Create process&quot; to create a new process definition.</li>\n<li>Drag the &quot;SHELL&quot; node to the canvas and add a shell task.</li>\n<li>Fill in the Node Name, Description, and Script fields.</li>\n<li>Selecting &quot;task priority&quot; will give priority to high-level tasks in the execution queue. Tasks with the same priority will be executed in the first-in-first-out order.</li>\n<li>Timeout alarm. Fill in &quot;Overtime Time&quot;. When the task execution time exceeds the overtime, it can alarm and fail over time.</li>\n<li>Fill in &quot;Custom Parameters&quot; and refer to <a href=\"#CustomParameters\">Custom Parameters</a> <!-- markdown-link-check-disable-line --><p align=\"center\">\n<img src=\"/img/process_definitions_en.png\" width=\"80%\" />\n  </p>\n</li>\n<li>Increase the order of execution between nodes: click &quot;line connection&quot;. As shown, task 2 and task 3 are executed in parallel. When task 1 is executed, task 2 and task 3 are executed simultaneously.</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/task_en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Delete dependencies: Click on the arrow icon to &quot;drag nodes and select items&quot;, select the connection line, click on the delete icon to delete dependencies between nodes.</li>\n</ul>\n<p align=\"center\">\n      <img src=\"/img/delete_dependencies_en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Click &quot;Save&quot;, enter the name of the process definition, the description of the process definition, and set the global parameters.</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/global_parameters_en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>For other types of nodes, refer to <a href=\"#TaskNodeType\">task node types and parameter settings</a> <!-- markdown-link-check-disable-line --></li>\n</ul>\n<h3>Execution process definition</h3>\n<ul>\n<li><strong>The process definition of the off-line state can be edited, but not run</strong>, so the on-line workflow is the first step.</li>\n</ul>\n<blockquote>\n<p>Click on the Process definition, return to the list of process definitions, click on the icon &quot;online&quot;, online process definition.</p>\n</blockquote>\n<blockquote>\n<p>Before setting workflow offline, the timed tasks in timed management should be offline, so that the definition of workflow can be set offline successfully.</p>\n</blockquote>\n<ul>\n<li>Click &quot;Run&quot; to execute the process. Description of operation parameters：\n<ul>\n<li>Failure strategy：<strong>When a task node fails to execute, other parallel task nodes need to execute the strategy</strong>。”Continue &quot;Representation: Other task nodes perform normally&quot;, &quot;End&quot; Representation: Terminate all ongoing tasks and terminate the entire process.</li>\n<li>Notification strategy：When the process is over, send process execution information notification mail according to the process status.</li>\n<li>Process priority: The priority of process running is divided into five levels:the highest, the high, the medium, the low, and the lowest . High-level processes are executed first in the execution queue, and processes with the same priority are executed first in first out order.</li>\n<li>Worker group: This process can only be executed in a specified machine group. Default, by default, can be executed on any worker.</li>\n<li>Notification group: When the process ends or fault tolerance occurs, process information is sent to all members of the notification group by mail.</li>\n<li>Recipient: Enter the mailbox and press Enter key to save. When the process ends and fault tolerance occurs, an alert message is sent to the recipient list.</li>\n<li>Cc: Enter the mailbox and press Enter key to save. When the process is over and fault-tolerant occurs, alarm messages are copied to the copier list.</li>\n</ul>\n</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/start-process-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Complement: To implement the workflow definition of a specified date, you can select the time range of the complement (currently only support for continuous days), such as the data from May 1 to May 10, as shown in the figure:</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/complement-en.png\" width=\"80%\" />\n </p>\n<blockquote>\n<p>Complement execution mode includes serial execution and parallel execution. In serial mode, the complement will be executed sequentially from May 1 to May 10. In parallel mode, the tasks from May 1 to May 10 will be executed simultaneously.</p>\n</blockquote>\n<h3>Timing Process Definition</h3>\n<ul>\n<li>Create Timing: &quot;Process Definition - &gt; Timing&quot;</li>\n<li>Choose start-stop time, in the start-stop time range, regular normal work, beyond the scope, will not continue to produce timed workflow instances.</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/timing-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Add a timer to be executed once a day at 5:00 a.m. as shown below:</li>\n</ul>\n<p align=\"center\">\n      <img src=\"/img/timer-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Timely online，<strong>the newly created timer is offline. You need to click &quot;Timing Management - &gt;online&quot; to work properly.</strong></li>\n</ul>\n<h3>View process instances</h3>\n<blockquote>\n<p>Click on &quot;Process Instances&quot; to view the list of process instances.</p>\n</blockquote>\n<blockquote>\n<p>Click on the process name to see the status of task execution.</p>\n</blockquote>\n  <p align=\"center\">\n   <img src=\"/img/process-instances-en.png\" width=\"80%\" />\n </p>\n<blockquote>\n<p>Click on the task node, click &quot;View Log&quot; to view the task execution log.</p>\n</blockquote>\n  <p align=\"center\">\n   <img src=\"/img/view-log-en.png\" width=\"80%\" />\n </p>\n<blockquote>\n<p>Click on the task instance node, click <strong>View History</strong> to view the list of task instances that the process instance runs.</p>\n</blockquote>\n <p align=\"center\">\n    <img src=\"/img/instance-runs-en.png\" width=\"80%\" />\n  </p>\n<blockquote>\n<p>Operations on workflow instances:</p>\n</blockquote>\n<p align=\"center\">\n   <img src=\"/img/workflow-instances-en.png\" width=\"80%\" />\n</p>\n<ul>\n<li>Editor: You can edit the terminated process. When you save it after editing, you can choose whether to update the process definition or not.</li>\n<li>Rerun: A process that has been terminated can be re-executed.</li>\n<li>Recovery failure: For a failed process, a recovery failure operation can be performed, starting at the failed node.</li>\n<li>Stop: Stop the running process, the background will <code>kill</code> he worker process first, then <code>kill -9</code> operation.</li>\n<li>Pause：The running process can be <strong>suspended</strong>, the system state becomes <strong>waiting to be executed</strong>, waiting for the end of the task being executed, and suspending the next task to be executed.</li>\n<li>Restore pause: <strong>The suspended process</strong> can be restored and run directly from the suspended node</li>\n<li>Delete: Delete process instances and task instances under process instances</li>\n<li>Gantt diagram: The vertical axis of Gantt diagram is the topological ordering of task instances under a process instance, and the horizontal axis is the running time of task instances, as shown in the figure:</li>\n</ul>\n<p align=\"center\">\n      <img src=\"/img/gantt-en.png\" width=\"80%\" />\n</p>\n<h3>View task instances</h3>\n<blockquote>\n<p>Click on &quot;Task Instance&quot; to enter the Task List page and query the performance of the task.</p>\n</blockquote>\n<p align=\"center\">\n   <img src=\"/img/task-instances-en.png\" width=\"80%\" />\n</p>\n<blockquote>\n<p>Click &quot;View Log&quot; in the action column to view the log of task execution.</p>\n</blockquote>\n<p align=\"center\">\n   <img src=\"/img/task-execution-en.png\" width=\"80%\" />\n</p>\n<h3>Create data source</h3>\n<blockquote>\n<p>Data Source Center supports MySQL, POSTGRESQL, HIVE and Spark data sources.</p>\n</blockquote>\n<h4>Create and edit MySQL data source</h4>\n<ul>\n<li>Click on &quot;Datasource - &gt; Create Datasources&quot; to create different types of datasources according to requirements.</li>\n<li>Datasource: Select MYSQL</li>\n<li>Datasource Name: Name of Input Datasource</li>\n<li>Description: Description of input datasources</li>\n<li>IP: Enter the IP to connect to MySQL</li>\n<li>Port: Enter the port to connect MySQL</li>\n<li>User name: Set the username to connect to MySQL</li>\n<li>Password: Set the password to connect to MySQL</li>\n<li>Database name: Enter the name of the database connecting MySQL</li>\n<li>Jdbc connection parameters: parameter settings for MySQL connections, filled in as JSON</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/mysql-en.png\" width=\"80%\" />\n </p>\n<blockquote>\n<p>Click &quot;Test Connect&quot; to test whether the data source can be successfully connected.</p>\n</blockquote>\n<h4>Create and edit POSTGRESQL data source</h4>\n<ul>\n<li>Datasource: Select POSTGRESQL</li>\n<li>Datasource Name: Name of Input Data Source</li>\n<li>Description: Description of input data sources</li>\n<li>IP: Enter IP to connect to POSTGRESQL</li>\n<li>Port: Input port to connect POSTGRESQL</li>\n<li>Username: Set the username to connect to POSTGRESQL</li>\n<li>Password: Set the password to connect to POSTGRESQL</li>\n<li>Database name: Enter the name of the database connecting to POSTGRESQL</li>\n<li>Jdbc connection parameters: parameter settings for POSTGRESQL connections, filled in as JSON</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/create-datasource-en.png\" width=\"80%\" />\n </p>\n<h4>Create and edit HIVE data source</h4>\n<p>1.Connect with HiveServer 2</p>\n <p align=\"center\">\n    <img src=\"/img/hive-en.png\" width=\"80%\" />\n  </p>\n<ul>\n<li>Datasource: Select HIVE</li>\n<li>Datasource Name: Name of Input Datasource</li>\n<li>Description: Description of input datasources</li>\n<li>IP: Enter IP to connect to HIVE</li>\n<li>Port: Input port to connect to HIVE</li>\n<li>Username: Set the username to connect to HIVE</li>\n<li>Password: Set the password to connect to HIVE</li>\n<li>Database Name: Enter the name of the database connecting to HIVE</li>\n<li>Jdbc connection parameters: parameter settings for HIVE connections, filled in in as JSON</li>\n</ul>\n<p>2.Connect using Hive Server 2 HA Zookeeper mode</p>\n <p align=\"center\">\n    <img src=\"/img/zookeeper-en.png\" width=\"80%\" />\n  </p>\n<p>Note: If <strong>kerberos</strong> is turned on, you need to fill in <strong>Principal</strong></p>\n<p align=\"center\">\n    <img src=\"/img/principal-en.png\" width=\"80%\" />\n  </p>\n<h4>Create and Edit Spark Datasource</h4>\n<p align=\"center\">\n   <img src=\"/img/edit-datasource-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Datasource: Select Spark</li>\n<li>Datasource Name: Name of Input Datasource</li>\n<li>Description: Description of input datasources</li>\n<li>IP: Enter the IP to connect to Spark</li>\n<li>Port: Input port to connect Spark</li>\n<li>Username: Set the username to connect to Spark</li>\n<li>Password: Set the password to connect to Spark</li>\n<li>Database name: Enter the name of the database connecting to Spark</li>\n<li>Jdbc Connection Parameters: Parameter settings for Spark Connections, filled in as JSON</li>\n</ul>\n<p>Note: If <strong>kerberos</strong> If Kerberos is turned on, you need to fill in  <strong>Principal</strong></p>\n<p align=\"center\">\n    <img src=\"/img/kerberos-en.png\" width=\"80%\" />\n  </p>\n<h3>Upload Resources</h3>\n<ul>\n<li>Upload resource files and udf functions, all uploaded files and resources will be stored on hdfs, so the following configuration items are required:</li>\n</ul>\n<pre><code>conf/common/common.properties  \n    # Users who have permission to create directories under the HDFS root path\n    hdfs.root.user=hdfs\n    # data base dir, resource file will store to this hadoop hdfs path, self configuration, please make sure the directory exists on hdfs and have read write permissions。&quot;/escheduler&quot; is recommended\n    data.store2hdfs.basepath=/dolphinscheduler\n    # resource upload startup type : HDFS,S3,NONE\n    res.upload.startup.type=HDFS\n    # whether kerberos starts\n    hadoop.security.authentication.startup.state=false\n    # java.security.krb5.conf path\n    java.security.krb5.conf.path=/opt/krb5.conf\n    # loginUserFromKeytab user\n    login.user.keytab.username=hdfs-mycluster@ESZ.COM\n    # loginUserFromKeytab path\n    login.user.keytab.path=/opt/hdfs.headless.keytab\n    \nconf/common/hadoop.properties      \n    # ha or single namenode,If namenode ha needs to copy core-site.xml and hdfs-site.xml\n    # to the conf directory，support s3，for example : s3a://dolphinscheduler\n    fs.defaultFS=hdfs://mycluster:8020    \n    #resourcemanager ha note this need ips , this empty if single\n    yarn.resourcemanager.ha.rm.ids=192.168.xx.xx,192.168.xx.xx    \n    # If it is a single resourcemanager, you only need to configure one host name. If it is resourcemanager HA, the default configuration is fine\n    yarn.application.status.address=http://xxxx:8088/ws/v1/cluster/apps/%s\n\n</code></pre>\n<ul>\n<li>yarn.resourcemanager.ha.rm.ids and yarn.application.status.address only need to configure one address, and the other address is empty.</li>\n<li>You need to copy core-site.xml and hdfs-site.xml from the conf directory of the Hadoop cluster to the conf directory of the dolphinscheduler project and restart the api-server service.</li>\n</ul>\n<h4>File Manage</h4>\n<blockquote>\n<p>It is the management of various resource files, including creating basic txt/log/sh/conf files, uploading jar packages and other types of files, editing, downloading, deleting and other operations.</p>\n<p align=\"center\">\n <img src=\"/img/file-manage-en.png\" width=\"80%\" />\n</p>\n</blockquote>\n<ul>\n<li>Create file</li>\n</ul>\n<blockquote>\n<p>File formats support the following types：txt、log、sh、conf、cfg、py、java、sql、xml、hql</p>\n</blockquote>\n<p align=\"center\">\n   <img src=\"/img/create-file.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Upload Files</li>\n</ul>\n<blockquote>\n<p>Upload Files: Click the Upload button to upload, drag the file to the upload area, and the file name will automatically complete the uploaded file name.</p>\n</blockquote>\n<p align=\"center\">\n   <img src=\"/img/file-upload-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>File View</li>\n</ul>\n<blockquote>\n<p>For viewable file types, click on the file name to view file details</p>\n</blockquote>\n<p align=\"center\">\n   <img src=\"/img/file-view-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Download files</li>\n</ul>\n<blockquote>\n<p>You can download a file by clicking the download button in the top right corner of the file details, or by downloading the file under the download button after the file list.</p>\n</blockquote>\n<ul>\n<li>File rename</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/rename-en.png\" width=\"80%\" />\n </p>\n<h4>Delete</h4>\n<blockquote>\n<p>File List - &gt; Click the Delete button to delete the specified file</p>\n</blockquote>\n<h4>Resource management</h4>\n<blockquote>\n<p>Resource management and file management functions are similar. The difference is that resource management is the UDF function of uploading, and file management uploads user programs, scripts and configuration files.</p>\n</blockquote>\n<ul>\n<li>Upload UDF resources</li>\n</ul>\n<blockquote>\n<p>The same as uploading files.</p>\n</blockquote>\n<h4>Function management</h4>\n<ul>\n<li>Create UDF Functions</li>\n</ul>\n<blockquote>\n<p>Click &quot;Create UDF Function&quot;, enter parameters of udf function, select UDF resources, and click &quot;Submit&quot; to create udf function.</p>\n<p>Currently only temporary udf functions for HIVE are supported</p>\n<ul>\n<li>UDF function name: name when entering UDF Function</li>\n<li>Package Name: Full Path of Input UDF Function</li>\n<li>Parameter: Input parameters used to annotate functions</li>\n<li>Database Name: Reserved Field for Creating Permanent UDF Functions</li>\n<li>UDF Resources: Set up the resource files corresponding to the created UDF</li>\n</ul>\n</blockquote>\n<p align=\"center\">\n   <img src=\"/img/udf-function.png\" width=\"80%\" />\n </p>\n<h2>Security</h2>\n<ul>\n<li>The security has the functions of queue management, tenant management, user management, warning group management, worker group manager, token manage and other functions. It can also authorize resources, data sources, projects, etc.</li>\n<li>Administrator login, default username password: admin/dolphinscheduler123</li>\n</ul>\n<h3>Create queues</h3>\n<ul>\n<li>Queues are used to execute spark, mapreduce and other programs, which require the use of &quot;queue&quot; parameters.</li>\n<li>&quot;Security&quot; - &gt; &quot;Queue Manage&quot; - &gt; &quot;Create Queue&quot;   <p align=\"center\">\n  <img src=\"/img/create-queue-en.png\" width=\"80%\" />\n</p>\n</li>\n</ul>\n<h3>Create Tenants</h3>\n<ul>\n<li>The tenant corresponds to the account of Linux, which is used by the worker server to submit jobs. If Linux does not have this user, the worker would create the account when executing the task.</li>\n<li>Tenant Code：<strong>the tenant code is the only account on Linux that can't be duplicated.</strong></li>\n</ul>\n <p align=\"center\">\n    <img src=\"/img/create-tenant-en.png\" width=\"80%\" />\n  </p>\n<h3>Create Ordinary Users</h3>\n<ul>\n<li>User types are <strong>ordinary users</strong> and <strong>administrator users</strong>..</li>\n</ul>\n<pre><code>* Administrators have **authorization and user management** privileges, and no privileges to **create project and process-defined operations**.\n* Ordinary users can **create projects and create, edit, and execute process definitions**.\n* Note: **If the user switches the tenant, all resources under the tenant will be copied to the switched new tenant.**\n</code></pre>\n<p align=\"center\">\n      <img src=\"/img/create-user-en.png\" width=\"80%\" />\n </p>\n<h3>Create alarm group</h3>\n<ul>\n<li>The alarm group is a parameter set at start-up. After the process is finished, the status of the process and other information will be sent to the alarm group by mail.</li>\n<li>New and Editorial Warning Group<p align=\"center\">\n<img src=\"/img/alarm-group-en.png\" width=\"80%\" />\n</p>\n</li>\n</ul>\n<h3>Create Worker Group</h3>\n<ul>\n<li>\n<p>Worker group provides a mechanism for tasks to run on a specified worker. Administrators create worker groups, which can be specified in task nodes and operation parameters. If the specified grouping is deleted or no grouping is specified, the task will run on any worker.</p>\n</li>\n<li>\n<p>Multiple IP addresses within a worker group (<strong>aliases can not be written</strong>), separated by <strong>commas in English</strong></p>\n<p align=\"center\">\n  <img src=\"/img/worker-group-en.png\" width=\"80%\" />\n</p>\n</li>\n</ul>\n<h3>Token manage</h3>\n<ul>\n<li>Because the back-end interface has login check and token management, it provides a way to operate the system by calling the interface.<p align=\"center\">\n  <img src=\"/img/token-en.png\" width=\"80%\" />\n</p>\n</li>\n<li>Call examples:</li>\n</ul>\n<pre><code class=\"language-令牌调用示例\">    /**\n     * test token\n     */\n    public  void doPOSTParam()throws Exception{\n        // create HttpClient\n        CloseableHttpClient httpclient = HttpClients.createDefault();\n\n        // create http post request\n        HttpPost httpPost = new HttpPost(&quot;http://127.0.0.1:12345/dolphinscheduler/projects/create&quot;);\n        httpPost.setHeader(&quot;token&quot;, &quot;123&quot;);\n        // set parameters\n        List&lt;NameValuePair&gt; parameters = new ArrayList&lt;NameValuePair&gt;();\n        parameters.add(new BasicNameValuePair(&quot;projectName&quot;, &quot;qzw&quot;));\n        parameters.add(new BasicNameValuePair(&quot;desc&quot;, &quot;qzw&quot;));\n        UrlEncodedFormEntity formEntity = new UrlEncodedFormEntity(parameters);\n        httpPost.setEntity(formEntity);\n        CloseableHttpResponse response = null;\n        try {\n            // execute\n            response = httpclient.execute(httpPost);\n            // response status code 200\n            if (response.getStatusLine().getStatusCode() == 200) {\n                String content = EntityUtils.toString(response.getEntity(), &quot;UTF-8&quot;);\n                System.out.println(content);\n            }\n        } finally {\n            if (response != null) {\n                response.close();\n            }\n            httpclient.close();\n        }\n    }\n</code></pre>\n<h3>Grant authority</h3>\n<ul>\n<li>Granting permissions includes project permissions, resource permissions, datasource permissions, UDF Function permissions.</li>\n</ul>\n<blockquote>\n<p>Administrators can authorize projects, resources, data sources and UDF Functions that are not created by ordinary users. Because project, resource, data source and UDF Function are all authorized in the same way, the project authorization is introduced as an example.</p>\n</blockquote>\n<blockquote>\n<p>Note：For projects created by the user himself, the user has all the permissions. The list of items and the list of selected items will not be reflected</p>\n</blockquote>\n<ul>\n<li>1.Click on the authorization button of the designated person as follows:<p align=\"center\">\n  <img src=\"/img/operation-en.png\" width=\"80%\" />\n</li>\n</ul>\n </p>\n<ul>\n<li>2.Select the project button to authorize the project</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/auth-project-en.png\" width=\"80%\" />\n </p>\n<h3>Monitor center</h3>\n<ul>\n<li>Service management is mainly to monitor and display the health status and basic information of each service in the system.</li>\n</ul>\n<h4>Master monitor</h4>\n<ul>\n<li>Mainly related information about master.</li>\n</ul>\n<p align=\"center\">\n      <img src=\"/img/master-monitor-en.png\" width=\"80%\" />\n </p>\n<h4>Worker monitor</h4>\n<ul>\n<li>Mainly related information of worker.</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/worker-monitor-en.png\" width=\"80%\" />\n </p>\n<h4>Zookeeper monitor</h4>\n<ul>\n<li>Mainly the configuration information of each worker and master in zookpeeper.</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/zookeeper-monitor-en.png\" width=\"80%\" />\n </p>\n<h4>DB monitor</h4>\n<ul>\n<li>Mainly the health status of DB</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/db-monitor-en.png\" width=\"80%\" />\n </p>\n<h4>statistics Manage</h4>\n <p align=\"center\">\n   <img src=\"/img/statistics-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Commands to be executed: statistics on t_ds_command table</li>\n<li>Number of commands that failed to execute: statistics on the t_ds_error_command table</li>\n<li>Number of tasks to run: statistics of task_queue data in Zookeeper</li>\n<li>Number of tasks to be killed: statistics of task_kill in Zookeeper</li>\n</ul>\n<h2><span id=TaskNodeType>Task Node Type and Parameter Setting</span></h2>\n<h3>Shell</h3>\n<ul>\n<li>The shell node, when the worker executes, generates a temporary shell script, which is executed by a Linux user with the same name as the tenant.</li>\n</ul>\n<blockquote>\n<p>Drag the <img src=\"/img/tasks/icons/shell.png\" width=\"15\"/> task node in the toolbar onto the palette and double-click the task node as follows:</p>\n</blockquote>\n<p><img src=\"/img/tasks/demo/shell.jpg\" alt=\"demo-shell-simple\"></p>\n<ul>\n<li>Node name: The node name in a process definition is unique</li>\n<li>Run flag: Identify whether the node can be scheduled properly, and if it does not need to be executed, you can turn on the forbidden execution switch.</li>\n<li>Description : Describes the function of the node</li>\n<li>Number of failed retries: Number of failed task submissions, support drop-down and manual filling</li>\n<li>Failure Retry Interval: Interval between tasks that fail to resubmit tasks, support drop-down and manual filling</li>\n<li>Script: User-developed SHELL program</li>\n<li>Resources: A list of resource files that need to be invoked in a script</li>\n<li>Custom parameters: User-defined parameters that are part of SHELL replace the contents of scripts with ${variables}</li>\n</ul>\n<h3>SUB_PROCESS</h3>\n<ul>\n<li>The sub-process node is to execute an external workflow definition as an task node.</li>\n</ul>\n<blockquote>\n<p>Drag the <img src=\"https://analysys.github.io/easyscheduler_docs_cn/images/toolbar_SUB_PROCESS.png\" alt=\"PNG\"> task node in the toolbar onto the palette and double-click the task node as follows:</p>\n</blockquote>\n<p align=\"center\">\n   <img src=\"/img/sub-process-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Node name: The node name in a process definition is unique</li>\n<li>Run flag: Identify whether the node is scheduled properly</li>\n<li>Description: Describes the function of the node</li>\n<li>Sub-node: The process definition of the selected sub-process is selected, and the process definition of the selected sub-process can be jumped to by entering the sub-node in the upper right corner.</li>\n</ul>\n<h3>DEPENDENT</h3>\n<ul>\n<li>Dependent nodes are <strong>dependent checking nodes</strong>. For example, process A depends on the successful execution of process B yesterday, and the dependent node checks whether process B has a successful execution instance yesterday.</li>\n</ul>\n<blockquote>\n<p>Drag the <img src=\"https://analysys.github.io/easyscheduler_docs/images/toolbar_DEPENDENT.png\" alt=\"PNG\"> ask node in the toolbar onto the palette and double-click the task node as follows:</p>\n</blockquote>\n<p align=\"center\">\n   <img src=\"/img/current-node-en.png\" width=\"80%\" />\n </p>\n<blockquote>\n<p>Dependent nodes provide logical judgment functions, such as checking whether yesterday's B process was successful or whether the C process was successfully executed.</p>\n</blockquote>\n  <p align=\"center\">\n   <img src=\"/img/weekly-A-en.png\" width=\"80%\" />\n </p>\n<blockquote>\n<p>For example, process A is a weekly task and process B and C are daily tasks. Task A requires that task B and C be successfully executed every day of the last week, as shown in the figure:</p>\n</blockquote>\n <p align=\"center\">\n   <img src=\"/img/weekly-A1-en.png\" width=\"80%\" />\n </p>\n<blockquote>\n<p>If weekly A also needs to be implemented successfully on Tuesday:</p>\n</blockquote>\n <p align=\"center\">\n   <img src=\"/img/weekly-A2-en.png\" width=\"80%\" />\n </p>\n<h3>PROCEDURE</h3>\n<ul>\n<li>The procedure is executed according to the selected data source.</li>\n</ul>\n<blockquote>\n<p>Drag the <img src=\"https://analysys.github.io/easyscheduler_docs/images/toolbar_PROCEDURE.png\" alt=\"PNG\"> task node in the toolbar onto the palette and double-click the task node as follows:</p>\n</blockquote>\n<p align=\"center\">\n   <img src=\"/img/node-setting-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Datasource: The data source type of stored procedure supports MySQL and POSTGRESQL, and chooses the corresponding data source.</li>\n<li>Method: The method name of the stored procedure</li>\n<li>Custom parameters: Custom parameter types of stored procedures support IN and OUT, and data types support nine data types: VARCHAR, INTEGER, LONG, FLOAT, DOUBLE, DATE, TIME, TIMESTAMP and BOOLEAN.</li>\n</ul>\n<h3>SQL</h3>\n<ul>\n<li>Drag the <img src=\"https://analysys.github.io/easyscheduler_docs/images/toolbar_SQL.png\" alt=\"PNG\"> task node in the toolbar onto the palette.</li>\n<li>Execute non-query SQL functionality<p align=\"center\">\n  <img src=\"/img/dependent-nodes-en.png\" width=\"80%\" />\n</li>\n</ul>\n </p>\n<ul>\n<li>Executing the query SQL function, you can choose to send mail in the form of tables and attachments to the designated recipients.</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/double-click-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Datasource: Select the corresponding datasource</li>\n<li>sql type: support query and non-query, query is select type query, there is a result set returned, you can specify mail notification as table, attachment or table attachment three templates. Non-query is not returned by result set, and is for update, delete, insert three types of operations</li>\n<li>sql parameter: input parameter format is key1 = value1; key2 = value2...</li>\n<li>sql statement: SQL statement</li>\n<li>UDF function: For HIVE type data sources, you can refer to UDF functions created in the resource center, other types of data sources do not support UDF functions for the time being.</li>\n<li>Custom parameters: SQL task type, and stored procedure is to customize the order of parameters to set values for methods. Custom parameter type and data type are the same as stored procedure task type. The difference is that the custom parameter of the SQL task type replaces the ${variable} in the SQL statement.</li>\n<li>Pre Statement: Pre-sql is executed before the sql statement</li>\n<li>Post Statement: Post-sql is executed after the sql statement</li>\n</ul>\n<h3>SPARK</h3>\n<ul>\n<li>Through SPARK node, SPARK program can be directly executed. For spark node, worker will use <code>spark-submit</code> mode to submit tasks.</li>\n</ul>\n<blockquote>\n<p>Drag the   <img src=\"https://analysys.github.io/easyscheduler_docs/images/toolbar_SPARK.png\" alt=\"PNG\">  task node in the toolbar onto the palette and double-click the task node as follows:</p>\n</blockquote>\n<p align=\"center\">\n   <img src=\"/img/spark-submit-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Program Type: Support JAVA, Scala and Python</li>\n<li>Class of the main function: The full path of Main Class, the entry to the Spark program</li>\n<li>Master jar package: It's Spark's jar package</li>\n<li>Deployment: support three modes: yarn-cluster, yarn-client, and local</li>\n<li>Driver Kernel Number: Driver Kernel Number and Memory Number can be set</li>\n<li>Executor Number: Executor Number, Executor Memory Number and Executor Kernel Number can be set</li>\n<li>Command Line Parameters: Setting the input parameters of Spark program to support the replacement of custom parameter variables.</li>\n<li>Other parameters: support - jars, - files, - archives, - conf format</li>\n<li>Resource: If a resource file is referenced in other parameters, you need to select the specified resource.</li>\n<li>Custom parameters: User-defined parameters in MR locality that replace the contents in scripts with ${variables}</li>\n</ul>\n<p>Note: JAVA and Scala are just used for identification, no difference. If it's a Spark developed by Python, there's no class of the main function, and everything else is the same.</p>\n<h3>MapReduce(MR)</h3>\n<ul>\n<li>Using MR nodes, MR programs can be executed directly. For Mr nodes, worker submits tasks using <code>hadoop jar</code></li>\n</ul>\n<blockquote>\n<p>Drag the <img src=\"https://analysys.github.io/easyscheduler_docs/images/toolbar_MR.png\" alt=\"PNG\"> task node in the toolbar onto the palette and double-click the task node as follows:</p>\n</blockquote>\n<ol>\n<li>JAVA program</li>\n</ol>\n <p align=\"center\">\n    <img src=\"/img/java-program-en.png\" width=\"80%\" />\n  </p>\n<ul>\n<li>Class of the main function: The full path of the MR program's entry Main Class</li>\n<li>Program Type: Select JAVA Language</li>\n<li>Master jar package: MR jar package</li>\n<li>Command Line Parameters: Setting the input parameters of MR program to support the replacement of custom parameter variables</li>\n<li>Other parameters: support - D, - files, - libjars, - archives format</li>\n<li>Resource: If a resource file is referenced in other parameters, you need to select the specified resource.</li>\n<li>Custom parameters: User-defined parameters in MR locality that replace the contents in scripts with ${variables}</li>\n</ul>\n<ol start=\"2\">\n<li>Python program</li>\n</ol>\n<p align=\"center\">\n   <img src=\"/img/python-program-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Program Type: Select Python Language</li>\n<li>Main jar package: Python jar package running MR</li>\n<li>Other parameters: support - D, - mapper, - reducer, - input - output format, where user-defined parameters can be set, such as:</li>\n<li>mapper &quot;<a href=\"http://mapper.py\">mapper.py</a> 1&quot; - file mapper.py-reducer reducer.py-file reducer.py-input/journey/words.txt-output/journey/out/mr/${current TimeMillis}</li>\n<li>Among them, mapper. py 1 after - mapper is two parameters, the first parameter is mapper. py, and the second parameter is 1.</li>\n<li>Resource: If a resource file is referenced in other parameters, you need to select the specified resource.</li>\n<li>Custom parameters: User-defined parameters in MR locality that replace the contents in scripts with ${variables}</li>\n</ul>\n<h3>Python</h3>\n<ul>\n<li>With Python nodes, Python scripts can be executed directly. For Python nodes, worker will use <code>python **</code>to submit tasks.</li>\n</ul>\n<blockquote>\n<p>Drag the <img src=\"https://analysys.github.io/easyscheduler_docs/images/toolbar_PYTHON.png\" alt=\"PNG\"> task node in the toolbar onto the palette and double-click the task node as follows:</p>\n</blockquote>\n<p align=\"center\">\n   <img src=\"/img/python-en1-2.png\" width=\"80%\" />\n </p>\n<ul>\n<li>Script: User-developed Python program</li>\n<li>Resource: A list of resource files that need to be invoked in a script</li>\n<li>Custom parameters: User-defined parameters that are part of Python that replace the contents in the script with ${variables}</li>\n</ul>\n<h3>System parameter</h3>\n<table>\n    <tr><th>variable</th><th>meaning</th></tr>\n    <tr>\n        <td>${system.biz.date}</td>\n        <td>The timing time of routine dispatching instance is one day before, in yyyyyMMdd format. When data is supplemented, the date + 1</td>\n    </tr>\n    <tr>\n        <td>${system.biz.curdate}</td>\n        <td> Daily scheduling example timing time, format is yyyyyMMdd, when supplementing data, the date + 1</td>\n    </tr>\n    <tr>\n        <td>${system.datetime}</td>\n        <td>Daily scheduling example timing time, format is yyyyyMMddHmmss, when supplementing data, the date + 1</td>\n    </tr>\n</table>\n<h3>Time Customization Parameters</h3>\n<ul>\n<li>\n<p>Support code to customize the variable name, declaration: ${variable name}. It can refer to &quot;system parameters&quot; or specify &quot;constants&quot;.</p>\n</li>\n<li>\n<p>When we define this benchmark variable as [...]， [yyyyMMddHHmmss] can be decomposed and combined arbitrarily, such as:[yyyyMMdd], $[HHmmss], $[yyyy-MM-dd] ,etc.</p>\n</li>\n<li>\n<p>Can also do this：</p>\n<ul>\n<li>Later N years: $[add_months (yyyyyyMMdd, 12*N)]</li>\n<li>The previous N years: $[add_months (yyyyyyMMdd, -12*N)]</li>\n<li>Later N months: $[add_months (yyyyyMMdd, N)]</li>\n<li>The first N months: $[add_months (yyyyyyMMdd, -N)]</li>\n<li>Later N weeks: $[yyyyyyMMdd + 7*N]</li>\n<li>The first N weeks: $[yyyyyMMdd-7*N]</li>\n<li>The day after that: $[yyyyyyMMdd + N]</li>\n<li>The day before yesterday: $[yyyyyMMdd-N]</li>\n<li>Later N hours: $[HHmmss + N/24]</li>\n<li>First N hours: $[HHmmss-N/24]</li>\n<li>After N minutes: $[HHmmss + N/24/60]</li>\n<li>First N minutes: $[HHmmss-N/24/60]</li>\n</ul>\n</li>\n</ul>\n<h3><span id=CustomParameters>User-defined parameters</span></h3>\n<ul>\n<li>User-defined parameters are divided into global parameters and local parameters. Global parameters are the global parameters passed when the process definition and process instance are saved. Global parameters can be referenced by local parameters of any task node in the whole process.</li>\n</ul>\n<p>For example:</p>\n<p align=\"center\">\n   <img src=\"/img/user-defined-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>global_bizdate is a global parameter, referring to system parameters.</li>\n</ul>\n<p align=\"center\">\n   <img src=\"/img/user-defined1-en.png\" width=\"80%\" />\n </p>\n<ul>\n<li>In tasks, local_param_bizdate refers to global parameters by  ${global_bizdate} for scripts, the value of variable local_param_bizdate can be referenced by ${local_param_bizdate}, or the value of local_param_bizdate can be set directly by JDBC.</li>\n</ul>\n",
  "link": "/dist/en-us/docs/1.2.0/user_doc/system-manual.html",
  "meta": {}
}