{
  "__html": "<h1 id=\"how-to-become-a-committer-of-apache-dolphinscheduler\">How to become a committer of Apache Dolphinscheduler</h1>\n<p>Dolphinscheduler Project Management Committee (PMC) is responsible for assessing the contributions of candidates.</p>\n<p>Like many Apache projects, Dolphinscheduler welcome all contributions, including code contributions, blog entries, guides for new users, public speeches, and enhancement of the project in various ways.</p>\n<p>Becoming a committer to get started contributing to Dolphinscheduler, learn how to contribute – anyone can submit patches, documentation and examples to the project.</p>\n<p>The PMC regularly adds new committers from the active contributors, based on their contributions to Dolphinscheduler. The qualifications for new committers include:</p>\n<p>Sustained contributions to Dolphinscheduler: Committers should have a history of major contributions to Dolphinscheduler. An ideal committer will have contributed broadly throughout the project, and have contributed at least one major component where they have taken an “ownership” role. An ownership role means that existing contributors feel that they should run patches for this component by this person.</p>\n<p>Quality of contributions: Committers more than any other community member should submit simple, well-tested, and well-designed patches. In addition, they should show sufficient expertise to be able to review patches, including making sure they fit within Dolphinscheduler’s engineering practices (testability, documentation, API stability, code style, etc). The committership is collectively responsible for the software quality and maintainability of Dolphinscheduler. Note that contributions to critical parts of Dolphinscheduler, like its core modules, will be held to a higher standard when assessing quality. Contributors to these areas will face more review of their changes.</p>\n<p>Community involvement: Committers should have a constructive and friendly attitude in all community interactions. They should also be active on the dev and user list and help mentor newer contributors and users. In design discussions, committers should maintain a professional and diplomatic approach, even in the face of disagreement.</p>\n<h2 id=\"nominate-new-committer\">Nominate new committer</h2>\n<p>In Dolphinscheduler, <strong>new committer nomination</strong> could only be officially started by existing PMC members. If a new committer feels that he/she is qualified, he/she should contact any existing PMC member and discuss. If this is agreed among some members of the PMC, the process will kick off.</p>\n<p>The following steps are recommended (to be initiated only by an existing PMC member):</p>\n<ol>\n<li>Send an email titled <code>[DISCUSS] Promote xxx as new committer</code> to <code>private@dolphinscheduler.apache.org</code>. List the important contributions of the candidate,\nso you could gather support from other PMC members for your proposal.</li>\n<li>Keep the discussion open for more than 3 days but no more than 1 week, unless there is any express objection or concern.</li>\n<li>If the PMC generally agrees to the proposal, send an email titled <code>[VOTE] Promote xxx as new committer</code> to <code>private@dolphinscheduler.apache.org</code>.</li>\n<li>Keep the voting process open for more than 3 days, but no more than 1 week. Consider the result as <code>Consensus Approval</code> if there are <code>3 + 1</code> votes with <code>NO</code> vetos. Please note that +1 votes &gt; -1 votes.</li>\n<li>Send an email titled <code>[RESULT][VOTE] Promote xxx as new committer</code> to <code>private@dolphinscheduler.apache.org</code>, and list the voting details, including who the voters are.</li>\n</ol>\n<h2 id=\"invite-new-committer\">Invite new committer</h2>\n<p>The PMC member who starts the promotion is responsible for sending an invitation to the new committer and guiding him/her to set up the ASF env.</p>\n<p>The PMC member should send an email using the following template to the new committer:</p>\n<pre><code>To: &lt;invitee name&gt;@gmail.com\nCc: private@dolphinscheduler.apache.org\nSubject: Invitation to become dolphinscheduler committer: &lt;invitee name&gt;\n\nHello &lt;invitee name&gt;,\n\nThe Dolphinscheduler Project Management Committee] (PMC) \nhereby offers you committer privileges to the project. These privileges are\noffered on the understanding that you'll use them\nreasonably and with common sense. We like to work on trust\nrather than unnecessary constraints.\n\nBeing a committer enables you to more easily make \nchanges without needing to go through the patch \nsubmission process. \n\nBeing a committer does not require you to \nparticipate any more than you already do. It does \ntend to make one even more committed.  You will \nprobably find that you spend more time here.\n\nOf course, you can decline and instead remain as a \ncontributor, participating as you do now.\n\nA. This personal invitation is a chance for you to \naccept or decline in private.  Either way, please \nlet us know in reply to the [private@dolphinscheduler.apache.org] \naddress only.\n\nB. If you accept, the next step is to register an iCLA:\n    1. Details of the iCLA and the forms are found \n    through this link: http://www.apache.org/licenses/#clas\n\n    2. Instructions for its completion and return to \n    the Secretary of the ASF are found at\n    http://www.apache.org/licenses/#submitting\n\n    3. When you transmit the completed iCLA, request \n    to notify the Apache Dolphinscheduler and choose a \n    unique Apache id. Look to see if your preferred \n    id is already taken at \n    http://people.apache.org/committer-index.html     \n    This will allow the Secretary to notify the PMC \n    when your iCLA has been recorded.\n\nWhen recording of your iCLA is noticed, you will \nreceive a follow-up message with the next steps for \nestablishing you as a committer.\n</code></pre>\n<h2 id=\"invitation-acceptance-process\">Invitation acceptance process</h2>\n<p>The new committer should reply to <code>private@dolphinscheduler.apache.org</code> (choose <code>reply all</code>), and express his/her intention to accept the invitation.\nThen, this invitation will be treated as accepted by the project's PMC. Of course, the new committer may also choose to decline the invitation.</p>\n<p>Once the invitation has been accepted, the new committer has to take the following steps:</p>\n<ol>\n<li>Subscribe to <code>dev@dolphinscheduler.apache.org</code>. Usually this is already done.</li>\n<li>Choose a Apache ID that is not on the <a href=\"http://people.apache.org/committer-index.html\">apache committers list page</a>.</li>\n<li>Download the <a href=\"https://www.apache.org/licenses/icla.pdf\">ICLA</a>  (If the new committer contributes to the project as a day job, <a href=\"http://www.apache.org/licenses/cla-corporate.pdf\">CCLA</a>  is expected).</li>\n<li>After filling in the <code>icla.pdf</code> (or <code>ccla.pdf</code>) with the correct information, print, sign it by hand,  scan it as an PDF, and send it as an attachment to <a href=\"mailto:secretary@apache.org\">secretary@apache.org</a>. (If electronic signature is preferred, please follow the steps on <a href=\"http://www.apache.org/licenses/contributor-agreements.html#submitting\">this page</a>)</li>\n<li>The PMC will wait for the Apache secretary to confirm the ICLA (or CCLA) filed. The new committer and PMC will receive the following email:</li>\n</ol>\n<pre><code>Dear XXX,\n\nThis message acknowledges receipt of your ICLA, which has been filed in the Apache Software Foundation records.\n\nYour account has been requested for you and you should receive email with next steps\nwithin the next few days (can take up to a week).\n\nPlease refer to https://www.apache.org/foundation/how-it-works.html#developers\nfor more information about roles at Apache.\n</code></pre>\n<p>In the unlikely event that the account has not yet been requested, the PMC member should contact the project V.P..\nThe V.P. could request through the <a href=\"https://whimsy.apache.org/officers/acreq\">Apache Account Submission Helper Form</a>.</p>\n<p>After several days, the new committer will receive an email confirming creation of the account, titled <code>Welcome to the Apache Software Foundation (ASF)!</code>.\nCongratulations! The new committer now has an official Apache ID.</p>\n<p>The PMC member should add the new committer to the official committer list through <a href=\"https://whimsy.apache.org/roster/pmc/dolphinscheduler\">roster</a>.</p>\n<h2 id=\"set-up-the-apache-id-and-dev-env\">Set up the Apache ID and dev env</h2>\n<ol>\n<li>Go to <a href=\"https://id.apache.org/\">Apache Account Utility Platform</a>, create your password, set up your personal mailbox (<code>Forwarding email address</code>) and GitHub account(<code>Your GitHub Username</code>). An organizational invite will be sent to you via email shortly thereafter (within 2 hours).</li>\n<li>If you would like to use the <code>xxx@apache.org</code> email service, please refer to <a href=\"https://infra.apache.org/committer-email.html\">here</a>. Gmail is recommended, because this forwarding mode is not easy to find in most mailbox service settings.</li>\n<li>Follow the <code>Authorized GitHub 2FA wiki</code> to enable two-factor authorization (2FA) on <a href=\"http://github.com/\">GitHub</a>. When you set 2FA to &quot;off&quot;, it will be delisted by the corresponding Apache committer write permission group until you set it up again. (<strong>NOTE: Treat your recovery codes with the same level of attention as you would your password!</strong>)</li>\n<li>Use <a href=\"https://gitbox.apache.org/setup/\">GitBox Account Linking Utility</a> to obtain write permission of the Dolphinscheduler project.</li>\n</ol>\n<p>If you would like to show up publicly in the Apache GitHub org, you need to go to the <a href=\"https://github.com/orgs/apache/people\">Apache GitHub org people page</a>,\nsearch for yourself, and choose <code>Organization visibility</code> to <code>Public</code>.</p>\n<h2 id=\"committer-rights,-duties,-and-responsibilities\">Committer rights, duties, and responsibilities</h2>\n<p>The Dolphinscheduler project doesn't require continuing contributions from you after you have become a committer, but we truly hope that you will continue to play a part in our community!</p>\n<p>As a committer, you could</p>\n<ol>\n<li>Review and merge the pull request to the master branch in the Apache repo. A pull request often contains multiple commits. Those commits <strong>must be squashed and merged</strong> into a single commit <strong>with explanatory comments</strong>. It is recommended for new committers to request recheck of the pull request from senior committers.</li>\n<li>Create and push codes to the new branch in the Apache repo.</li>\n<li>Prepare a new release. Remember to confirm with the committer team before you prepare, because that it is the right time to create the release.</li>\n</ol>\n<p>The PMC hopes that the new committer will take part in the release process as well as release voting, even though their vote will be regarded as <code>+1 no binding</code>.\nBeing familiar with the release process is key to being promoted to the role of PMC member.</p>\n<h2 id=\"project-management-committee\">Project Management Committee</h2>\n<p>The Project Management Committee (PMC) member does not have any special rights in code contributions.\nThey simply oversee the project and make sure that it follows the Apache requirements. Its functions include:</p>\n<ol>\n<li>Binding voting for releases and license checks;</li>\n<li>New committer and PMC member recognition;</li>\n<li>Identification of branding issues and brand protection; and</li>\n<li>Responding to the questions raised by the ASF board, and taking necessary actions.</li>\n</ol>\n<p>The V.P. and chair of the PMC is the secretary, who is responsible for initializing the board report.</p>\n<p>In most cases, a new PMC member is nominated from the committer team. But it is also possible to become a PMC member directly, so long as the PMC agrees to the nomination and is confident that the candidate is ready. For instance, this can be demonstrated by the fact that he/she has been an Apache member, an Apache officer, or a PMC member of another project.</p>\n<p>The new PMC voting process should also follow the <code>[DISCUSS]</code>, <code>[VOTE]</code> and <code>[RESULT][VOTE]</code> procedures using a private mail list, just like the voting process for new committers.\nBefore sending the invitation, the PMC must also send a NOTICE mail to the Apache board.</p>\n<pre><code>To: board@apache.org\nCc: private@dolphinscheduler.apache.org\nSubject: [NOTICE] Jane Doe for Dolphinscheduler PMC\n\nDolphinscheduler proposes to invite Jane Doe (janedoe) to join the PMC.\n\n(include if a vote was held) The vote result is available here: https://lists.apache.org/...\n</code></pre>\n<p>After 72 hours, if the board doesn't object to the nomination (which it won't most cases), an invitation may then be sent to the candidate.</p>\n<p>Once the invitation is accepted, a PMC member should add the new member to the official PMC list through <a href=\"https://whimsy.apache.org/roster/pmc/dolphinscheduler\">roster</a>.</p>\n",
  "location": [
    "Contribution",
    "Join",
    "How to Become a Committer"
  ],
  "time": "2025-8-24",
  "structure": [
    {
      "title": "Nominate new committer",
      "children": [],
      "anchor": "nominate-new-committer"
    },
    {
      "title": "Invite new committer",
      "children": [],
      "anchor": "invite-new-committer"
    },
    {
      "title": "Invitation acceptance process",
      "children": [],
      "anchor": "invitation-acceptance-process"
    },
    {
      "title": "Set up the Apache ID and dev env",
      "children": [],
      "anchor": "set-up-the-apache-id-and-dev-env"
    },
    {
      "title": "Committer rights, duties, and responsibilities",
      "children": [],
      "anchor": "committer-rights,-duties,-and-responsibilities"
    },
    {
      "title": "Project Management Committee",
      "children": [],
      "anchor": "project-management-committee"
    }
  ],
  "title": "How to become a committer of Apache Dolphinscheduler",
  "link": "/contribute/join/become-a-committer"
}