{
  "filename": "global-parameter.md",
  "__html": "<h1>Global Parameter development document</h1>\n<p>After the user defines the parameter with the direction OUT, it is saved in the localParam of the task.</p>\n<h2>Usage of parameters</h2>\n<p>Getting the direct predecessor node <code>preTasks</code> of the current <code>taskInstance</code> to be created from the DAG, get the <code>varPool</code> of <code>preTasks</code>, merge this varPool (List) into one <code>varPool</code>, and in the merging process, if parameters with the same parameter name are found, they will be handled according to the following logics:</p>\n<ul>\n<li>If all the values are null, the merged value is null</li>\n<li>If one and only one value is non-null, then the merged value is the non-null value</li>\n<li>If all the values are not null, it would be the earliest value of the endtime of taskInstance taken by VarPool.</li>\n</ul>\n<p>The direction of all the merged properties is updated to IN during the merge process.</p>\n<p>The result of the merge is saved in taskInstance.varPool.</p>\n<p>The worker receives and parses the varPool into the format of <code>Map&lt;String,Property&gt;</code>, where the key of the map is property.prop, which is the parameter name.</p>\n<p>When the processor processes the parameters, it will merge the varPool and localParam and globalParam parameters, and if there are parameters with duplicate names during the merging process, they will be replaced according to the following priorities, with the higher priority being retained and the lower priority being replaced:</p>\n<ul>\n<li>globalParam: high</li>\n<li>varPool: middle</li>\n<li>localParam: low</li>\n</ul>\n<p>The parameters are replaced with the corresponding values using regular expressions compared to ${parameter name} before the node content is executed.</p>\n<h2>Parameter setting</h2>\n<p>Currently, only SQL and SHELL nodes are supported to get parameters.</p>\n<p>Get the parameter with direction OUT from localParam, and do the following way according to the type of different nodes.</p>\n<h3>SQL node</h3>\n<p>The structure returned by the parameter is List&lt;Map&lt;String,String&gt;&gt;, where the elements of List are each row of data, the key of Map is the column name, and the value is the value corresponding to the column.</p>\n<ul>\n<li>If the SQL statement returns one row of data, match the OUT parameter name based on the OUT parameter name defined by the user when defining the task, or discard it if it does not match.</li>\n<li>If the SQL statement returns multiple rows of data, the column names are matched based on the OUT parameter names defined by the user when defining the task of type LIST. All rows of the corresponding column are converted to <code>List&lt;String&gt;</code> as the value of this parameter. If there is no match, it is discarded.</li>\n</ul>\n<h3>SHELL node</h3>\n<p>The result of the processor execution is returned as <code>Map&lt;String,String&gt;</code>.</p>\n<p>The user needs to define <code>${setValue(key=value)}</code> in the output when defining the shell script.</p>\n<p>Remove <code>${setValue()}</code> when processing parameters, split by &quot;=&quot;, with the 0th being the key and the 1st being the value.</p>\n<p>Similarly match the OUT parameter name and key defined by the user when defining the task, and use value as the value of that parameter.</p>\n<p>Return parameter processing</p>\n<ul>\n<li>The result of acquired Processor is String.</li>\n<li>Determine whether the processor is empty or not, and exit if it is empty.</li>\n<li>Determine whether the localParam is empty or not, and exit if it is empty.</li>\n<li>Get the parameter of localParam which is OUT, and exit if it is empty.</li>\n<li>Format String as per appeal format (<code>List&lt;Map&lt;String,String&gt;&gt;</code> for SQL, <code>Map&lt;String,String&gt;&gt;</code> for shell).</li>\n</ul>\n<p>Assign the parameters with matching values to varPool (List, which contains the original IN's parameters)</p>\n<ul>\n<li>Format the varPool as json and pass it to master.</li>\n<li>The parameters that are OUT would be written into the localParam after the master has received the varPool.</li>\n</ul>\n",
  "link": "/dist/en-us/development/backend/mechanism/global-parameter.html",
  "meta": {}
}