{
  "filename": "conditions.md",
  "__html": "<h1>Conditions</h1>\n<p>Condition is a conditional node, that determines which downstream task should run based on the condition of the upstream task. Currently, the Conditions support multiple upstream tasks, but only two downstream tasks. When the number of upstream tasks exceeds one, achieve complex upstream dependencies by through <code>and</code> and <code>or</code> operators.</p>\n<h2>Create Task</h2>\n<ul>\n<li>Click <code>Project -&gt; Management-Project -&gt; Name-Workflow Definition</code>, and click the &quot;Create Workflow&quot; button to enter the DAG editing page.</li>\n<li>Drag from the toolbar <img src=\"/img/conditions.png\" width=\"20\"/> task node to canvas.</li>\n</ul>\n<h2>Parameter</h2>\n<ul>\n<li>Node name: The node name in a workflow definition is unique.</li>\n<li>Run flag: Identifies whether this node schedules normally, if it does not need to execute, select the <code>prohibition execution</code>.</li>\n<li>Descriptive information: Describe the function of the node.</li>\n<li>Task priority: When the number of worker threads is insufficient, execute in the order of priority from high to low, and tasks with the same priority will execute in a first-in first-out order.</li>\n<li>Worker grouping: Assign tasks to the machines of the worker group to execute. If <code>Default</code> is selected, randomly select a worker machine for execution.</li>\n<li>Times of failed retry attempts: The number of times the task failed to resubmit. You can select from drop-down or fill-in a number.</li>\n<li>Failed retry interval: The time interval for resubmitting the task after a failed task. You can select from drop-down or fill-in a number.</li>\n<li>Timeout alarm: Check the timeout alarm and timeout failure. When the task runs exceed the &quot;timeout&quot;, an alarm email will send and the task execution will fail.</li>\n<li>Downstream tasks selection: Depending on the status of the predecessor task, you can jump to the corresponding branch, currently two branches are supported: success, failure\n<ul>\n<li>Success: When the upstream task runs successfully, run the success branch.</li>\n<li>Failure: When the upstream task runs failed, run the failure branch.</li>\n</ul>\n</li>\n<li>Upstream condition selection: can select one or more upstream tasks for conditions.\n<ul>\n<li>Add an upstream dependency: the first parameter is to choose a specified task name, and the second parameter is to choose the upstream task status to trigger conditions.</li>\n<li>Select upstream task relationship: use <code>and</code> and <code>or</code> operators to handle the complex relationship of upstream when there are multiple upstream tasks for conditions.</li>\n</ul>\n</li>\n</ul>\n<h2>Related Task</h2>\n<p><a href=\"switch.md\">switch</a>: Conditions task mainly executes the corresponding branch based on the execution status (success, failure) of the upstream nodes. The <a href=\"switch.md\">Switch</a> task node mainly executes the corresponding branch based on the value of the <a href=\"../parameter/global.md\">global parameter</a> and the result of user written expression.</p>\n<h2>Example</h2>\n<p>This sample demonstrates the operation of the Condition task by using the <a href=\"shell.md\">Shell</a> task.</p>\n<h3>1. Create workflow</h3>\n<p>Go to the workflow definition page, and then create the following task nodes:</p>\n<ul>\n<li>Node_A: Shell task, prints out &quot;hello world&quot;, its main function is the upstream branch of Condition, and triggers the corresponding branch node according to whether its execution is successful or not.</li>\n<li>Condition: The Conditions task executes the corresponding branch according to the execution status of the upstream task.</li>\n<li>Node_Success: Shell task, print out &quot;success&quot;, Node_A executes the successful branch.</li>\n<li>Node_False: Shell task, print out &quot;false&quot;, Node_A executes the failed branch.</li>\n</ul>\n<p><img src=\"/img/tasks/demo/condition_task01.png\" alt=\"condition_task01\"></p>\n<h3>2. View the execution result</h3>\n<p>After you finish creating the workflow, you can run the workflow online. You can view the execution status of each task on the workflow instance page. As shown below:</p>\n<p><img src=\"/img/tasks/demo/condition_task02.png\" alt=\"condition_task02\"></p>\n<p>In the above figure, the task status marked with a green check mark is the successfully executed task node.</p>\n<h2>Notice</h2>\n<ul>\n<li>The Conditions task supports multiple upstream tasks, but only two downstream tasks.</li>\n<li>The Conditions task and the workflow that contain it do not support copy operations.</li>\n<li>The predecessor task of Conditions cannot connect to its branch nodes, which will cause logical confusion and does not conform to DAG scheduling. The situation shown below is <strong>wrong</strong>.</li>\n</ul>\n<p><img src=\"/img/tasks/demo/condition_task03.png\" alt=\"condition_task03\">\n<img src=\"/img/tasks/demo/condition_task04.png\" alt=\"condition_task04\"></p>\n",
  "link": "/dist/en-us/docs/3.0.0/user_doc/guide/task/conditions.html",
  "meta": {}
}