{
  "filename": "load-balance.md",
  "__html": "<h3>Load Balance</h3>\n<p>Load balancing refers to the reasonable allocation of server pressure through routing algorithms (usually in cluster environments) to achieve the maximum optimization of server performance.</p>\n<h3>DolphinScheduler-Worker load balancing algorithms</h3>\n<p>DolphinScheduler-Master allocates tasks to workers, and by default provides three algorithms:</p>\n<p>Weighted random (random)</p>\n<p>Smoothing polling (roundrobin)</p>\n<p>Linear load (lowerweight)</p>\n<p>The default configuration is the linear load.</p>\n<p>As the routing is done on the client side, the master service, you can change master.host.selector in master.properties to configure the algorithm what you want.</p>\n<p>eg: master.host.selector = random (case-insensitive)</p>\n<h3>Worker load balancing configuration</h3>\n<p>The configuration file is worker.properties</p>\n<h4>weight</h4>\n<p>All of the above load algorithms are weighted based on weights, which affect the outcome of the triage. You can set different weights for different machines by modifying the worker.weight value.</p>\n<h4>Preheating</h4>\n<p>With JIT optimisation in mind, we will let the worker run at low power for a period of time after startup so that it can gradually reach its optimal state, a process we call preheating. If you are interested, you can read some articles about JIT.</p>\n<p>So the worker will gradually reach its maximum weight over time after it starts (by default ten minutes, we don't provide a configuration item, you can change it and submit a PR if needed).</p>\n<h3>Load balancing algorithm breakdown</h3>\n<h4>Random (weighted)</h4>\n<p>This algorithm is relatively simple, one of the matched workers is selected at random (the weighting affects his weighting).</p>\n<h4>Smoothed polling (weighted)</h4>\n<p>An obvious drawback of the weighted polling algorithm. Namely, under certain specific weights, weighted polling scheduling generates an uneven sequence of instances, and this unsmoothed load may cause some instances to experience transient high loads, leading to a risk of system downtime. To address this scheduling flaw, we provide a smooth weighted polling algorithm.</p>\n<p>Each worker is given two weights, weight (which remains constant after warm-up is complete) and current_weight (which changes dynamically), for each route. The current_weight + weight is iterated over all the workers, and the weight of all the workers is added up and counted as total_weight, then the worker with the largest current_weight is selected as the worker for this task. current_weight-total_weight.</p>\n<h4>Linear weighting (default algorithm)</h4>\n<p>The algorithm reports its own load information to the registry at regular intervals. We base our judgement on two main pieces of information</p>\n<ul>\n<li>load average (default is the number of CPU cores * 2)</li>\n<li>available physical memory (default is 0.3, in G)</li>\n</ul>\n<p>If either of the two is lower than the configured item, then this worker will not participate in the load. (no traffic will be allocated)</p>\n<p>You can customise the configuration by changing the following properties in worker.properties</p>\n<ul>\n<li>worker.max.cpuload.avg=-1 (worker max cpuload avg, only higher than the system cpu load average, worker server can be dispatched tasks. default value -1: the number of cpu cores * 2)</li>\n<li>worker.reserved.memory=0.3 (worker reserved memory, only lower than system available memory, worker server can be dispatched tasks. default value 0.3, the unit is G)</li>\n</ul>\n",
  "link": "/dist/en-us/docs/2.0.5/user_doc/architecture/load-balance.html",
  "meta": {}
}