{
  "__html": "<h1 id=\"logging-specification\">Logging specification</h1>\n<h2 id=\"preface\">Preface</h2>\n<p>Logs are used to track and record various actions during the development and operation of a system. Standardized log printing can help users or developers to quickly understand the system operation status and locate problems.</p>\n<p>Apache DolphinScheduler uses the Logback logging framework to print logs according to four levels: DEBUG, WARN, INFO, and ERROR, with a priority of DEBUG &lt; INFO &lt; WARN &lt; ERROR.</p>\n<h2 id=\"specifications\">Specifications</h2>\n<h3 id=\"logging-level-specification\">Logging level specification</h3>\n<p>Different levels of logs play different roles in the business process, and failure to use reasonable log levels for printing can cause great difficulties for system operations and maintenance.</p>\n<ul>\n<li>DEBUG level is used in the development and testing process to output debugging information. Developers should print parameter information, process details, and result information during debugging as much as possible using this level to facilitate locating and analyzing problems during the development and testing phases. In addition, it is prohibited to use this level to print logs in the production environment.</li>\n<li>INFO level is used to record information during system operation. The logs printed using this level should be able to reflect the behavior of the system, such as status changes of workflows, tasks, etc.</li>\n<li>WARN level is used to warn of problems that will occur during operation. For example, the checksum of API module parameters, etc.</li>\n<li>ERROR level is used to record some unpredictable errors and exceptions that will affect the system process. For example, errors and exceptions that cause workflows and tasks to fail to complete properly.</li>\n</ul>\n<h3 id=\"logging-content-specification\">Logging content specification</h3>\n<p>The content of the logs determines whether the logs can completely restore the system behavior or state.</p>\n<ul>\n<li>\n<p>DEBUG-level logs record debugging information during the development process, and appear at critical programs that need to be debugged, covering detailed site information, parameters, results, etc.</p>\n</li>\n<li>\n<p>INFO-level logs need to record the status information or operation information of the current program calls, and play the role of describing the system operation process. Therefore, the logs at this level need to appear at the critical point of the system operation, and their contents need to cover the description of the critical point, parameters and results. For example, when a workflow instance is scheduled, the status change of each key link is printed.</p>\n</li>\n<li>\n<p>WARN-level logs record information about tolerable errors that occur in current program calls that do not affect the normal operation of the system or functionality, but the content of this level log also needs to cover detailed site descriptions, parameters, and results. For example, when the API module interface parameter verification fails, the description of the verification failure and the parameters are recorded.</p>\n</li>\n<li>\n<p>ERROR-level logs record information about intolerable errors that occur in the current program call, which may cause the system or function to fail to operate normally. Therefore, the logs at this level need to record the error description, site parameters, error results, etc. in detail to ensure that the problem and the cause can be quickly located based on the log. In addition, when handling exceptions, if you are sure you want to print the stack information, use the following format:</p>\n<pre><code class=\"language-java\">logger.error(<span class=\"hljs-string\">&quot;description of current error, parameter is {}&quot;</span>, parameter, e);\n</code></pre>\n</li>\n</ul>\n<h3 id=\"logging-format-specification\">Logging format specification</h3>\n<p>The logs of Master module and Worker module are printed using the following format.</p>\n<pre><code class=\"language-xml\">[%level] %date{yyyy-MM-dd HH:mm:ss.SSS Z} %logger{96}:[%line] - [WorkflowInstance-%X{workflowInstanceId:-0}][TaskInstance-%X{taskInstanceId:-0}] - %msg%n\n</code></pre>\n<p>That is, the workflow instance ID and task instance ID are injected in the printed logs using MDC, so the developer needs to get the IDs and inject them before printing the logs related to the workflow instance and task instance in these two modules; after the printing is finished, the related IDs need to be removed.</p>\n<h2 id=\"logging-configuration\">Logging Configuration</h2>\n<p>DolphinScheduler uses <a href=\"https://docs.spring.io/spring-boot/docs/2.1.8.RELEASE/reference/html/howto-logging.html\">LogBack</a> for logging. To change the logging level of a specific package, you need to modify the <code>logback-spring.xml</code> file for the corresponding module.\nFor example, if you want to enable <code>DEBUG</code> logging for <code>org.springframework.web</code> package in <code>standalone</code> module, you need to add the following configurations in <code>apache-dolphinscheduler-dev-SNAPSHOT-bin/standalone-server/conf/logback-spring.xml</code>:</p>\n<pre><code class=\"language-xml\"><span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">configuration</span> <span class=\"hljs-attr\">scan</span>=<span class=\"hljs-string\">&quot;true&quot;</span> <span class=\"hljs-attr\">scanPeriod</span>=<span class=\"hljs-string\">&quot;120 seconds&quot;</span>&gt;</span>\n\n......\n\n  <span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">logger</span> <span class=\"hljs-attr\">name</span>=<span class=\"hljs-string\">&quot;org.springframework.web&quot;</span> <span class=\"hljs-attr\">level</span>=<span class=\"hljs-string\">&quot;DEBUG&quot;</span>&gt;</span>\n    <span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">appender-ref</span> <span class=\"hljs-attr\">ref</span>=<span class=\"hljs-string\">&quot;STANDALONELOGFILE&quot;</span> /&gt;</span>\n    <span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">appender-ref</span> <span class=\"hljs-attr\">ref</span>=<span class=\"hljs-string\">&quot;TASKLOGFILE&quot;</span>/&gt;</span>\n  <span class=\"hljs-tag\">&lt;/<span class=\"hljs-name\">logger</span>&gt;</span>\n\n......\n\n<span class=\"hljs-tag\">&lt;/<span class=\"hljs-name\">configuration</span>&gt;</span>\n</code></pre>\n<h2 id=\"cautions\">Cautions</h2>\n<ul>\n<li>Disable the use of standard output to print logs. Standard output can greatly affect system performance.</li>\n<li>The use of printStackTrace() is prohibited for exception handling. This method prints the exception stack information to the standard error output.</li>\n<li>Branch printing of logs is prohibited. The contents of the logs need to be associated with the relevant information in the log format, and printing them in separate lines will cause the contents of the logs to not match the time and other information, and cause the logs to be mixed in a large number of log environments, which will make log retrieval more difficult.</li>\n<li>The use of the &quot;+&quot; operator for splicing log content is prohibited. Use placeholders for formatting logs for printing to improve memory usage efficiency.</li>\n<li>When the log content includes object instances, you need to make sure to override the toString() method to prevent printing meaningless hashcode.</li>\n</ul>\n",
  "location": [
    "Contribution",
    "Guidelines",
    "Log Specification"
  ],
  "time": "2025-4-7",
  "structure": [
    {
      "title": "Preface",
      "children": [
        {
          "title": "Logging level specification",
          "children": [],
          "anchor": "logging-level-specification"
        },
        {
          "title": "Logging content specification",
          "children": [],
          "anchor": "logging-content-specification"
        },
        {
          "title": "Logging format specification",
          "children": [],
          "anchor": "logging-format-specification"
        }
      ],
      "anchor": "preface"
    },
    {
      "title": "Specifications",
      "children": [
        {
          "title": "Logging level specification",
          "children": [],
          "anchor": "logging-level-specification"
        },
        {
          "title": "Logging content specification",
          "children": [],
          "anchor": "logging-content-specification"
        },
        {
          "title": "Logging format specification",
          "children": [],
          "anchor": "logging-format-specification"
        }
      ],
      "anchor": "specifications"
    },
    {
      "title": "Logging Configuration",
      "children": [
        {
          "title": "Logging level specification",
          "children": [],
          "anchor": "logging-level-specification"
        },
        {
          "title": "Logging content specification",
          "children": [],
          "anchor": "logging-content-specification"
        },
        {
          "title": "Logging format specification",
          "children": [],
          "anchor": "logging-format-specification"
        }
      ],
      "anchor": "logging-configuration"
    },
    {
      "title": "Cautions",
      "children": [
        {
          "title": "Logging level specification",
          "children": [],
          "anchor": "logging-level-specification"
        },
        {
          "title": "Logging content specification",
          "children": [],
          "anchor": "logging-content-specification"
        },
        {
          "title": "Logging format specification",
          "children": [],
          "anchor": "logging-format-specification"
        }
      ],
      "anchor": "cautions"
    }
  ],
  "title": "Logging specification",
  "link": "/contribute/log-specification"
}