{
  "filename": "api-standard.md",
  "__html": "<h1>API design standard</h1>\n<p>A standardized and unified API is the cornerstone of project design.The API of DolphinScheduler follows the REST ful standard. REST ful is currently the most popular Internet software architecture. It has a clear structure, conforms to standards, is easy to understand and extend.</p>\n<p>This article uses the DolphinScheduler API as an example to explain how to construct a Restful API.</p>\n<h2>1. URI design</h2>\n<p>REST is &quot;Representational State Transfer&quot;.The design of Restful URI is based on resources.The resource corresponds to an entity on the network, for example: a piece of text, a picture, and a service. And each resource corresponds to a URI.</p>\n<ul>\n<li>One Kind of Resource: expressed in the plural, such as <code>task-instances</code>、<code>groups</code> ;</li>\n<li>A Resource: expressed in the singular, or use the ID to represent the corresponding resource, such as <code>group</code>、<code>groups/{groupId}</code>;</li>\n<li>Sub Resources: Resources under a certain resource, such as <code>/instances/{instanceId}/tasks</code>;</li>\n<li>A Sub Resource：<code>/instances/{instanceId}/tasks/{taskId}</code>;</li>\n</ul>\n<h2>2. Method design</h2>\n<p>We need to locate a certain resource by URI, and then use Method or declare actions in the path suffix to reflect the operation of the resource.</p>\n<h3>① Query - GET</h3>\n<p>Use URI to locate the resource, and use GET to indicate query.</p>\n<ul>\n<li>When the URI is a type of resource, it means to query a type of resource. For example, the following example indicates paging query <code>alter-groups</code>.</li>\n</ul>\n<pre><code>Method: GET\n/api/dolphinscheduler/alert-groups\n</code></pre>\n<ul>\n<li>When the URI is a single resource, it means to query this resource. For example, the following example means to query the specified <code>alter-group</code>.</li>\n</ul>\n<pre><code>Method: GET\n/api/dolphinscheduler/alter-groups/{id}\n</code></pre>\n<ul>\n<li>In addition, we can also express query sub-resources based on URI, as follows:</li>\n</ul>\n<pre><code>Method: GET\n/api/dolphinscheduler/projects/{projectId}/tasks\n</code></pre>\n<p><strong>The above examples all represent paging query. If we need to query all data, we need to add <code>/list</code> after the URI to distinguish. Do not mix the same API for both paged query and query.</strong></p>\n<pre><code>Method: GET\n/api/dolphinscheduler/alert-groups/list\n</code></pre>\n<h3>② Create - POST</h3>\n<p>Use URI to locate the resource, use POST to indicate create, and then return the created id to requester.</p>\n<ul>\n<li>create an <code>alter-group</code>：</li>\n</ul>\n<pre><code>Method: POST\n/api/dolphinscheduler/alter-groups\n</code></pre>\n<ul>\n<li>create sub-resources is also the same as above.</li>\n</ul>\n<pre><code>Method: POST\n/api/dolphinscheduler/alter-groups/{alterGroupId}/tasks\n</code></pre>\n<h3>③ Modify - PUT</h3>\n<p>Use URI to locate the resource, use PUT to indicate modify.</p>\n<ul>\n<li>modify an <code>alert-group</code></li>\n</ul>\n<pre><code>Method: PUT\n/api/dolphinscheduler/alter-groups/{alterGroupId}\n</code></pre>\n<h3>④ Delete -DELETE</h3>\n<p>Use URI to locate the resource, use DELETE to indicate delete.</p>\n<ul>\n<li>delete an <code>alert-group</code></li>\n</ul>\n<pre><code>Method: DELETE\n/api/dolphinscheduler/alter-groups/{alterGroupId}\n</code></pre>\n<ul>\n<li>batch deletion: batch delete the id array，we should use POST. <strong>（Do not use the DELETE method, because the body of the DELETE request has no semantic meaning, and it is possible that some gateways, proxies, and firewalls will directly strip off the request body after receiving the DELETE request.）</strong></li>\n</ul>\n<pre><code>Method: POST\n/api/dolphinscheduler/alter-groups/batch-delete\n</code></pre>\n<h3>⑤ Others</h3>\n<p>In addition to creating, deleting, modifying and quering, we also locate the corresponding resource through url, and then append operations to it after the path, such as:</p>\n<pre><code>/api/dolphinscheduler/alert-groups/verify-name\n/api/dolphinscheduler/projects/{projectCode}/process-instances/{code}/view-gantt\n</code></pre>\n<h2>3. Parameter design</h2>\n<p>There are two types of parameters, one is request parameter and the other is path parameter. And the parameter must use small hump.</p>\n<p>In the case of paging, if the parameter entered by the user is less than 1, the front end needs to automatically turn to 1, indicating that the first page is requested; When the backend finds that the parameter entered by the user is greater than the total number of pages, it should directly return to the last page.</p>\n<h2>4. Others design</h2>\n<h3>base URL</h3>\n<p>The URI of the project needs to use <code>/api/&lt;project_name&gt;</code> as the base path, so as to identify that these APIs are under this project.</p>\n<pre><code>/api/dolphinscheduler\n</code></pre>\n",
  "link": "/dist/en-us/development/api-standard.html",
  "meta": {}
}