{
  "filename": "context.md",
  "__html": "<h1>Parameter Context</h1>\n<p>DolphinScheduler provides the ability to refer to each other between parameters, including: local parameters refer to global parameters, and upstream and downstream parameter transfer. Because of the existence of references, it involves the priority of parameters when the parameter names are the same. see also <a href=\"priority.md\">Parameter Priority</a></p>\n<h2>Local task use global parameter</h2>\n<p>The premise of local tasks referencing global parameters is that you have already defined <a href=\"global.md\">Global Parameter</a>. The usage is similar to the usage in <a href=\"local.md\">local parameters</a>, but the value of the parameter needs to be configured as the key in the global parameter</p>\n<p><img src=\"/img/global_parameter.png\" alt=\"parameter-call-global-in-local\"></p>\n<p>As shown in the figure above, <code>${biz_date}</code> and <code>${biz_curdate}</code> are examples of local parameters referencing global parameters. Observe the last line of the above figure, local_param_bizdate uses ${global_bizdate} to refer to the global parameter. In the shell script, you can use ${local_param_bizdate} to refer to the value of the global variable global_bizdate, or set the value of local_param_bizdate directly through JDBC. In the same way, local_param refers to the global parameters defined in the previous section through ${local_param}. ​Biz_date, biz_curdate, system.datetime are all user-defined parameters, which are assigned via ${global parameters}.</p>\n<h2>Pass parameter from upstream task to downstream</h2>\n<p>DolphinScheduler Parameter transfer between tasks is allowed, and the current transfer direction only supports one-way transfer from upstream to downstream. The task types currently supporting this feature are：</p>\n<ul>\n<li><a href=\"../task/shell.md\">Shell</a></li>\n<li><a href=\"../task/sql.md\">SQL</a></li>\n<li><a href=\"../task/stored-procedure.md\">Procedure</a></li>\n</ul>\n<p>When defining an upstream node, if there is a need to transmit the result of that node to a downstream node that has a dependency. You need to set a parameter whose direction is OUT in [Custom Parameters] of [Current Node Settings]. At present, we mainly focus on the function of SQL and SHELL nodes that can input parameters.</p>\n<p>prop is user-specified; the direction is selected as OUT, and will be defined as parameter output only when the direction is OUT. The data type can be chosen from different data structures as needed; the value part is not required.</p>\n<p>If the result of the SQL node  has only one row, one or more fields, the name of the prop needs to be the same as the field name. The data type can be chosen to be something other than LIST. The parameter will select the value corresponding to the column with the same name as this parameter in the column name in the SQL query result.</p>\n<p>If the result of the SQL node is multiple rows, one or more fields, the name of the prop needs to be the same as the name of the field. The data type is selected as LIST, and the SQL query result will be converted to LIST, and the result will be converted to JSON as the value of the corresponding parameter.</p>\n<p>Let's take another example of the process that contains the SQL node in the above picture:</p>\n<p>The [createParam1] node in the above figure is defined as follows:</p>\n<p><img src=\"/img/globalParam/image-20210723104957031.png\" alt=\"png05\"></p>\n<p>[createParam2] node is defined as follows:</p>\n<p><img src=\"/img/globalParam/image-20210723105026924.png\" alt=\"png06\"></p>\n<p>You can find the value of the variable in the [Workflow Instance] page to find the corresponding node instance.</p>\n<p>Node instance [createparam1] is as follows:</p>\n<p><img src=\"/img/globalParam/image-20210723105131381.png\" alt=\"png07\"></p>\n<p>Here, the value of &quot;id&quot; is equal to 12.</p>\n<p>Let's see the case of the node instance [createparam2].</p>\n<p><img src=\"/img/globalParam/image-20210723105255850.png\" alt=\"png08\"></p>\n<p>There is only the value of &quot;id&quot;. Although the user-defined sql looks up the fields &quot;id&quot; and &quot;database_name&quot;, only one parameter is set because only one parameter &quot;id&quot; is defined for out. For display reasons, the length of the list is already checked for you here as 10.</p>\n<h3>SHELL</h3>\n<p>prop is user-specified. The direction is selected as OUT. The output is defined as a parameter only when the direction is OUT. Data type can choose different data structures as needed; the value part is not required to be filled. The user needs to pass the parameter, and when defining the shell script, the output format of ${setValue(key=value)} statement is required, key is the prop of the corresponding parameter, and value is the value of the parameter.</p>\n<p>For example, <code>echo '${setValue (trans = Hello trans)}'</code>, set &quot;trans&quot; to &quot;Hello trans&quot;, and the variable trans can be used in downstream tasks:</p>\n<img src=\"/img/globalParam/trans-shell.png\" alt=\"trans-shell\" style=\"zoom:50%;\" />\n<p>When the shell node is defined, when the log detects the format of ${setValue (key = value1)}, value1 will be assigned to the key, and the downstream node can directly use the value of the variable key. Similarly, you can find the corresponding node instance on the workflow instance page to view the value of the variable.</p>\n<img src=\"/img/globalParam/use-parameter-shell.png\" alt=\"use-parameter-shell\" style=\"zoom:50%;\" />\n",
  "link": "/dist/en-us/docs/2.0.5/user_doc/guide/parameter/context.html",
  "meta": {}
}