{
  "filename": "zeppelin.md",
  "__html": "<h1>Apache Zeppelin</h1>\n<h2>Overview</h2>\n<p>Use <code>Zeppelin Task</code> to create a zeppelin-type task and execute zeppelin notebook paragraphs. When the worker executes <code>Zeppelin Task</code>,\nit will call <code>Zeppelin Client API</code> to trigger zeppelin notebook paragraph. Click <a href=\"https://zeppelin.apache.org/\">here</a> for details about <code>Apache Zeppelin Notebook</code>.</p>\n<h2>Create Task</h2>\n<ul>\n<li>Click Project Management-Project Name-Workflow Definition, and click the &quot;Create Workflow&quot; button to enter the DAG editing page.</li>\n<li>Drag <img src=\"/img/tasks/icons/zeppelin.png\" width=\"15\"/> from the toolbar to the canvas.</li>\n</ul>\n<h2>Task Parameter</h2>\n<ul>\n<li>Node name: The node name in a workflow definition is unique.</li>\n<li>Run flag: Identifies whether this node can be scheduled normally, if it does not need to be executed, you can turn on the prohibition switch.</li>\n<li>Descriptive information: Describe the function of the node.</li>\n<li>Task priority: When the number of worker threads is insufficient, execute in the order of priority from high to low, and tasks with the same priority will execute in a first-in first-out order.</li>\n<li>Worker grouping: Assign tasks to the machines of the worker group to execute. If <code>Default</code> is selected, randomly select a worker machine for execution.</li>\n<li>Number of failed retry attempts: The failure task resubmitting times. It supports drop-down and hand-filling.</li>\n<li>Failed retry interval: The time interval for resubmitting the task after a failed task. It supports drop-down and hand-filling.</li>\n<li>Timeout alarm: Check the timeout alarm and timeout failure. When the task exceeds the &quot;timeout period&quot;, an alarm email will send and the task execution will fail.</li>\n<li>Zeppelin Note ID: The unique note id for a zeppelin notebook note.</li>\n<li>Zeppelin Paragraph ID: The unique paragraph id for a zeppelin notebook paragraph.</li>\n</ul>\n<h2>Task Example</h2>\n<h3>Zeppelin Paragraph Task Example</h3>\n<p>This example illustrates how to create a zeppelin paragraph task node.</p>\n<p><img src=\"/img/tasks/demo/zeppelin.png\" alt=\"demo-zeppelin-paragraph\"></p>\n<p><img src=\"/img/tasks/demo/zeppelin_id.png\" alt=\"demo-get-zeppelin-id\"></p>\n",
  "link": "/dist/en-us/docs/3.0.0/user_doc/guide/task/zeppelin.html",
  "meta": {}
}