{
  "filename": "conditions.md",
  "__html": "<h1>Conditions</h1>\n<p>Conditions is a condition node, determining which downstream task should be run based on the condition set to it. For now, the Conditions support multiple upstream tasks, but only two downstream tasks. When the number of upstream tasks exceeds one, complex upstream dependencies can be achieved through <code>and</code> and <code>or</code> operators.</p>\n<h2>Create</h2>\n<p>Drag in the toolbar<img src=\"/img/conditions.png\" width=\"20\"/>The task node to the drawing board to create a new Conditions task, as shown in the figure below:</p>\n  <p align=\"center\">\n   <img src=\"/img/condition_dag_en.png\" width=\"80%\" />\n  </p>\n  <p align=\"center\">\n   <img src=\"/img/condition_task_en.png\" width=\"80%\" />\n  </p>\n<h2>Parameter</h2>\n<ul>\n<li>Node name: The node name in a workflow definition is unique.</li>\n<li>Run flag: Identifies whether this node can be scheduled normally, if it does not need to be executed, you can turn on the prohibition switch.</li>\n<li>Descriptive information: describe the function of the node.</li>\n<li>Task priority: When the number of worker threads is insufficient, they are executed in order from high to low, and when the priority is the same, they are executed according to the first-in first-out principle.</li>\n<li>Worker grouping: Tasks are assigned to the machines of the worker group to execute. If Default is selected, a worker machine will be randomly selected for execution.</li>\n<li>Number of failed retry attempts: The number of times the task failed to be resubmitted. It supports drop-down and hand-filling.</li>\n<li>Failed retry interval: The time interval for resubmitting the task after a failed task. It supports drop-down and hand-filling.</li>\n<li>Timeout alarm: Check the timeout alarm and timeout failure. When the task exceeds the &quot;timeout period&quot;, an alarm email will be sent and the task execution will fail.</li>\n<li>Downstream tasks: Supports two branches for now, success and failure\n<ul>\n<li>Success: When the Conditions task runs successfully, run this downstream task</li>\n<li>Failure: When the Conditions task runs fails, run this downstream task</li>\n</ul>\n</li>\n<li>Upstream condition selection: one or more upstream tasks can be selected for conditions\n<ul>\n<li>Add the upstream dependency: Use the first parameter to choose task name, and the second parameter for status of the upsteam task.</li>\n<li>Upstream task relationship: we use <code>and</code> and <code>or</code> operators to handle complex relationship of upstream when multiple upstream tasks for Conditions task</li>\n</ul>\n</li>\n</ul>\n<h2>Related Task</h2>\n<p><a href=\"switch.md\">switch</a>: <a href=\"conditions.md\">Condition</a>task mainly executes the corresponding branch based on the execution status (success, failure) of the upstream node. The <a href=\"switch.md\">Switch</a> task mainly executes the corresponding branch based on the value of the <a href=\"../parameter/global.md\">global parameter</a> and the judgment expression result written by the user.</p>\n",
  "link": "/dist/en-us/docs/2.0.3/user_doc/guide/task/conditions.html",
  "meta": {}
}